[{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 70243679,
    "tag": "Horror Movies",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABStn99QM71ZkCLj5fHOa9CMjd1TN8P11Br9hPdp6x9SsoapaTS9g70RKru1Yrhd6iVEfCd_YzPX_ojFVXu6XuTLW26TdmdLpoLc.jpg?r=684",
    "source": "https://www.netflix.com/in/title/70243679",
    "index": 1,
    "name": "Evil Dead",
    "maturity": "A ",
    "duration": "1h 31m",
    "synopsis": "A group of friends discover an evil book and unwittingly release a swarm of bloodthirsty demons in this remake of Sam Raimi's classic horror flick.",
    "year": "2013",
    "spoilers": "\n\nRating 3: A teenage girl runs through the woods until she is caught by two pursuing hillbillies.\n\nRating 8: Subdued with a sack over her head, she awakens to find herself tied up in the fruit cellar of a remote cabin, where an old woman is reciting incantations from a strange book.\n\nRating 7: The girl pleads with her father Harold to release her.\n\nRating 8: After he refuses, she reveals her possession by a demonic spirit and threatens to kill him.\n\nRating 3: Harold sets her ablaze and shoots her dead.\n\nRating 10: Three years later, David Allen and his girlfriend Natalie arrive at the cabin with their dog Grandpa, where they meet his estranged younger sister Mia and her friends Eric, a high school teacher, and Olivia, a nurse.\n\nRating 3: The group plans to stay in the cabin while Mia overcomes her heroin addiction.\n\nRating 10: Mia begins having serious withdrawal symptoms and complains of an overwhelming scent of decay, which the others ignore.\n\nRating 10: David discovers that the cabin's cellar is littered with rotting animal corpses, a worn double-barrel shotgun, and a book called the Naturom Demonto.\n\nRating 10: A curious Eric reads an incantation from the book, awakening a malevolent force.\n\nRating 10: Mia begins seeing visions of a demonic doppelgänger of herself in the woods and begs the group to leave.\n\nRating 10: They refuse, thinking that she must be seeing hallucinations.\n\nRating 8: Mia steals Eric's car and leaves, but sees her doppelgänger and swerves, crashing into a pond.\n\nRating 8: She is chased by the force into the woods, tripping into a bramble where vines from a tree trap her.\n\nRating 8: Mia's doppelgänger appears, regurgitating a sentient vine that enters her body, possessing her.\n\nRating 6: David finds Grandpa beaten to death with a hammer and goes to confront Mia in the shower.\n\nRating 10: He discovers her scalding herself and tries to drive her to a hospital, but a sudden rainstorm washes out the road.\n\nRating 10: That night, a possessed Mia wounds her brother with the shotgun, declares that they are all going to die tonight, and vomits a large amount of red bile onto Olivia's face before Eric manages to lock her in the basement.\n\nRating 3: Olivia is later possessed.\n\nRating 10: When Eric discovers her in the shower mutilating her face, she stabs him repeatedly with a hypodermic needle before he bludgeons her to death.\n\nRating 5: Mia lures Natalie into the cellar and bites her hand before slicing her own tongue apart with a box cutter, and then forcibly kissing her.\n\nRating 3: David helps her escape before locking Mia back in.\n\nRating 3: Eric explains that according to the book, the \"Taker of Souls\" must claim five souls to unleash the \"Abomination\".\n\nRating 5: Natalie's arm soon becomes possessed and she amputates it with an electric knife.\n\nRating 8: Eric explains that Mia must be \"purified\" either by live burial, dismemberment, or burning.\n\nRating 10: The now-possessed Natalie attacks the pair with a nail gun, but David shoots her other arm off; Natalie returns to normal but soon bleeds to death from her injury.\n\nRating 10: David begins to douse the cabin in gasoline, but when Mia starts singing a song from their childhood, he decides to bury her instead.\n\nRating 10: He digs a grave and heads into the cellar to retrieve Mia, who attempts to drown him.\n\nRating 8: Eric intervenes but is fatally stabbed.\n\nRating 3: David sedates and buries Mia, and after hearing her heartbeat stop, quickly digs her up and attempts to use a homemade defibrillator to resuscitate her.\n\nRating 8: After several seemingly failed attempts, David covers his sister and says she's \"at peace\".\n\nRating 10: Returning to the cabin, he hears a voice behind him and finds Mia alive.\n\nRating 10: David enters the cabin to retrieve his car keys, but Eric's possessed corpse stabs him.\n\nRating 6: David locks Mia out to protect her and shoots a gasoline can, killing both him and Eric in the resulting blaze.\n\nRating 8: With David's death being the fifth claimed soul, blood begins to rain down from the sky and Mia is attacked by the Abomination in the form of her demonic doppelgänger.\n\nRating 10: Mia finds a chainsaw and severs the Abomination's legs, but it retaliates by overturning David's Jeep which lands on her left arm and traps her.\n\nRating 3: Pushed to her breaking point, Mia frees herself by amputating her left hand, grabs the chainsaw, and bisects the Abomination's head before it sinks back into the ground and the rain stops.\n\nRating 10: An exhausted Mia leaves to search for help, unaware the Naturom Demonto is still intact, and slamming shut on its own.\n\nRating 7: In a post-credits scene, an older Ash Williams  is seen in shadowed profile."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 80106763,
    "tag": "Horror Movies",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABUP01a1TRGhwmZWswktC9-M65u2gcpU9ELbwrci6pDHXJUYANgMCQ2xx5dz6aeS87s_AOiwvzOYyGVvH1p_-70GUsNTdjvhyoGY.jpg?r=a14",
    "source": "https://www.netflix.com/in/title/80106763",
    "index": 2,
    "name": "Ouija: Origin of Evil",
    "maturity": "U/A 13+ ",
    "duration": "1h 39m",
    "synopsis": "In 1960s California, a fake medium's daughter tries to communicate with her late father through a Ouija board, but unleashes a demon instead.",
    "year": "2016",
    "spoilers": "\n\nRating 10: In 1967  Los Angeles, a young widow named Alice Zander works out of her suburban home as a spiritual medium, accompanied by her daughters, 15-year-old Paulina \"Lina\" and 9-year-old Doris.\n\nRating 7: The family is reeling over the recent death of Roger, Alice's husband and the kids' father.\n\nRating 8: Alice incorporates a Ouija board into her readings and unknowingly contacts a spirit named Marcus that begins to possess Doris.\n\nRating 3: Alice receives notice that the bank intends to foreclose on their home.\n\nRating 3: Doris contacts the board for help, believing she is communicating with her dead father.\n\nRating 4: The spirit leads her to a secret compartment in the basement wall containing a pouch of cash.\n\nRating 5: When she gives the money to her mother, the family has a Ouija session.\n\nRating 10: When the board answers a question only Roger would know the answer to, a thrilled Alice begins believing that they are in contact with him.\n\nRating 10: Soon, Doris becomes fully possessed by the spirit.\n\nRating 10: Lina, disturbed by the changes in her sister, finds papers written by Doris in fluent Polish, a language she does not know, and brings them to Father Tom Hogan, her school principal.\n\nRating 8: Troubled, Father Tom visits them for a Ouija session under the pretense of contacting his dead wife Gloria.\n\nRating 10: He later explains to them that Doris did not contact Gloria.\n\nRating 8: Instead, for every question he asked, she read his thoughts and repeated the answers he was thinking in his mind.\n\nRating 3: The pages are entries written by a Polish immigrant named Marcus, who was taken captive during World War II by a sadistic doctor who conducted experiments on him and other captives in the house's basement.\n\nRating 10: These spirits have been watching the family since the day they moved in.\n\nRating 10: Doris kills Lina's new boyfriend Mikey when he comes to visit.\n\nRating 5: Father Tom, Alice, and Lina burn the Ouija board; Father Tom finds the secret room where the experiments were conducted, and is possessed by the spirits, only to be killed later by Doris.\n\nRating 10: Alice is captured, while Roger's spirit carries an unconscious Lina to her bed.\n\nRating 10: Recalling earlier when her doll's mouth was stitched shut by her father's spirit \"to shut out the voices\" for Doris, Lina realizes she must sew Doris' mouth shut to quiet the spirits' voices.\n\nRating 10: She sews Doris' mouth shut but kills Doris in the process.\n\nRating 10: Doris wakes up as a ghost and is happily reunited with her father.\n\nRating 3: The spirits possess Lina and stab Alice.\n\nRating 8: Alice tells Lina that it was not her fault before dying, leaving Lina devastated.\n\nRating 10: Lina is committed in a mental hospital for the suspected murder of her mother and disappearance of her sister.\n\nRating 8: Alone in her room, she creates a Ouija board on the floor with her blood and tries to summon Doris but summons an evil spirit in Doris’ form instead.\n\nRating 3: In a post-credits scene, 47 years later in 2014, a now elderly and still institutionalized Lina receives a visit from someone claiming to be her niece."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "Mysteries",
        "US Movies"
    ],
    "id": 81238605,
    "tag": "Horror Movies",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABWoYgwKN6mR2TQrB540ABYx10EeAGvq9cbk4Lg-CzZuHNl8rTsOUohFVXCber3SsUwhWXdR44VhGmmvkaatAfYtNrtGB8v9ZFWQ.jpg?r=555",
    "source": "https://www.netflix.com/in/title/81238605",
    "index": 3,
    "name": "The Conjuring: The Devil Made Me Do It",
    "maturity": "U/A 16+ ",
    "duration": "1h 51m",
    "synopsis": "Two paranormal investigators risk their lives to prove the existence of demonic forces in order to exonerate a young man accused of murder.",
    "year": "2021",
    "spoilers": "\n\nRating 3: In 1981, demonologists Ed and Lorraine Warren document the exorcism of 8-year-old David Glatzel, attended by his family, his sister Debbie, her boyfriend Arne Johnson, and Father Gordon in Brookfield, Connecticut.\n\nRating 3: During the exorcism, Arne invites the demon to enter his body instead of David's.\n\nRating 8: Ed witnesses the demon transport itself from David's body to Arne's while he suffers from a heart attack and is taken to a hospital in an unconscious state.\n\nRating 8: The following month, Ed wakes up at the hospital and reveals to Lorraine that he witnessed the demon enter Arne's body.\n\nRating 8: She sends the police to the Glatzel household, warning them that a tragedy will occur there.\n\nRating 7: Arne and Debbie return to their apartment located above a kennel where Debbie works.\n\nRating 8: After feeling unwell, Arne murders his landlord, Bruno Sauls, by stabbing him 22 times due to his demonic possession.\n\nRating 10: With the support of the Warrens, his case becomes the first American murder trial to claim demonic possession as a defense, resulting in the beginning of an investigation into David's original possession.\n\nRating 3: The Warrens later discover a satanic curse passed on through a witch's totem and meet with Kastner, a former priest who previously dealt with the Disciples of the Ram cult.\n\nRating 10: He tells them that an occultist had intentionally left the totem, resulting in the creation of a curse on the Glatzels, causing the possession of David.\n\nRating 3: The Warrens travel to Danvers, Massachusetts, to investigate the death of Katie Lincoln, who was also stabbed 22 times.\n\nRating 8: Detectives had found a totem at the home of Katie's friend Jessica, who is missing.\n\nRating 8: Lorraine initiates a vision to recreate the murder and discovers that Jessica had stabbed Katie while possessed before jumping to her death off of a cliff, which allows detectives to recover her body.\n\nRating 8: The Warrens travel to the funeral home where her body rests, and Lorraine touches the corpse's hand to help find the location of the occultist.\n\nRating 3: Lorraine, in a vision, witnesses the occultist attempting to have Arne kill himself but stops her just in time.\n\nRating 10: Lorraine is threatened by the occultist and she tells Ed that the connection works both ways.\n\nRating 3: The Warrens return to their house in Connecticut to investigate further.\n\nRating 8: Drew reveals that he has found a book of Stregherian witchcraft which states that for the curse to be lifted, the altar used by the occultist must be destroyed.\n\nRating 8: Ed is affected by the curse, a totem being discovered in a vase of flowers delivered to the house, but is stopped by Drew when attacking Lorraine.\n\nRating 8: When they realize Katie attended nearby Fairfield University, they begin to assume the occultist is operating in the area.\n\nRating 3: Lorraine returns to Kastner for help, and he reveals that he had secretly raised a daughter, Isla, in violation of the requirement of clerical celibacy in the Catholic Church.\n\nRating 10: As he researched the occult, Isla grew fascinated in it, later becoming the occultist.\n\nRating 8: Kastner tells Lorraine that Isla's altar must be in the tunnels underneath the house, leading her into them before Isla finds and kills him.\n\nRating 8: Ed soon arrives and finds his way into the tunnels through a locked drain hole with a sledgehammer.\n\nRating 10: He is briefly bewitched by Isla and attempts to kill Lorraine, but she forces him to recall the time they first met, reminding him of their love.\n\nRating 3: Ed regains his senses and destroys the altar, saving himself, Lorraine and Arne.\n\nRating 9: Isla arrives at her broken altar, only to be killed by the demon she had summoned after failing to complete the curse.\n\nRating 3: Ed places the cup from the altar in the artifact room, along with the Valak painting and the Annabelle doll.\n\nRating 8: Arne is convicted of manslaughter but ends up serving a sentence of only five years, marrying Debbie while in prison.\n\nRating 10: Ed shows Lorraine a gazebo like the one in which they first kissed."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 81483977,
    "tag": "Horror Movies",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABXXe-V5v6qOYuv5z-zScGdaP_rrQOSWq6eCAHlvG56qRk9eGYf6o36aPis2wXf4T53I4ab5RRwec_eNp5arT0U4cwk8c8OAgMZDXtmZtAkknbQ-IyFGnEMULOinmLikQZnOj.jpg?r=306",
    "source": "https://www.netflix.com/in/title/81483977",
    "index": 4,
    "name": "Texas Chainsaw Massacre",
    "maturity": "A ",
    "duration": "1h 23m",
    "synopsis": "In this sequel, influencers looking to breathe new life into a Texas ghost town encounter Leatherface, an infamous killer who wears a mask of human skin.",
    "year": "2022",
    "spoilers": "\n\nRating 3: Fifty years after Leatherface's killing spree in 1973, young entrepreneurs Melody and Dante, Melody's sister Lila and Dante's girlfriend Ruth travel to the abandoned Texas town of Harlow, to auction off old properties to create a trendy, heavily gentrified area.\n\nRating 8: While inspecting a dilapidated orphanage, the group discover it is still occupied by an elderly woman called Ginny.\n\nRating 3: When she claims she has papers to prove she still owns the property, an argument breaks out, briefly interrupted by a silent and towering man from upstairs.\n\nRating 10: Ginny then collapses from a heart attack and is rushed to the hospital, accompanied by Ruth and the man.\n\nRating 3: An investor, Catherine, along with a group of potential buyers arrive in Harlow on a large bus, distracting Melody and Dante.\n\nRating 8: Meanwhile, Lila strikes up a friendship with a local mechanic, Richter, and reveals she was a survivor of a school shooting, leaving her terrified of guns.\n\nRating 10: Ginny dies en route to the hospital; Ruth texts Melody before the man goes berserk and murders the officers driving the ambulance, leading it to crash.\n\nRating 7: When Ruth awakes, she witnesses the man, revealed to be Leatherface, cutting off Ginny's face to wear as a mask.\n\nRating 3: Ruth manages to radio for help before being killed by Leatherface, who makes his way back to Harlow.\n\nRating 3: During a property auction, Melody reads Ruth's texts and prepares to leave with Lila.\n\nRating 7: Richter overhears them talking about Ginny's death and takes their keys, agreeing to give them back once they provide proof they rightfully removed Ginny from her home.\n\nRating 9: Melody and Dante return to the orphanage to find them.\n\nRating 9: Sally Hardesty, the sole survivor of Leatherface's previous killing spree and now a battle-hardened Texas Ranger, learns of Ruth's attack and heads out to investigate.\n\nRating 3: At the orphanage, Melody discovers the papers and realizes that Ginny was wrongfully evicted.\n\nRating 8: Leatherface arrives at the orphanage and attacks Dante, mutilating him.\n\nRating 7: Melody hides as Leatherface retrieves his chainsaw from his bedroom.\n\nRating 10: A thunderstorm hits Harlow as night falls, and Catherine and Lila take cover in the bus with the buyers.\n\nRating 8: Dante manages to stumble out of the orphanage where he is discovered by Richter before bleeding to death.\n\nRating 10: Richter enters the orphanage and is attacked and killed by Leatherface.\n\nRating 3: Melody retrieves the car and bus keys from his body before fleeing the house, reuniting with Lila.\n\nRating 3: They get on the bus, pursued by Leatherface who slaughters all of the people aboard, including Catherine.\n\nRating 3: Melody and Lila escape the carnage and come across Sally who locks them in her car before entering the orphanage to finally confront Leatherface.\n\nRating 8: She holds him at gunpoint, demanding he remembers the pain he inflicted on her and her friends, but is met by only silence before Leatherface walks away.\n\nRating 3: Leatherface then attacks the sisters in Sally's car but they are saved by Sally who shoots him.\n\nRating 3: Sally gives Melody the keys to drive away before pursuing Leatherface.\n\nRating 8: Leatherface ambushes and fatally injures Sally.\n\nRating 9: Melody hits Leatherface with Sally's car before crashing into a nearby building; Melody is trapped but orders Lila to run away.\n\nRating 8: When Leatherface appears,  Melody apologizes for what they did to Ginny.\n\nRating 10: As he moves in to attack, Lila attempts to shoot him, but her gun is empty.\n\nRating 10: Sally shoots him instead and he flees.\n\nRating 8: Before dying, she encourages Lila not to run as she will be forever haunted by him as she was.\n\nRating 3: Lila then takes Sally's shotgun and pursues Leatherface into an abandoned building where she is ambushed and attacked.\n\nRating 10: Melody arrives and takes Leatherface's chainsaw before using it to uppercut him, knocking him into a pool of water where he sinks to the bottom.\n\nRating 3: They escape and Lila finds Sally's hat and puts it on before starting the morning drive back home.\n\nRating 3: Leatherface emerges, still alive, and drags Melody out of the car before decapitating her with his chainsaw in the middle of the street.\n\nRating 8: A horrified Lila watches as the self-driving car takes her out of Harlow.\n\nRating 3: Leatherface dances in the street with his chainsaw and Melody's head."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies"
    ],
    "id": 81240831,
    "tag": "Horror Movies",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABbhpqmbIzbiwkY9AX0hgYsK2OSg9-XdIIzFG6tRlrptVs9q5WesCWjODnMcDX0LPEAv4MxavY7xe2ZV1QSFfM6a-W-tFtMV4MpJdP9pyN-Cb2LNoqWeTZCeN4cj0hU2cnxpu.jpg?r=182",
    "source": "https://www.netflix.com/in/title/81240831",
    "index": 5,
    "name": "#Alive",
    "maturity": "U/A 16+ ",
    "duration": "1h 38m",
    "synopsis": "As a grisly virus rampages a city, a lone man stays locked inside his apartment, digitally cut off from seeking help and desperate to find a way out.",
    "year": "2020",
    "spoilers": "\n\nRating 7: Oh Joon-woo is alone in his family's apartment when zombies begin to attack and infect people outside.\n\nRating 3: When he inspects the apartment hallway, a neighbour barges in.\n\nRating 10: He begs to stay, but becomes a zombie and attacks Joon-woo.\n\nRating 8: Joon-woo pushes him out and locks the door, then watches a large zombie attack his neighbour through the peephole.\n\nRating 3: Joon-woo then receives messages from his parents telling him they are safe.\n\nRating 9: Joon-woo blocks his front door with the fridge and posts a rescue request on social media.\n\nRating 10: By attaching his phone to a drone, he scouts his neighbourhood and realizes it is now overrun.\n\nRating 10: Though the emergency power stays on, Joon-woo gradually loses access to phone networks, the internet, and running water.\n\nRating 5: One night, Joon-woo sees zombies taking down a police officer outside.\n\nRating 10: He screams at them, leading a zombie to break into the apartment and knock over the fridge, destroying the food.\n\nRating 3: Joon-woo lures it into falling off the balcony.\n\nRating 3: He resorts to drinking liquor to survive, but hallucinates about his family due to hunger and thirst.\n\nRating 9: When the phone network is momentarily restored, Joon-woo receives a voicemail from his family recording their refuge being overrun.\n\nRating 10: His rage causes him to leave the apartment and attack zombies, but when a horde attacks, he flees and barely manages to sneak back inside.\n\nRating 10: Joon-woo attempts to hang himself, but stops when he sees a laser pointer's light.\n\nRating 3: The signal comes from Kim Yoo-bin, a survivor living in the opposite apartment building.\n\nRating 10: Yoo-bin tries to set up a zip line between their apartments by tying a cable to her table and throwing the other end to Joon-woo, but it lands in the street.\n\nRating 8: Joon-woo uses his drone to set up another line successfully, but an infected firefighter pulls on the first cable, causing Yoo-bin's table to fly across her apartment, knock her out, and lodge into her balcony railing.\n\nRating 9: The zombie starts climbing the cable.\n\nRating 7: Joon-woo distracts him by sacrificing his drone, giving Yoo-bin enough time to wake up and kill the zombie.\n\nRating 7: Joon-woo raids his neighbour's unit for food, clothing, and walkie-talkies, narrowly avoiding his zombified neighbour.\n\nRating 8: He sends a walkie-talkie to Yoo-bin, and the two talk and bond.\n\nRating 10: Suddenly, the infected hordes become agitated and a nervous Yoo-bin accidentally knocks over a shelf.\n\nRating 3: The noise causes zombies to converge at her door.\n\nRating 9: Joon-woo distracts them by calling the unit adjacent to hers.\n\nRating 10: Yoo-bin says the 8th floor of Joon-woo's apartment looks empty.\n\nRating 3: The pair gear up, rappel from their balconies, and fight their way to the 8th floor, but the doors are locked and the zombies have followed them.\n\nRating 10: Suddenly, a stranger emerges from the last suite on the floor and saves them.\n\nRating 10: He gives them food and water, but it is drugged, and Joon-woo falls asleep.\n\nRating 3: The stranger binds the pair's wrists and locks Yoo-bin in a bedroom with his restrained, infected wife.\n\nRating 3: Joon-woo wakes up and threatens the stranger, but he releases his wife's restraints from outside the bedroom.\n\nRating 8: Once Yoo-bin goes silent, the stranger opens the bedroom door, only to find Yoo-bin managed to wrap the infected wife's head in fabric.\n\nRating 10: The infected wife attacks her husband, and Yoo-bin shoots them both.\n\nRating 3: The gunshots attract more zombies.\n\nRating 5: Yoo-bin asks Joon-woo to kill her before they get in.\n\nRating 3: As he hesitates, they hear helicopters outside.\n\nRating 3: The pair rush to the rooftop, chased by the infected.\n\nRating 10: Just before they are overwhelmed, an army helicopter holds off the zombies and carries the pair to safety.\n\nRating 8: A voiceover by an anchor explains wireless networks are being restored and the military is rescuing survivors who made social media posts.\n\nRating 8: The film ends with Joon-woo's social media post's hashtag \"#StayAlive\" changing its wording to \"#Alive\"."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 80219131,
    "tag": "Horror Movies",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABSRAiiVVZvglll8JOPZkeOEVPwqzLtL4-_60lDABv00L2bsQ22_atGLxhThYQyFBx1IchbnOtroyAjNe6T1el8YxOcnjLM9YeZE.jpg?r=2f1",
    "source": "https://www.netflix.com/in/title/80219131",
    "index": 6,
    "name": "The Grudge",
    "maturity": "A ",
    "duration": "1h 33m",
    "synopsis": "An investigator follows the trail of a grisly case back to a cursed house harboring a tangled, gruesome history — and an ugly, boundless rage.",
    "year": "2020",
    "spoilers": "\n\nRating 10: In 2004, live-in nurse Fiona Landers leaves a house in Tokyo, appearing disturbed.\n\nRating 3: Fiona informs her co-worker, Yoko, that she is returning to America before encountering the ghost of Kayako Saeki.\n\nRating 10: Fiona arrives at her home on 44 Reyburn Drive in a small town in Pennsylvania, reuniting with her husband Sam and young daughter Melinda.\n\nRating 10: Kayako's curse, however, possesses Fiona, causing her to bludgeon Sam to death and drown Melinda before committing suicide by stabbing herself in the throat.\n\nRating 4: Detectives Goodman and Wilson investigate the Landers murders.\n\nRating 8: Unsettled by the house, Goodman refuses to enter, while Wilson enters to examine the scene.\n\nRating 10: Upon exiting, Wilson slowly starts to lose his mind, and eventually becomes hysterical when he spots Fiona's ghost outside Goodman's car; after which he attempts to commit suicide by shooting himself, but survives, leaving him disfigured and committed to a psychiatric asylum.\n\nRating 10: Goodman stops looking into the case.\n\nRating 8: Shortly after the Landers are murdered, but before anyone discovers their deaths, real estate agents Peter and Nina Spencer learn that their unborn child will most likely be born with the rare genetic disorder ALD.\n\nRating 10: Peter goes to look into selling 44 Reyburn Drive and stumbles across Melinda's ghost, presuming her to be a lost girl, who is bleeding profusely from her nose.\n\nRating 8: While on the phone with Peter, Nina agrees that they should keep their child.\n\nRating 10: Peter is attacked by Fiona and Melinda's ghosts before fleeing the house and is quickly corrupted by the curse.\n\nRating 10: The possessed Peter returns to his home, where he kills Nina and their unborn child before he drowns himself  in the bathtub.\n\nRating 10: In 2005, elderly couple Faith and William Matheson move into the house.\n\nRating 10: Faith suffers from dementia and a terminal illness.\n\nRating 8: After moving in, Faith is infected by the curse and starts to see Melinda around the house.\n\nRating 10: Her sanity rapidly declines, causing William to call over Lorna Moody, an assisted suicide consultant.\n\nRating 8: Disturbed, Lorna suggests to William that they leave the house, but William reveals that he is aware of the ghosts and suggests that it implies a future where people get to be with their loved ones after death.\n\nRating 5: Lorna later discovers that Faith has killed William and has sliced off her own fingers.\n\nRating 10: Lorna flees in horror only to be attacked by Sam's ghost in her car which crashes, killing her.\n\nRating 8: In 2006, rookie detective Muldoon moves to town with her son Burke following her husband's death from cancer.\n\nRating 8: Muldoon along with Goodman, her new partner, are called to the woods where Lorna's corpse has been discovered.\n\nRating 10: Goodman becomes uncomfortable when they learn that Lorna had been visiting 44 Reyburn Drive.\n\nRating 3: Noticing this, Muldoon questions him, and he reveals his suspicion that the house is cursed, and states he wants nothing to do with it.\n\nRating 8: Muldoon goes to the house, discovering a disoriented Faith and William's corpse.\n\nRating 10: Faith is taken to a hospital, where she sees Melinda and throws herself off a staircase landing, committing suicide.\n\nRating 3: As Muldoon continues her research into the case, she is haunted by the ghosts of the Landers.\n\nRating 3: She visits Wilson in the asylum, who tells her that all people who enter the house will become victims of the curse.\n\nRating 8: Wilson then gouges out his eyes so he can stop seeing the ghosts.\n\nRating 8: Fearful that the curse may make her hurt her son, Muldoon confides in Goodman and learns that the curse began with a family in Japan; Fiona is the one who brought it abroad.\n\nRating 3: After she is attacked by the Landers' ghosts again, Muldoon goes to the house and douses it in gasoline as she sees visions of how Fiona murdered her family.\n\nRating 10: She is tricked into seeing Burke, however she realizes it isn't really him after he fails to repeat a phrase the two of them use regularly.\n\nRating 6: The house burns to the ground as Muldoon embraces her real son outside.\n\nRating 3: Sometime later, Muldoon hugs Burke before he leaves for school, only to see the real Burke leave the house.\n\nRating 7: The \"Burke\" she is hugging is revealed to be Melinda.\n\nRating 10: Muldoon is dragged away by Fiona's ghost, becoming the next victim of the curse.\n\nRating 9: After Muldoon burns the house to the ground, she sees Burke watching her.\n\nRating 3: Sometime later, the pair is driving on a road toward a new home.\n\nRating 10: As they pull into the driveway of their home and enter, the credits begin rolling."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 81001691,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81001691",
    "index": 7,
    "name": "Escape Room",
    "maturity": "U/A 16+ ",
    "duration": "1h 39m",
    "synopsis": "Six strangers use their wits to survive a series of deadly mystery rooms that cater to their worst fears -- or die trying.",
    "year": "2019",
    "spoilers": "\n\nRating 10: Six people from varied backgrounds are presented with a puzzle cube: Zoey, a physics student; Jason, a wealthy daytrader; Ben, a stockboy; Mike, a truck driver; Amanda, an Iraq War veteran; and Danny, an escape room enthusiast.\n\nRating 7: When they solve the puzzle, they are invited to take part in an escape room with a $10,000 prize.\n\nRating 10: The participants arrive at an office block with no greeting, and when Ben tries to leave, the door handle falls off, revealing that the challenge has begun.\n\nRating 3: They escape the first two rooms, a giant heating oven and a winter cabin.\n\nRating 10: After finding the key, however, the rooms become fatal.\n\nRating 10: Danny falls through the ice in an icy room and drowns; Amanda plummets to her death in an upside-down billiards bar where parts of the floor periodically fall into a deep shaft below; Jason shocks Mike to death to solve a puzzle in a hospital room filling up with poisonous gas; and in a room with optical illusions and strobe lights, Ben kills Jason over an antidote required to escape.\n\nRating 7: Some rooms, through songs playing, coats, and hospital beds, remind the players of them being sole survivors of various disasters; Mike escaped a mine cave-in, Zoey survived a plane crash, Danny survived when his family died of carbon monoxide poisoning, Amanda survived an IED blast, Jason survived a shipwreck in frigid weather, and Ben survived a car accident where his friends died.\n\nRating 3: Zoey realizes that the purpose of the game is to determine which player is the luckiest.\n\nRating 10: Ben, after escaping the last room where a wall moves inwards to crush him, meets the Gamemaster, who controls the game that the Puzzle Maker designed.\n\nRating 4: The Gamemaster explains that each year they lure in players with something in common – college athletes, savants, etc. – and wealthy viewers bet on the result, with the current game luring in sole survivors of previous disasters.\n\nRating 7: The Gamemaster tries to kill Ben, but Zoey intervenes, and together they kill the Gamemaster.\n\nRating 8: As Ben recovers, Zoey returns to the building with a detective.\n\nRating 10: The police do not believe Zoey, as all evidence of the game has disappeared.\n\nRating 10: They do not believe Ben either, as he was found to have drugs in his system.\n\nRating 8: While looking at the graffiti on the wall, Zoey notices the words \"Wootan Yu\" and realizes they are an anagram for \"No Way Out\", suggesting the game is not over.\n\nRating 3: Six months later, Zoey meets up with Ben and shows him newspaper articles that passed off the other players' deaths as everyday accidents.\n\nRating 8: When Ben suggests Zoey should move on, she refuses.\n\nRating 10: She reveals clues to Ben that point to an unlisted building in Manhattan.\n\nRating 10: Ben agrees to go with her.\n\nRating 7: However, the Puzzle Maker is already preparing to make their flight a new deadly game of survival."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 81069919,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81069919",
    "index": 8,
    "name": "The Possession of Hannah Grace",
    "maturity": "A ",
    "duration": "1h 25m",
    "synopsis": "When a former cop lands a job at a morgue, her graveyard shift takes a terrifying turn with the delivery of a young girl's haunted corpse.",
    "year": "2018",
    "spoilers": "\n\nRating 10: During an exorcism ritual, the possessed Hannah Grace almost kills the priest by choking him while suspended in midair.\n\nRating 10: Her father, Grainger, then suffocates her to death using a pillow, and as she dies the priest drops to the floor gasping for breath.\n\nRating 3: As her father sobs over her dead body, a fly lands on her hand and it twitches ominously.\n\nRating 3: Three months later, Megan Reed, an ex-cop with the Boston Police Department struggles with depression and an addiction to pills after her patrol partner was shot dead by a criminal whom she failed to subdue.\n\nRating 3: Megan's friend Lisa Roberts finds her a nightshift job in the Boston Metro Hospital's morgue, located in an intimidating brutalist architecture building .\n\nRating 7: During Megan's second shift, a man  aggressively tries to convince her to let him into the building, but she denies and informs the two security guards Ernie Gainor and Dave.\n\nRating 3: However, shortly after, Megan helps EMT Randy to move the corpse of a brutally murdered young woman  into the building and the man secretly enters the building.\n\nRating 8: Randy tells Megan a man stabbed Hannah  to death and was then caught in the act trying to burn her body in an alleyway.\n\nRating 10: When Megan tries to fingerprint and photograph Hannah's corpse, the camera explodes and the fingerprints return as illegible by the computer.\n\nRating 8: Other strange things occur and Megan becomes more suspicious of the corpse.\n\nRating 8: Megan subsequently researches on the internet only to find out that Hannah had died during an exorcism.\n\nRating 10: She also notices that Hannah's bright blue eye color does not match the one listed on her driver's license.\n\nRating 3: Megan soon encounters Grainger who had invaded the building trying to drag Hannah's corpse through the building.\n\nRating 10: Alongside with the two security guards Ernie and Dave, Megan manages to subdue Grainger.\n\nRating 8: The latter screams Hannah's corpse must be burnt because she isn't really dead, but they do not listen to him and have him arrested by the police.\n\nRating 10: Megan's ex-boyfriend, Andrew Kurtz, is still employed as an officer and responds to the scene.\n\nRating 3: He agrees to help Megan identify the corpse after she tells him about the color of Hannah's eyes.\n\nRating 8: Soon after, Andrew tells Megan that Hannah Grace had died three months earlier and asked Megan whether the given finger prints was Hannah's.\n\nRating 10: Megan confirmed it and Andrew thought maybe there is some error in the computer data.\n\nRating 8: Meanwhile, Hannah kills Dave by telekinetically lifting his body across the ceiling and into her refrigerated drawer in the morgue where she breaks his body.\n\nRating 10: Soon after, Megan notices that some of the wounds on Hannah are missing, as if it had healed by itself.\n\nRating 4: Investigating the security footage, Megan sees a glimpse of Hannah's corpse crawling around in the building.\n\nRating 8: She shows the footage to Lisa who does not believe her and accuses her of having a relapse on her addiction to pills.\n\nRating 10: Lisa is killed by Hannah soon after.\n\nRating 10: When Randy returns to the morgue to deliver another corpse, Megan shows Randy the healing body of Hannah.\n\nRating 10: After Randy leaves the morgue, Megan notices that the lift closes by itself and is going down.\n\nRating 3: Megan investigates the security footage and sees a glimpse of Hannah's body crawling inside the lift.\n\nRating 10: She rushes down to the access bay to warn Randy, but Hannah has already killed him.\n\nRating 7: Suddenly, Andrew calls Megan to warn her that Grainger has escaped police custody after killing the two officers transporting him.\n\nRating 3: Moments later, Grainger forces Megan to take him to Hannah's body at gunpoint.\n\nRating 10: Grainger explains to Megan that he is Hannah's father.\n\nRating 10: He tells her that numerous exorcisms failed because the demon possessing her was too strong.\n\nRating 10: So strong, in fact, that it is even able to possess Hannah's body after her death by killing people to heal itself.\n\nRating 10: He tells her that Hannah had depression and it worsened until the demon was able to enter Hannah's body.\n\nRating 3: The blue eye color is the sign of the demon possessing Hannah.\n\nRating 4: Grainger wonders why Hannah killed Dave and Lisa, but did not kill Megan.\n\nRating 3: Megan agrees to help Grainger cremate Hannah, but she reanimates and pushes Grainger into the fire.\n\nRating 8: Then she locks Megan inside her refrigerated drawer.\n\nRating 10: Andrew and Ernie come to Megan's help.\n\nRating 5: Hannah kills Ernie and then tries to kill Andrew, but Megan forces herself to be calm.\n\nRating 8: She picks up Andrew's firearm and shoots Hannah, then drags her to the crematorium while Andrew calls for backup.\n\nRating 3: After a brief struggle before the incinerator, Megan pushes Hannah into the fire, eventually killing the demon.\n\nRating 6: As the movie comes to a close, Megan recounts how she has managed to stay clean for over two months.\n\nRating 5: As she looks into the mirror at her reflection, her hair covering one eye, a single fly -similar to the ones shown in several scenes involving Hannah's corpse earlier in the film- lands on the mirror's surface.\n\nRating 3: Megan promptly smashes it with her hand as the movie ends, leading the audience to wonder whether the fly's appearance is simple coincidence, if Hannah's demon has somehow transferred her essence, in whole or in part, into Megan herself, or simply symbolic that Megan is strong enough to fight her depression, thus not letting any possessive demon to enter her body."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Horror Movies",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81046394,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81046394",
    "index": 9,
    "name": "Army of the Dead",
    "maturity": "A ",
    "duration": "2h 28m",
    "synopsis": "After a zombie outbreak in Las Vegas, a group of mercenaries takes the ultimate gamble by venturing into the quarantine zone for the greatest heist ever.",
    "year": "2021",
    "spoilers": "\n\nRating 10: A United States military convoy traveling from Area 51 collides with a car on the highway outside Las Vegas.\n\nRating 3: The convoy's cargo, a zombie, escapes, killing and infecting several soldiers before heading into the city.\n\nRating 3: There, the original and subsequent zombies infect most of the city's population.\n\nRating 8: After a military intervention fails, the government quarantines the city.\n\nRating 7: Six years later, casino owner Bly Tanaka and his associate Martin approach mercenary and former Las Vegas resident Scott Ward about a job to recover $200 million from his casino vault in Las Vegas before the military deploys a tactical nuclear strike on the city.\n\nRating 10: Ward agrees and recruits his former teammates Maria Cruz and Vanderohe, along with helicopter pilot Marianne Peters, German safecracker Ludwig Dieter, and Chicano sharpshooter Mikey Guzman, who brings along his associate Chambers.\n\nRating 10: Martin joins the team to give them access to the casino.\n\nRating 8: Ward's estranged daughter Kate, who works at a quarantine camp, directs them to Lilly, a smuggler familiar with the city, who also recruits Burt Cummings, an abusive camp security guard.\n\nRating 3: When Kate learns Lilly escorted her friend Geeta into Las Vegas, Kate insists on joining the team over Ward's objections.\n\nRating 8: After an encounter with a zombified tiger upon entering Las Vegas, Lilly wounds Cummings and explains that a group of intelligent zombies known as \"Alphas\" will allow safe passage in exchange for a sacrifice.\n\nRating 3: An Alpha female known as the Queen takes Cummings away to the Olympus casino, where the Alpha leader Zeus infects him.\n\nRating 8: Lilly leads the team to a building full of hibernating, normal zombies.\n\nRating 8: Ward creates a path through the zombies with glow sticks.\n\nRating 8: When Chambers accuses Martin of ulterior motives, he diverts her off the path, and she wakes the zombies.\n\nRating 8: After she is surrounded and bitten, Guzman shoots the gasoline canister on her back, killing her and the surrounding zombie horde.\n\nRating 10: Arriving at Bly's casino, Ward and Kate turn on the power, Peters prepares a helicopter on the roof, and Dieter works on the vault.\n\nRating 3: Martin and Lilly stay outside under the pretense of keeping watch but instead lure the Queen into the open.\n\nRating 10: Martin beheads her and takes her head.\n\nRating 7: Zeus discovers her body and returns her to the Olympus casino, revealing that the Queen was pregnant with a zombie fetus.\n\nRating 5: Enraged, Zeus directs the Alphas to the casino.\n\nRating 3: A news report reveals the government has brought forward the nuclear strike, giving the team approximately 90 minutes.\n\nRating 8: As Dieter opens the vault, Ward discovers Kate had left to look for Geeta.\n\nRating 5: As Ward and Cruz are about to search for her, the Alphas appear and kill Cruz.\n\nRating 10: Martin traps the team in the basement, explaining that Bly cares only about the zombie head, which can create a zombie army for the government and is worth more than the money in the vault.\n\nRating 10: When he steps outside, he discovers Lilly stole the Queen's head, and the tiger mauls him to death.\n\nRating 8: Vanderohe attempts to fight Zeus but is easily overpowered.\n\nRating 6: Dieter sacrifices himself to get Vanderohe into the vault safely.\n\nRating 10: Ward, Lilly, and Guzman make it to the lobby, where zombies attack them and swarm Guzman, who detonates his grenades, killing the zombies at the cost of his own life and destroying the money he carried.\n\nRating 3: Zeus confronts them on the roof.\n\nRating 3: Lilly distracts him with the Queen's head as Ward and Peters escape.\n\nRating 8: Zeus fatally impales Lilly, who destroys the Queen's head by dropping it off the roof.\n\nRating 8: Peters takes Ward to the Olympus casino to retrieve Kate.\n\nRating 3: Inside, Kate finds Geeta and kills the infected Cummings.\n\nRating 8: Zeus chases them onto Peters' helicopter, and Ward accidentally shoots Peters, causing the helicopter to fly haphazardly.\n\nRating 3: Zeus overpowers Ward and bites him.\n\nRating 10: As the nuke destroys Las Vegas, Zeus is distracted by the bomb flash, and Ward kills him.\n\nRating 8: The nuke's shock wave causes the helicopter to crash, killing Peters and Geeta.\n\nRating 7: Kate survives and finds Ward, who gives Kate money to start a new life before turning into a zombie.\n\nRating 8: Kate kills him and breaks down in tears as a rescue helicopter arrives.\n\nRating 3: Having survived the blast, Vanderohe exits the vault with the remaining money and later rents a plane to take him to Mexico City.\n\nRating 8: On the flight, he discovers that he has been bitten."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies"
    ],
    "id": 81248435,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81248435",
    "index": 10,
    "name": "A Classic Horror Story",
    "maturity": "A ",
    "duration": "1h 35m",
    "synopsis": "In this gruesome suspense film, strangers traveling in southern Italy become stranded in the woods, where they must fight desperately to get out alive.",
    "year": "2021",
    "spoilers": "\n\nRating 8: Elisa makes plans to carpool through a rideshare app to her parents' home in Calabria to get an abortion, though she is unsure about it.\n\nRating 3: She boards an RV  driven by travel blogger Fabrizio, accompanied by Riccardo, a doctor, and extroverted couple Sofia and Mark.\n\nRating 5: When a bout of Elisa's morning sickness causes the group to pull over, Mark takes over driving for Fabrizio.\n\nRating 8: That night, Mark drinks beer while driving and ends up crashing into a tree when he swerves to avoid running over the corpse of a goat.\n\nRating 7: Elisa wakes up in the morning to see the group doing first aid on Mark's broken leg.\n\nRating 10: They realize that they are no longer on the road, but are now in a clearing surrounded by a forest and cannot explain how they ended up there.\n\nRating 10: Despite finding a rustic cabin in the clearing, they do not enter.\n\nRating 8: Fabrizio and Riccardo find three deformed scarecrows crucified with pig heads on stakes in a kind of altar.\n\nRating 8: Terrified, they leave.\n\nRating 7: After Elisa enters the cottage, she discovers a ritualistic mural depicting three deities: Osso, Mastosso and Carcagnosso, which symbolize the leadership of a group that worships them in exchange for abundance and riches through human sacrifice.\n\nRating 8: They decide to spend the night in the RV.\n\nRating 3: When they hear screams coming from inside the house, everyone but Mark decides to go into the house to investigate.\n\nRating 8: In the attic of the house, they discover a girl trapped inside a cocoon of hay.\n\nRating 10: The group is horrified to discover the girl has had her tongue mutilated.\n\nRating 7: They witness Mark being dragged out of the RV by three masked figures, who bring him into the cabin and tie him to the living room table.\n\nRating 8: Hiding in the attic, the group is forced to watch as the three masked figures torture and kill Mark by gouging out his eyes and breaking his feet with a wooden hammer.\n\nRating 10: The trio drag Mark's body outside while the rest of the group waits for dawn to escape through the forest.\n\nRating 3: After finding a graveyard of abandoned cars, they realize they are not the first victims of the cult's fanatics.\n\nRating 3: The girl reveals her name, Chiara, through a diary.\n\nRating 5: Chiara is the only survivor of her family.\n\nRating 10: The group finds themselves walking in circles as they return to the clearing again.\n\nRating 8: Night falls and the group shares their personal stories as they drink the only beer bottle left.\n\nRating 4: Elisa wakes up and sees all the followers of the sect standing in front of the house with Sofia, Chiara and Riccardo as hostages on a ritualistic stage.\n\nRating 8: The masked figures representing Ostro, Mastosso and Carcagnosso begin the ritual.\n\nRating 8: Sofia has her eyes gouged out and Riccardo has his ears mangled.\n\nRating 8: Their severed parts are placed on the gigantic scarecrow in which Chiara is trapped.\n\nRating 8: Sofia and Riccardo have their throats cut as Elisa and Fabrizio watch from inside the cabin.\n\nRating 4: Elisa realizes that Fabrizio had put sleeping pills in their alcohol and confronts him, discovers that he has a hidden earpiece.\n\nRating 10: Angry, he instructs one of the cult members to take her and she is dragged outside.\n\nRating 8: She awakens in the morning at the head of a large table during one of the cult's meals, her hands nailed to the armrests of a wheelchair.\n\nRating 10: She is taken into a control room, where she discovers that all the events she faced were recorded by hidden cameras and a production team overseeing everything.\n\nRating 10: Fabrizio reveals that he is directing an amateur snuff movie, trying to create a classic horror story.\n\nRating 8: After freeing herself, Elisa wanders through the camp of the film's production team.\n\nRating 10: She discovers that Chiara is still alive, and is an actress and sister to the director Fabrizio.\n\nRating 3: Elisa catches the two discussing the next steps of the recording in a trailer.\n\nRating 3: The local mayor is revealed to be part of the 'Ndrangheta, the regional Italian Mafia group, and the person sponsoring his film.\n\nRating 8: When Chiara exits the vehicle, Elisa kills her with a shotgun.\n\nRating 9: She then shoots Fabrizio in the leg, and he asks for mercy, but Elisa kills him as well, recording everything with a portable camera.\n\nRating 10: She discovers an exit from the forest through a fence, which falsely labels the forest as a restricted military zone.\n\nRating 5: Covered in blood, she emerges from the forest on a beach, recorded by bathers on cell phones as she dives into the sea.\n\nRating 9: In a post-credits scene, a BloodFlix app user is participating in a virtual chat about Fabrizio's movie that aired with the final footage of Elisa killing him.\n\nRating 10: The user evaluates the movie negatively."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "Mysteries",
        "Movies Based on Books",
        "US Movies"
    ],
    "id": 80991313,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80991313",
    "index": 11,
    "name": "No One Gets Out Alive",
    "maturity": "U/A 16+ ",
    "duration": "1h 27m",
    "synopsis": "Desperate and without documentation, a woman from Mexico moves into a rundown Cleveland boardinghouse. Then the unsettling cries and eerie visions begin.",
    "year": "2021",
    "spoilers": "\n\nRating 3: Ambar, an undocumented immigrant, moves from Mexico to Cleveland after her mother passes away.\n\nRating 10: She supports herself with an under the table job and her savings.\n\nRating 10: In search of a place to stay, she finds a dilapidated boarding house run by Red, who requires the first month's rent up front.\n\nRating 3: After she moves in, strange things start happening to her there and elsewhere.\n\nRating 10: One night she sees a man banging his head against the door, whom she later learns is Red's mentally disturbed brother, Becker.\n\nRating 7: Some rooms in the house are filled with strange artifacts, including depictions of ritual sacrifice.\n\nRating 3: Ambar begins to see ghostly figures around the house.\n\nRating 10: In search of a better job, she gives a co-worker the remainder of her savings to obtain a fake ID that proclaims her a U.S. citizen, but the co-worker steals the money and disappears.\n\nRating 10: When Ambar insists her boss give her the co-worker's address, he fires her.\n\nRating 8: Frightened by supernatural visions, Ambar flees the boarding house.\n\nRating 10: Desperate for money and unable to receive help from her distant cousin, Beto, Ambar is forced to call Red.\n\nRating 10: They meet at a nearby diner and Red promises to refund her deposit, but only if she returns to the house as he claims to not have the cash on him.\n\nRating 10: When they arrive at the boarding house, the cash is not in her room as promised.\n\nRating 3: Instead, Becker shows up and forces Ambar to drink some wine.\n\nRating 3: As soon as he leaves, she locks her door.\n\nRating 3: A while later, the two Romanian women who have also moved into the boarding house, knock on her door.\n\nRating 10: They discuss their dreams about a stone box.\n\nRating 10: Petra starts singing which puts Ambar to sleep.\n\nRating 8: Ambar wakes up to Red and Becker restraining the women and preparing them to be taken down to the basement.\n\nRating 8: She attacks Red to try to stop him, but Becker throws her against the wall.\n\nRating 10: Beto comes looking for Ambar but is assaulted by Becker.\n\nRating 3: After Becker takes one of the women downstairs; Red tells Ambar that his dad was an archeologist  who brought back a stone box from his trip to Mexico in 1963.\n\nRating 3: Red's father, along with his mother, Mary, trapped and murdered women .\n\nRating 8: After they killed their father for sacrificing their mother, Red wanted to leave but Becker insisted on staying, as each woman sacrificed to the stone box improved Becker's health.\n\nRating 3: Becker returns and carries the screaming Ambar to the basement, where she sees the other woman has been decapitated.\n\nRating 10: He ties Ambar to a stone slab in front of an altar where the box sits, opens the box and leaves the room, shutting the door behind him.\n\nRating 5: Ambar continues screaming and Beto bursts into the room and unties her.\n\nRating 3: As they attempt to escape the basement, Ambar is caught up in a dream of her mother on her deathbed.\n\nRating 3: At the same time, a large moth-like creature slowly emerges from the box and takes Ambar's head between its hands.\n\nRating 10: In the dream, Ambar's mother is begging her to stay, and she begins to strangle Ambar.\n\nRating 8: However, Ambar fights back and suffocates her mother instead.\n\nRating 10: This causes the monster, the Aztec goddess Ītzpāpālōtl , associated with the moth seen throughout the film , to retreat back into the box.\n\nRating 3: Ambar comes out of the dream state to find herself standing by the alter alone.\n\nRating 5: Ambar hears Becker and Red preparing Petra for sacrifice.\n\nRating 10: Becker notices his wounds are not healing and says something is wrong.\n\nRating 8: Ambar grabs a macuahuitl from the study and goes upstairs, where she injures Red and is then attacked by Becker.\n\nRating 10: Petra tries to help but is thrown over the balcony and killed.\n\nRating 5: Becker chokes Ambar, but she slices his carotid artery with an obsidian blade from the macuahuitl, then smashes his head with it.\n\nRating 8: She hears Red, wounded but alive, shuffling around in the next room.\n\nRating 3: She brings him downstairs, ties him onto the stone table, and watches the monster bite off his head.\n\nRating 3: Walking through the house, she passes Red, who has become a ghost like the other sacrificed women.\n\nRating 8: As she starts to leave the house, her ankle, broken by Becker earlier, suddenly heals as a result of sacrificing Red to the monster.\n\nRating 8: She stops and puts out her hand to let a moth land on it then turns back towards the basement door, showing the same darkened throbbing veins that Becker had."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "Thriller Movies"
    ],
    "id": 81488262,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81488262",
    "index": 12,
    "name": "Choose or Die",
    "maturity": "A ",
    "duration": "1h 25m",
    "synopsis": "Tempted by a chance to win unclaimed prize money, two friends reboot a mysterious 1980s video game and step into a surreal world of next-level terror.",
    "year": "2022",
    "spoilers": "\n\nRating 8: Hal, a married man with a dysfunctional family who is a collector of retro video games, receives a copy of an interactive fiction computer game called CURS>R. Hal installs the game and starts to play, expecting it to be nothing more than a classic 1980s text-based adventure game.\n\nRating 10: However, when the objects around him begin to interact with the game, he realises it is something more, and his family is harmed as a result.\n\nRating 8: Three months later, college student Kayla is working as a cleaner to pay for her studies.\n\nRating 10: She provides new and old technology to her computer-geek friend, Isaac, who in return helps her learn to code so that she can gain sufficient skills for her classes.\n\nRating 8: Kayla's mother, Thea, has become a drug addict after the death of her son Ricky, and also suffers psychological and sexual abuse from her rent collector, Lance, who supplies her with drugs and forces her into prostitution in exchange for not being evicted from her apartment.\n\nRating 8: One day while visiting Isaac after work, Kayla discovers the CURS>R game in his apartment, along with a phone number offering a $125,000 prize.\n\nRating 7: She calls the number and receives a recorded message from the Terror Director telling her to complete the game and insert the number code at the end of it to win the money.\n\nRating 10: Attracted by the offer, Kayla accepts the challenge, thinking it will be easy money, and arranges a deal with Isaac to share the prize.\n\nRating 9: That night, Kayla starts playing the game in a café and discovers that it can interfere with reality in different ways—the game level ending with a waitress eating broken glass and dying.\n\nRating 10: The next day, Kayla tries to stop the game by destroying the tape.\n\nRating 10: She tells Isaac what happened, but he finds her story hard to believe.\n\nRating 7: Later, while Kayla is working a graveyard shift, her mother calls her desperate for help.\n\nRating 3: Kayla discovers that CURS>R has managed to escape to the net and is following her, forcing her to choose ways to save her mother from a giant rat.\n\nRating 10: Thea eventually falls from her bedroom window and, severely injured, ends up in hospital.\n\nRating 3: Later that night, Kayla goes to Isaac's apartment and together they try to discover the mystery behind the game.\n\nRating 10: They find a sort of code in the sound of CURS>R, in an unknown language, and theorise it is what allows the game to interact with the real world.\n\nRating 3: Together they manage to survive the night after the game exploits Kayla's trauma over the death of her brother, who drowned in a public pool.\n\nRating 10: Isaac and Kayla hack the prize number to a storage facility where the game was created.\n\nRating 8: In recording sessions of the making of CURS>R, they discover that the creator of the game, Beck, found a curse in different symbols and embedded the codes into the game to gain more benefits by using the suffering of gamers.\n\nRating 10: When they discover the code needed, the game traps Isaac and forces Kayla to choose in order to save him, but ends up killing him.\n\nRating 3: The game orders Kayla to \"beat the boss\" and gives her a set of coordinates to follow that lead her to Hal's house, now a cruel man who tortures his wife Laura and son Gabe.\n\nRating 10: Hal explains that he never ended the game and after two levels it promised to leave them alone if he made more copies of it.\n\nRating 3: The game then orders both Kayla and Hal to fight while reversing the pain that each experiences; i.e., if Hal is hurt, Kayla feels it and if Kayla is hurt, Hal feels it.\n\nRating 10: An intense fight ensues, during which Hal is drowned and Kayla barely manages to survive.\n\nRating 10: Kayla receives the game prize, which enables her to take total control of the curse.\n\nRating 10: She uses this ability to kill Lance, which heals both herself and her mother.\n\nRating 10: It is then revealed that the building in which Kayla worked is owned by Beck, who asks her who is next to suffer.\n\nRating 6: Kayla answers that it will be only the ones who deserve to."
},{
    "genre": "Comedies",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Comedies",
        "Horror Movies"
    ],
    "id": 81243747,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81243747",
    "index": 14,
    "name": "Bhool Bhulaiyaa 2",
    "maturity": "U/A 13+ ",
    "duration": "2h 21m",
    "synopsis": "When strangers Reet and Ruhan cross paths, their journey leads to an abandoned mansion and a dreaded spirit who has been trapped for 18 years.",
    "year": "2022",
    "spoilers": "\n\nRating 3: Across a mansion in Bhawanigarh, Rajasthan in 2004, the priests confine a malevolent spirit named Manjulika, who is hell-bent on attacking the family's daughter-in-law Anjulika to a room.\n\nRating 10: After this, the family deserts the mansion for safety.\n\nRating 8: 18 years later, in Himachal Pradesh, Ruhaan Randhawa meets Reet Thakur who is on a trip to Bhawanigarh via Chandigarh to marry her fiancée Sagar reluctantly.\n\nRating 10: They board a bus to Chandigarh but cut short their journey for attending a music carnival and later discover that the bus they were supposed to travel met with an accident, killing everyone on board.\n\nRating 10: Subsequently, the Thakurs, who are owners of the mansion that was deserted 18 years ago, assumed her to be dead.\n\nRating 6: Reet tries contacting her family but over the phone she overhears a conversation between Trisha and Sagar, realizing an affair brewing between them.\n\nRating 8: Seeking to earn them the gift of marriage so she could avoid falling into it, Reet plays along her family's presumption about her demise and travels to Bhawanigarh with a hesitating Ruhaan.\n\nRating 10: They decide to hide in the deserted ancestral mansion, but Chote Pandit, a priest, spots the doors of the mansion opened and informs the Thakurs, who along with the villagers enter the mansion and spot Ruhaan, who covers up the situation by lying that Reet's spirit led him there and her final wish is to see her family living in the ancestral mansion and that too with Trisha being married.\n\nRating 10: Under Ruhaan's influence, The Thakurs fix Trisha's wedding with Sagar.\n\nRating 10: Due to his presumed ability of communicating with spirits, Ruhaan becomes popular as Rooh Baba, where he and Reet become friends.\n\nRating 5: When Ruhaan is led to the room where the spirit was trapped, Anjulika, Reet's sister-in-law, warns him to stay away from the room and reveals that the spirit is actually Anjulika's twin sister Manjulika.\n\nRating 3: The sisters had migrated to the mansion when their father Debanshu was asked to manage accounts for the Thakurs.\n\nRating 10: Debanshu's biased affection towards Anjulika's talents instilled jealousy in Manjulika which turned into hatred.\n\nRating 10: In 2004, both the sisters fell in love with Uday Thakur, Reet's elder brother.\n\nRating 8: However, Uday reciprocated Anjulika's feelings leaving Manjulika fuming and deceived.\n\nRating 8: Manjulika, who sought solace in learning black magic, decided to use the magic as a weapon against Anjulika.\n\nRating 8: On the night of Uday and Anjulika's wedding, Manjulika brutally stabbed Debanshu for finding out the truth and set out to murder Anjulika, but she saved herself and stabbed Manjulika in self-defense killing her.\n\nRating 7: Despite being dead, Manjulika did not leave the family alone as her spirit continued to harm them and paralyzed Uday by pushing him off the balcony.\n\nRating 4: The priests captured Manjulika and lock her in the third floor.\n\nRating 3: After the flashback, Reet's father reveals to Ruhaan that Manjulika's curse had killed eight members of their family.\n\nRating 9: One night, Chote Pandit finds Ruhaan and Reet roaming around the mansion and discovers the truth.\n\nRating 6: With the help of his elder brother Bade Pandit and his wife whose business is being affected due to Ruhaan's popularity, Chote Pandit spearheads a search in the mansion.\n\nRating 10: Knowing that no one would enter Manjulika's room, Reet resolves to hide there and Chote Pandit's accusations are proved false to the family.\n\nRating 3: Freed, Manjulika attacks Anjulika, who discovers the truth about Reet being alive and joins hands with Ruhaan and Reet to ward off the spirit.\n\nRating 10: They take help from the same priest who captured Manjulika's spirit but he tells them that he requires three days.\n\nRating 7: Manjulika's spirit possesses the priest and makes him kill his disciples before being killed by himself.\n\nRating 10: Ruhaan encounters the spirit and falls off the terrace out of fear.\n\nRating 8: Ruhaan returns to the palace, conversing in Bengali, and claims himself to be Manjulika revealing that he is possessed.\n\nRating 10: The Thakurs spot Reet and learn that she is alive.\n\nRating 10: Ruhaan attacks Anjulika, who uses Reet as a human shield by threatening to slit her throat if Ruhaan attacks her and addresses him as \"Anjulika\", which confuses the family.\n\nRating 3: Ruhaan reveals that he has been putting up an act of being possessed by the spirit and that the woman who died in 2004 was actually Anjulika while one who is living with them is the real Manjulika.\n\nRating 4: In 2004, after killing Debanshu with the help of the priest, revealed to be Manjulika's accomplice, Manjulika influenced Anjulika using black magic and stole her identity.\n\nRating 8: Disguised as Manjulika under the influence of black magic, Anjulika attacked Manjulika who stabbed her to death under the pretext of self-defense.\n\nRating 10: When Uday discovered the truth, Manjulika pushed him off the balcony, paralyzing him and thus preventing him from telling anyone.\n\nRating 8: She also killed eight members of the family for learning the truth.\n\nRating 6: Presently, Anjulika's spirit attacks Manjulika and imprisons her in the same room in which she got locked in 2004.\n\nRating 10: Anjulika's spirit has a moment with her family and asks Reet's father to forgive her since it revealed the truth of Anjulika and Manjulika.\n\nRating 3: She thanks Ruhaan and asks the family to leave as she has unfinished business with Manjulika.\n\nRating 8: Anjulika enters the room and kills the real Manjulika.\n\nRating 10: The whole Thakur family leaves the palace, which becomes abandoned again."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 70305901,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70305901",
    "index": 15,
    "name": "Ouija",
    "maturity": "A ",
    "duration": "1h 29m",
    "synopsis": "When their friend mysteriously dies, a group of grieving teens seeks connection via an old ouija board that conjures up a nightmare from the other side.",
    "year": "2014",
    "spoilers": "\n\nRating 3: Debbie Galardi recalls playing Ouija with her best friend Laine Morris as children.\n\nRating 3: In present day, she throws her Ouija board into the fire and implies to Laine that something strange happened with the board.\n\nRating 3: After Laine leaves, the Ouija board reappears in Debbie's bedroom.\n\nRating 6: Debbie becomes possessed and hangs herself inside her home.\n\nRating 8: Laine attends Debbie's wake with her boyfriend Trevor, younger sister Sarah, friend Isabelle, and Debbie's boyfriend Pete.\n\nRating 10: The five friends meet at Debbie's house and use her Ouija board to try communicating with her.\n\nRating 8: Strange things happen, and a presence smashes Pete's hand and face into a mirror.\n\nRating 3: The friends start finding the phrase \"Hi friend\"  written in different places, like Isabelle's car and Pete's desk.\n\nRating 7: Thinking Deb is trying to communicate with them, they have another Ouija session and discover that they are actually in contact with a spirit calling itself \"DZ\".\n\nRating 8: Laine sees the image of a little girl with her mouth sewn shut.\n\nRating 10: The girl warns them to run because her mother is coming.\n\nRating 5: Laine later learns that Deb found the Ouija board in her attic and played alone.\n\nRating 8: Isabelle is possessed and killed.\n\nRating 8: Laine and Pete search Deb's attic and find a box of old photographs that belonged to the previous residents.\n\nRating 3: While researching the previous family's history, they learn of a little girl named Doris Zander who went missing.\n\nRating 7: Doris' sister Paulina, now an old woman committed to a psychiatric hospital, explains that her mother was a medium and used Doris as a vessel for the dead to speak through.\n\nRating 10: Their mother went mad and sewed Doris' mouth shut, killing her.\n\nRating 6: She tells Laine that there is a secret room in the house where Laine must find Doris' hidden body and unstitch her mouth in order for the girl to banish their mother.\n\nRating 8: The friends go back to the Galardi house, where Laine finds Doris' corpse and cuts the stitches on her mouth.\n\nRating 7: Doris' mother's spirit protests, but Doris chases away the ghost.\n\nRating 10: Pete becomes possessed and is killed.\n\nRating 3: Laine revisits Paulina, realizing that she was in allegiance with Doris all along and had intentionally lied.\n\nRating 8: Doris is the evil entity and her mother was trying to stop the friends from summoning her.\n\nRating 10: Laine's grandmother, Nona, advises the sisters to destroy Doris' body and the Ouija board.\n\nRating 6: Doris' ghost drowns Trevor and captures Sarah to sew her mouth shut.\n\nRating 10: Laine plays the Ouija board alone to draw the spirit's attention.\n\nRating 7: Doris starts possessing Laine, but Debbie's ghost helps Laine defeat Doris.\n\nRating 8: Sarah and Laine throw Doris' body and the Ouija board into the furnace, stopping the paranormal activity.\n\nRating 3: Later, Laine finds that the planchette has mysteriously appeared back at her home."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "Movies Based on Books",
        "US Movies"
    ],
    "id": 81021447,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81021447",
    "index": 16,
    "name": "The Silence",
    "maturity": "U/A 16+ ",
    "duration": "1h 30m",
    "synopsis": "With the world under attack by deadly creatures who hunt by sound, a teen and her family seek refuge outside the city and encounter a mysterious cult.",
    "year": "2019",
    "spoilers": "\n\nRating 8: A cave research team unearths an unknown species of pterosaur-like creature, referred to as \"vesps\", from a mine.\n\nRating 10: The vesps violently kill the researchers, fly out of the mine, and seek the noisiest areas.\n\nRating 8: Ally Andrews, a teenage girl who lost her hearing in a car accident, lives with her  parents Hugh and Kelly Andrews, her maternal grandmother Lynn, who has terminal lung cancer, her brother Jude, and a pet dog.\n\nRating 7: As news of the vesp outbreak spreads, the U.S. government declares a state of emergency and asks people to stay indoors and quiet.\n\nRating 7: Hugh recommended the family to put their cellphones on silent mode, and, they see four videos, one showing two victims running, the second one showing a mother and her child in a car.\n\nRating 8: The child has her mouth taped, \n\nand the mother shows a note written, \"Don't make noise\".\n\nRating 10: The third one shows the cave research team screaming, and it cuts to another shot of the  vesps fleeing, shortly before getting interrupted by an emergency broadcast.\n\nRating 10: Ally suggests they head to the countryside, which is likely to be quieter.\n\nRating 10: Glenn, Hugh's best friend, joins them and brings his guns.\n\nRating 8: They set out in two cars, but a man tries to hijack Hugh's car, risking the family.\n\nRating 5: Glenn shoots the man in the leg, and they drive away.\n\nRating 10: The group hits a massive traffic jam, blocking all the interstates, and Glenn goes off-road.\n\nRating 9: Speeding through the countryside, Glenn's car hits a herd of fleeing deer and tumbles down the embankment.\n\nRating 8: He survives but is trapped in the car.\n\nRating 10: Hugh and Kelly fail to free him, and Glenn asks Hugh to leave.\n\nRating 10: As the Andrews family returns to their car, their dog barks, attracting the vesps.\n\nRating 10: Glenn fires his gun, leading them away from the Andrews and sacrificing himself.\n\nRating 8: To keep his family safe, Hugh is forced to let their dog out of the car to die.\n\nRating 10: Hugh leads his family on foot after setting Glenn's car on fire as a decoy.\n\nRating 10: Lynn struggles to keep up, and her coughing puts the family at risk.\n\nRating 3: The family finds a house with a high fence and locked gate.\n\nRating 8: The homeowner, unaware of the situation, comes out and speaks and the vesps rip her apart.\n\nRating 8: The family uses a storm drain to enter the house.\n\nRating 3: A rattlesnake appears in front of Jude, attracting the vesps with its rattle they proceed to attack it.\n\nRating 3: The attracted vesps bite Kelly's leg from behind.\n\nRating 8: Hugh distracts them by turning on a woodchipper, crushing the vesps flying into it, and the family enters the house.\n\nRating 3: Ally contacts her boyfriend, Rob, who tells her his parents are dead.\n\nRating 3: She learns that religious cults have sprung up in the wake of the disaster.\n\nRating 10: By morning, Kelly's wound is infected, so Hugh and Ally leave to find antibiotics.\n\nRating 8: At the store, Ally discovers vesp eggs growing inside corpses.\n\nRating 10: The tongueless reverend of a cult tries to recruit them, but Hugh and Ally leave.\n\nRating 8: They return with the antibiotics and Kelly recovers.\n\nRating 8: Ally learns from the internet that vesps cannot survive in the cold, prompting the family in planning to head to the north.\n\nRating 8: The reverend finds the family's hide-out and shows up with his followers, revealing that he intends to recruit Ally.\n\nRating 8: Hugh brings out his gun, forcing the cultists to leave.\n\nRating 8: Rob lets Ally know he is headed north to \"the refuge\".\n\nRating 3: Hugh and Kelly find a little girl at the door in the middle of the night.\n\nRating 7: After letting her in, they find she is a member of the tongueless cult.\n\nRating 8: Phones strapped to her and placed around the house go off, attracting vesps.\n\nRating 7: The cult members abduct Ally but Grandma Lynn runs outside to help her.\n\nRating 3: Lynn holds Ally's captors down and screams; vesps kill her and the captors while Ally escapes.\n\nRating 9: The family fights back and kills most of the cult, including the reverend.\n\nRating 10: Weeks later, the family treks across the U.S. and arrives at the refuge.\n\nRating 8: Ally finds Rob and they hunt the vesps with arrows.\n\nRating 8: Ally wonders whether the vesps will adapt to the cold and whether humans will adapt to a soundless lifestyle, like she did when she lost her hearing."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 80185924,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80185924",
    "index": 17,
    "name": "Insidious: The Last Key",
    "maturity": "U/A 16+ ",
    "duration": "1h 43m",
    "synopsis": "Haunted by old memories, psychic Elise Rainier returns to her childhood home in New Mexico to face her demons -- and opens the door to dark secrets.",
    "year": "2018",
    "spoilers": "\n\nRating 8: In 1953, Elise Rainier lives in Five Keys, New Mexico with her parents Audrey and Gerald and younger brother Christian.\n\nRating 3: Elise and Christian encounter a ghost in their bedroom.\n\nRating 10: Frightened, Christian looks for a whistle their mother gave him to call for help, but cannot find it.\n\nRating 4: Gerald, furious, canes Elise and locks her in the basement.\n\nRating 3: Elise opens a mysterious red doorway and is briefly possessed by a demonic spirit.\n\nRating 8: Audrey is killed by the demon.\n\nRating 8: Decades later in California in 2010, Elise works as a paranormal investigator with her colleagues Specs and Tucker.\n\nRating 8: A man named Ted Garza calls, saying he's been experiencing paranormal activity at his house.\n\nRating 8: Realizing it's her childhood home, Elise departs to help him.\n\nRating 8: While investigating, she finds Christian's lost whistle, but it disappears again after she encounters a female spirit.\n\nRating 3: Elise tells Specs and Tucker that she had seen the spirit before when she was a young girl.\n\nRating 8: She had fled the house in fear of another beating from her father, abandoning Christian.\n\nElise, Tucker, and Specs meet Melissa and Imogen, Christian's daughters.\n\nRating 9: Christian is still furious at Elise for abandoning him.\n\nRating 3: Hoping to repair their relationship, Elise hands Melissa a photo of the whistle, telling her to show it to Christian.\n\nRating 3: Elise and Tucker discover a hidden room in the basement.\n\nRating 8: Guided by the female spirit, they discover a young woman being held prisoner inside.\n\nRating 10: Ted reveals that he is responsible.\n\nRating 7: He locks the group in and tries to kill Specs.\n\nRating 8: Specs kills Ted in self defense.\n\nRating 3: After police clear the house, Christian and his daughters go inside to find the whistle.\n\nRating 8: Melissa is attacked by the demon from Elise's past, known as \"Key Face.\"\n\nRating 10: Key Face sends her into a coma, with her consciousness now stuck in the spirit realm of \"The Further.\n\nRating 3: \"\n\nTrying to save Melissa, Elise searches the house and discovers hidden suitcases containing belongings of numerous other women who had been held prisoner, including the young woman she had seen as a girl.\n\nRating 3: Elise realizes that like Ted, her father Gerald had also kidnapped women and held them in the secret room.\n\nRating 8: The woman she saw as a girl, Anna, was actually alive then, not a ghost; she was later killed by Gerald.\n\nRating 8: In the present, Elise is ambushed by Key Face and her spirit taken into the Further.\n\nRating 3: Imogen, who possesses abilities like Elise's, enters The Further and is led by Anna's ghost into a prison realm where Key Face is holding all of the souls he has taken, including Melissa and Elise.\n\nRating 8: Elise realizes Key Face had been controlling both Gerald and Ted, and feeds on the fear and hatred generated by the women they kidnapped.\n\nRating 8: Key Face tries to coerce Elise into hurting her father's spirit as revenge for what he's done.\n\nRating 8: Elise starts beating Gerald, but is stopped by Imogen and refuses to feed Key Face any more hatred.\n\nRating 8: Key Face attacks Elise, but Gerald saves her before he is stabbed by Key Face, his spirit vanishing.\n\nRating 10: Key Face stabs Melissa, causing her physical body to start dying.\n\nRating 10: He attempts to possess Elise.\n\nRating 8: Elise blows Christian's whistle, and Audrey's spirit arrives, vanquishing Key Face.\n\nRating 10: They open a door and see a young boy, Dalton Lambert.\n\nRating 8: Realizing they opened the wrong door, they leave the door open and find Melissa.\n\nRating 10: Melissa's spirit returns to her body in the real world, saving her life.\n\nRating 10: Elise makes amends with her mother's spirit and she and Imogen return to the real world and reunite with Christian, who forgives Elise.\n\nRating 7: In her sleep, Elise has a dream about Dalton and a red-faced demon.\n\nRating 3: She awakens and receives a call from Lorraine.\n\nRating 3: Elise had helped her son years earlier, and now her grandson Dalton needs the same help, which Elise agrees to provide."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 81186806,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81186806",
    "index": 18,
    "name": "A Quiet Place Part II",
    "maturity": "U/A 16+ ",
    "duration": "1h 38m",
    "synopsis": "Forced to leave their home, the Abbotts must venture out into a world of deadly creatures drawn to sound — and other threats they never expected.",
    "year": "2021",
    "spoilers": "\n\nRating 3: During a Little League Baseball game, the Abbott family – wife Evelyn, husband Lee, deaf daughter Regan, and sons Marcus and Beau – and other spectators witness a strange meteor-like object hurtle towards the Earth.\n\nRating 8: Hostile extraterrestrial creatures emerge from the meteor, attack and begin slaughtering people.\n\nRating 10: The blind creatures possess armored skin, have extraordinary speed and strength, and track victims with hypersensitive hearing, attacking anything that makes noise.\n\nRating 7: Over a year later, the creatures have killed much of the Earth's population, including Lee and Beau.\n\nRating 10: Regan has discovered that high-frequency audio feedback makes them vulnerable, and she devises a makeshift method of transmitting the noise from her cochlear implant through a portable microphone.\n\nRating 10: With their home destroyed, the family searches for other survivors.\n\nRating 3: Entering a fenced-off area, Evelyn accidentally sets off a sound alarm, alerting the creatures.\n\nRating 6: As they flee, Marcus steps into a bear trap, attracting a creature with his screams.\n\nRating 10: Regan and Evelyn kill the creature, free Marcus, then run into an abandoned steel foundry.\n\nRating 8: An old friend, Emmett, appears and takes them to his soundproof underground hideout.\n\nRating 10: Emmett, who has recently lost his family and developed a cynical outlook on life, refuses to help further and says they cannot stay.\n\nRating 8: Marcus hears the song \"Beyond the Sea\" playing on the radio, and Emmett says the song has aired continuously for four months.\n\nRating 3: Regan determines it is a hint that survivors are on a nearby island a day's travel to the south east following railroad tracks.\n\nRating 10: She theorizes that if she can reach the island's radio tower the hearing aids high-frequency noise can be broadcast so other survivors can weaponize the signal.\n\nRating 3: She secretly ventures out alone to find the island; Evelyn begs Emmett to find her.\n\nRating 10: He does and saves her from a creature.\n\nRating 10: Regan persuades Emmett to help complete her mission.\n\nRating 8: Evelyn leaves Marcus and her newborn baby at the foundry to fetch medical supplies in town.\n\nRating 9: Marcus discovers the corpse of Emmett's wife.\n\nRating 8: Startled, he alerts a creature and accidentally locks himself and the baby inside an air-tight compartment.\n\nRating 3: Emmett and Regan arrive at a marina to board a boat to the island.\n\nRating 3: They are attacked by bandits, and Emmett deliberately creates noise and attracts creatures that slaughter the attackers.\n\nRating 10: When one creature drowns, he realizes that the creatures cannot swim.\n\nRating 3: The two row to the island where a small colony of survivors are living normally.\n\nRating 9: The colony leader reveals that when the U.S government discovered the creatures were unable to swim, the U.S. National Guard attempted to move as many people as possible to the islands.\n\nRating 3: However, the chaos from boarding created noise that attracted the creatures, leaving only two boats that made it to the island.\n\nRating 3: When Evelyn returns to the foundry, she frees the children before they suffocate.\n\nRating 3: The three hide inside the bunker as the creature prowls the foundry.\n\nRating 7: At the island the next day, a creature trapped on a boat from the marina misadventure has drifted to the island and attacks the colonists.\n\nRating 10: After the colony leader drives Emmett and Regan to the radio station, both to quickly transport them and to lure the creature away from the colonists, it kills him.\n\nRating 10: Regan transmits the high frequency via the station's signal and plays it over the station's speakers, incapacitating the creature, and impales its exposed head with a rod, killing it.\n\nRating 10: At the foundry, the creature discovers the family.\n\nRating 3: Marcus picks up Regan's transmission and plays the high-pitched frequency through his portable radio before shooting the creature.\n\nRating 10: Regan leaves the hearing aid connected to the radio station's microphone, allowing the broadcast signal to be weaponized by others."
},{
    "genre": "Horror",
    "related-genre": [
        "Independent Movies",
        "Horror Movies",
        "US Movies"
    ],
    "id": 80149258,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80149258",
    "index": 19,
    "name": "Get Out",
    "maturity": "A ",
    "duration": "1h 44m",
    "synopsis": "Chris is anxious about meeting his girlfriend Rose's parents, and his jitters prove justified as the get-together turns from uncomfortable to terrifying.",
    "year": "2017",
    "spoilers": "\n\nRating 8: Chris Washington is a black photographer from Brooklyn, New York, preparing for a weekend visit to Upstate New York, to meet the family of his\n\nwhite girlfriend, Rose Armitage.\n\nRating 10: Hesitant, he asks Rose if her family knows about their interracial relationship, but she assures him that they are not racist.\n\nRating 6: While there, Rose's brother Jeremy and their parents, neurosurgeon Dean and hypnotherapist Missy, make disconcerting comments about black people, and Chris witnesses strange behavior from the estate's black housekeeper Georgina and groundskeeper Walter.\n\nRating 8: One night, Missy pressures Chris into a hypnotherapy session to cure his smoking addiction.\n\nRating 10: While in a trance, he confesses that his mother was killed in a hit-and-run when he was a child and that he feels responsible for her death as he waited too long to call for help.\n\nRating 10: He then enters a void Missy calls the \"Sunken Place\".\n\nRating 5: The next morning, he assumes that the encounter was a dream until Walter acknowledges their brief session the night before.\n\nRating 10: However, he is pleased to discover that the hypnosis was a success, as he no longer feels a desire to smoke.\n\nRating 10: Dozens of wealthy white people arrive for the Armitages' annual get-together, and express admiration for Chris' physique and for black figures such as Tiger Woods.\n\nRating 9: Jim Hudson, an art dealer who has gone blind in his old age, takes a particular interest in Chris' photography skills.\n\nRating 5: Chris meets another black man, Logan King, who behaves strangely and is married to a much older white woman.\n\nRating 8: Chris relays the information to his friend, TSA officer Rod Williams.\n\nRating 10: Chris tries to photograph Logan inconspicuously, but when his flash goes off, Logan becomes hysterical, shouting at Chris to \"get out\".\n\nRating 10: The others restrain him, and Dean later claims that Logan had an epileptic seizure.\n\nRating 10: Away from the party, Chris tells Rose that they should leave.\n\nRating 3: Meanwhile, the party guests hold a silent auction, disguised as a game of bingo, with Chris as the \"prize\", with Jim making the winning bid.\n\nRating 3: Rod recognizes \"Logan\" as Andre Hayworth, a missing man from Brooklyn.\n\nRating 10: Suspecting a conspiracy, Rod tries to tell the police, but his claims are dismissed.\n\nRating 3: While Chris packs to leave, he finds photos of Rose in prior relationships with several black partners, including Walter and Georgina, contradicting her earlier claim that Chris is the first black person she has dated.\n\nRating 3: He tries to leave the house, but Rose and her family lock him in.\n\nRating 8: Chris attacks Jeremy, but Missy uses a \"trigger\" that she implanted during his hypnosis, knocking him out.\n\nRating 3: Chris awakens strapped to a chair in the basement.\n\nRating 5: In a video presentation, Rose's grandfather Roman explains that the family transplants people's brains into others' bodies, granting them preferred physical characteristics and a twisted form of immortality.\n\nRating 8: The host's consciousness remains in the Sunken Place, alive but powerless.\n\nRating 8: The video then connects to a feed of Jim, speaking with Chris through an intercom.\n\nRating 10: Jim says that although the Armitages target mainly black people, he doesn't care about Chris' race: he only wants his eyesight.\n\nRating 3: Missy performs hypnosis, seemingly knocking Chris out.\n\nRating 10: When Jeremy comes to fetch Chris for the surgery, it is revealed that Chris blocked the hypnosis trigger by plugging his ears with cotton stuffing pulled from the chair.\n\nRating 8: Chris bludgeons Jeremy unconscious with a bocce ball and heads to the operating room where Dean is about to perform the surgery replacing Jim's body with Chris'.\n\nRating 7: Chris impales Dean with the antlers of a deer mount, knocking over a candle which sets fire to the operating room with an anesthetized Jim inside.\n\nRating 3: Missy attacks Chris in the kitchen but he stabs and kills her, and is then attacked again by Jeremy as he heads towards the door; he overpowers and kills Jeremy before leaving in the latter's car.\n\nRating 8: On the way out, he hits Georgina—who is revealed to be possessed by Rose's grandmother, Marianne—and knocks her unconscious.\n\nRating 3: Compelled by guilt from his mother's death, he decides to carry her into the car, but she awakens and attacks him.\n\nRating 10: In the ensuing struggle, the car crashes and Georgina is killed.\n\nRating 3: An armed Rose apprehends Chris with Walter, who is possessed by Roman.\n\nRating 7: Chris uses the flash on his phone to neutralize Roman, allowing Walter to regain control of his body.\n\nRating 3: Walter takes Rose's rifle and shoots her in the stomach before shooting himself.\n\nRating 7: Chris begins to strangle Rose, but he finds himself unable to kill her.\n\nRating 5: Police sirens approach, and Rose cries out for help.\n\nRating 7: However, the driver is revealed to be Rod, who drives away with Chris as Rose is left bleeding out on the road."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 80221741,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80221741",
    "index": 20,
    "name": "Slender Man",
    "maturity": "U/A 13+ ",
    "duration": "1h 33m",
    "synopsis": "Desperate to find their missing friend, a group of girls summons the entity they believe took her -- the evil legend of Internet lore, Slender Man.",
    "year": "2018",
    "spoilers": "\n\nRating 10: In a small town in Massachusetts, four friends—Wren, Hallie Knudsen, Chloe, and Katie Jensen—summon the Slender Man.\n\nRating 8: A week later, Katie disappears, and the other three girls go to her house to look for clues.\n\nRating 3: The three discover that Katie had been involved in the occult and that she had been in contact, online, with a girl who told her how to contact Slender Man.\n\nRating 3: Katie, being unhappy living alone with her alcoholic father, wanted the Slender Man to take her.\n\nRating 6: After talking to the same girl Katie had, the three girls decide to make contact with the Slender Man in an attempt to get Katie back in exchange for something that they love.\n\nRating 10: Wren brings some handmade pottery, Chloe a picture of her and her dad before he died and Hallie brings her little sister Lizzie’s blanket, made by their grandmother.\n\nRating 7: Wren, who has researched Slender Man mythology, warns Hallie and Chloe not to open their eyes while the three are making contact with the Slender Man for fear of death or madness.\n\nRating 10: Chloe panics, opens her eyes, and comes face to face with the Slender Man.\n\nRating 6: Sometime later, the Slender Man enters Chloe's house and drives her insane.\n\nRating 10: Wren, suffering from frightening visions, searches for a solution while Hallie unsuccessfully attempts to move on.\n\nRating 10: Soon, Lizzie, Hallie's younger sister, suffers a major panic attack and is sent to the hospital and sedated.\n\nRating 3: Hallie discovers Wren had attempted to come into contact with the Slender Man again, with the help of Lizzie.\n\nRating 3: Hallie confronts Wren about her sister.\n\nRating 7: Wren tells Hallie that the sacrifices they gave Slender Man were not enough; Slender Man only wants the girls and won’t stop until he takes them.\n\nRating 8: Suddenly, the window breaks and Wren is wrapped in tree branches, taken by Slender Man.\n\nRating 10: Hallie, realizing that the only way to save Lizzie is to give herself to the Slender Man, sacrifices herself for her sister.\n\nRating 10: Lizzie is able to recover and reflects on the situation that resulted in the death of her sister and her sister's friends."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies"
    ],
    "id": 81644920,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81644920",
    "index": 21,
    "name": "Kumari",
    "maturity": "U/A 16+ ",
    "duration": "2h 17m",
    "synopsis": "After marrying into a wealthy family, Kumari moves into her husband's ancestral home where darkness lurks amid superstition, faith and folklore.",
    "year": "2022",
    "spoilers": "\n\nRating 8: The movie starts with a grandmother narrating to her grandchild a story about a goddess that had visited the earth and became fascinated by the beauty of planet, hence she did not return to her abode, and married a mortal man and had two children named Chathan and Gari Devan, who neither looked like gods nor humans and possessed enormous powers.\n\nRating 8: They fought amongst themselves destroying the planet forcing the goddess to restrain Chathan to the mountains and Gari Devan under the land, before returning to her abode.\n\nRating 10: Human beings then start worshipping them, knowing that they are very powerful and can be used for the betterment of mankind.\n\nRating 8: The movie then shifts to a village, where the conservative landlord Thuppan undervalues people from low-caste and was known to be very cruel.\n\nRating 8: Chokkan was a young orphan, who unbeknownst to everyone often met Chathan and gave him food in exchange for gems.\n\nRating 10: Thuppan's generous wife Nangakutty was fond of Chokkan and often conversed with him.\n\nRating 8: One day, while Chokkan was conversing with Nangakutty, he forgets the mangoes that he fetched and Nangakutty, unbeknownst to anyone, eats the mangoes which was considered a sin by the landlord as he considers them outcasts.\n\nRating 3: Later, while Nangakutty was serving food to Thuppan, he notices the smell of mangoes coming from Nangakutty and realizes she ate mangoes from the forest.\n\nRating 3: The agitated Thuppan who was feeling impure, went to have a bath in the family pond to purify himself.\n\nRating 8: Finding Chokkan having a bath at the pond, a furious Thuppan admonished him and eventually killed him using a rock.\n\nRating 10: Angered, Chathan cursed the village causing a rain of rocks and deadly disease, with which Thuppan got infected.\n\nRating 8: To get rid of the curse and protect his clan and people, Thuppan decided to invite Gari Devan.\n\nRating 8: After twelve generations, Kumari, an orphan raised by her uncles and her brother Jayan, marries Dhruvan, a mentally ill person and Thuppan's descendant despite receiving opposition from Jayan, for her uncles.\n\nRating 8: Kumari is attracted towards the forest by Chokkan but she is desisted by her co-sister Lakshmi, Dhruvan's brother Achyuthan's wife, who discloses that their family is not supposed to enter the forest, having earned the wrath of Chathan.\n\nRating 7: She also reveals that Thuppan had sought the protection of Gari Devan against the curse imposed on the family by Chathan.\n\nRating 5: Later, Kumari confronts Dhruvan when she witnessed his uncle Velyachan and brother Achyuthan mistreat him and he reveals that he was ignored in favor of his brother, causing him to be his own companion and people started to believe that he was mentally unwell.\n\nRating 10: He also revealed that he killed his teacher for beating him mercilessly with a cane for watching a dance performance by skipping his lessons.\n\nRating 10: Kumari realizes that what Dhruvan needs is love and affection and begins to care for him.\n\nRating 7: Achyuthan meanwhile engages in an extra-marital affair with a woman named Parijatham, who provokes him to seek authority over the village.\n\nRating 10: Kumari, chasing Chokkan who fascinated her, enters the forest and meets a woman called Muthamma who tells Kumari that the latter is carrying a child, who would be in danger because of Dhruvan and asks her to come meet her across the river and that she would take her to Chathan, who would protect the child.\n\nRating 3: Kumari, horrified returns home and later, her pregnancy is confirmed.\n\nRating 10: Kumari gets stressed over the fact that no one in the family except for Dhruvan seem happy about her pregnancy.\n\nRating 3: Dhruvan begins to hold desires for power over the village as its lord and Kumari catches him cutting his two fingers to resemble Gari Devan.\n\nRating 4: Achyuthan mocks him over it and a fight erupts between them but Velyachan intervenes and declares that Dhruvan would be the next landlord as he is the first one of the next generation delivering an heir.\n\nRating 7: Lakshmi later divulges to Kumari that she intentionally didn't bear children for a reason.\n\nRating 8: Twelve generations ago, after Thuppan invites Gary Devan, the former had sacrificed his own son to Gari Devan for appeasing him despite Nangakutty's protests which caused her to commit suicide.\n\nRating 10: The sacrifice of Thuppan's son and Gari Devan's protection for the family only lasts for twelve generations and it was Dhruvan's turn as the lord of the twelfth generation to sacrifice his child which is why the women were not happy over Kumari's pregnancy.\n\nRating 3: Terrified, Kumari expresses to Lakshmi that Dhruvan would never do such a thing but Lakshmi tells her that the family's men would go to any extent to uphold their power and traditions.\n\nRating 6: Lakshmi also reveals to Kumari that Thuppan has been alive for the last twelve generations rotting in the attic for his sins.\n\nRating 10: Velyachan, having witnessed Lakshmi telling everything to Kumari, kills her the next morning.\n\nRating 9: Devastated, Kumari crosses the river and visits Muthamma's community that pray to Chathan and Muthamma takes her to Chathan, who promises to protect Kumari's child.\n\nRating 3: She is given a small thing to be buried in her house and a few incantations to be read.\n\nRating 9: Velyachan begins to train Dhruvan for engaging in the next sacrifice while Parijatham instigates Achyuthan to visit Chathan and seek power but he gets killed by Chathan.\n\nRating 8: Later, Velyachan also dies of a snake bite and Dhruvan takes his position as the next lord.\n\nRating 3: Chathan's curse begins to haunt the village for the second time, repeating the history.\n\nRating 3: After a fire erupts in their house, Dhruvan gets convinced that someone is conspiring against him and has taken Chathan's side and goes into the forest along with his henchmen.\n\nRating 8: He kills Chathan's worshippers but is forced by his henchmen to return when Chathan's arrival is signalled by the nature.\n\nRating 8: Before dying, Muthamma reveals that Kumari is the one conspiring against him to protect her child.\n\nRating 8: Dhruvan confronts Kumari and justifies that it would be his responsibility to kill his child for the village and confines her to a room.\n\nRating 8: Kumari's brother Jayan visits her to take her away and assaults Dhruvan in the fields for mistreating Kumari but Dhruvan murders him leaving Kumari distraught.\n\nRating 3: With no other option, Kumari meets Thuppan, who blames himself for all the miseries that he has caused and asks her to pray to the goddess, previously worshipped by Nangakutty, whom he had ignored for approaching Gari Devan.\n\nRating 3: She finds the idol of the goddess along with a dagger that she had seen previously before in her nightmares.\n\nRating 6: Kumari eventually gives birth to a healthy boy and tries to escape with the baby but Dhruvan ambushes her and takes the child for sacrifice.\n\nRating 3: He calls Gari Devan to accept the sacrifice but Kumari comes back and fights Dhruvan and Gari Devan with the dagger from the goddess idol.\n\nRating 10: Chathan also arrives and fights against Gari Devan to uphold his promise to Kumari and finishing the fight the he had started long ago.\n\nRating 8: Chathan kills Gary Devan while Kumari reluctantly kills Dhruvan and saves her baby.\n\nRating 8: A few years later, Kumari is now looking over the village as the landlady and it is revealed that it is her son who had been listening to the story in the starting from Dhruvan's mother Savitri.\n\nRating 7: Kumari's son finds Chokkan standing in the forest and tries to go to him."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 80199767,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80199767",
    "index": 22,
    "name": "Cult of Chucky",
    "maturity": "A ",
    "duration": "1h 30m",
    "synopsis": "Following a string of murders in the psychiatric facility where she's confined, Nica Pierce begins to question the existence of Chucky.",
    "year": "2017",
    "spoilers": "\n\nRating 3: In 2017, Andy Barclay has been torturing the disembodied head of Chucky for four years.\n\nRating 8: Meanwhile, wheelchair-using Nica Pierce has been in a mental institution after being framed by Chucky for the murders of her family.\n\nRating 6: Nica now believes she was responsible for the murders and that Chucky was a manifestation of her psychosis.\n\nRating 8: Dr. Foley, Nica's doctor, has her transferred to a medium-security psychiatric hospital.\n\nRating 6: In group therapy, Nica meets Malcolm, a man with Dissociative identity disorder; Angela, a woman who believes she is dead; Claire, a woman who burned her house down; and Madeleine, a patient who smothered her infant son.\n\nRating 10: Foley introduces a therapy technique involving a Good Guy doll.\n\nRating 7: Most of the patients are unsettled except for Madeleine, who treats it as her baby.\n\nRating 7: Nica is visited by Tiffany Valentine, the legal guardian of her niece Alice, and is devastated to learn that Alice has died.\n\nRating 3: Tiffany leaves Nica a Good Guy doll, which she claims was a gift from Alice.\n\nRating 3: That night, Chucky awakens and discovers Nica has slit her wrists.\n\nRating 10: The next morning, Nica finds that her wrists have been stitched up and that Angela has been killed.\n\nRating 10: After realizing \"Valentine\" was the last name of Chucky's girlfriend, Nica realizes Chucky is real.\n\nRating 10: Fearing Madeleine is in danger, Nica has Malcolm warn her.\n\nRating 3: Madeleine throws both the doll and Malcolm into an empty grave, but they are rescued by orderlies.\n\nRating 8: Malcolm begins to refer to himself as \"Charles\" and act in a manner similar to Chucky, making Nica suspect he has been possessed.\n\nRating 5: Chucky then kills Claire by decapitating her.\n\nRating 3: Andy learns about the murders and realizes Chucky has somehow managed to transfer his soul into multiple bodies at once.\n\nRating 8: In a private session with Foley, Nica agrees to be hypnotized in order to access any repressed memories about the murders.\n\nRating 10: Foley, who has been sexually abusing Nica, is hit from behind by Chucky.\n\nRating 6: Foley believes Nica is the one who assaulted him but is willing to keep quiet in order to blackmail her for more sexual favors.\n\nRating 9: Madeleine smothers her Good Guy doll with a pillow, forcing her to confront the repercussions of her real child's death.\n\nRating 10: Orderlies bury the doll in order to placate Madeleine.\n\nRating 10: Andy commits himself into the institution by assaulting a security guard.\n\nRating 8: Carlos, a nurse, delivers a package to Foley—another Good Guy doll with short, shaved hair.\n\nRating 6: Madeleine is visited by her own doll and allows it to kill her.\n\nRating 10: Foley attempts to assault Nica again but is knocked out by one of the Chucky dolls.\n\nRating 8: Two dolls are now alive due to Madeline's doll splitting its soul inside of Foley's doll.\n\nRating 3: One of the dolls awakens the short-haired doll.\n\nRating 3: The Chuckys reveal that the original Chucky found a voodoo spell on the internet which allowed him to separate his soul into multiple host bodies, creating a \"cult.\"\n\nRating 10: Alice was one host, but she was killed.\n\nRating 8: The dolls then kill Carlos.\n\nRating 8: Tiffany returns and kills a security guard outside.\n\nRating 10: Foley's Chucky doll splits his soul into Nica, giving her body the ability to walk again.\n\nRating 10: She stomps on Foley's head, using high-heeled shoes that Foley had given Nica earlier, killing him.\n\nRating 10: She stumbles upon Malcolm, who has killed fellow Nurse Ashley, before confessing that he knows he's not really Chucky; he merely created \"Charles\" as an alternative personality.\n\nRating 10: He is suddenly ambushed and killed by Madeleine's Chucky.\n\nRating 3: The short-haired Chucky attacks Andy, but Andy restrains him and reaches into the doll's chest, pulling out a hidden gun and revealing that he sent him to the institution.\n\nRating 10: He shoots the doll and stomps its head, killing him.\n\nRating 3: Nica appears and taunts him.\n\nRating 10: Andy tries to shoot at her, only to discover that he has no ammunition left.\n\nRating 3: Nica locks Andy inside his cell.\n\nRating 8: Madeleine's Chucky feigns lifelessness and Nica, possessed by Foley's Chucky, escapes.\n\nRating 10: She reunites with Tiffany outside before driving off together with a Tiffany doll, also alive and sharing a portion of Tiffany's soul.\n\nRating 6: In a post-credits scene, Andy's former foster sister, Kyle, enters Andy's house, having been sent to continue torturing the original Chucky's severed head."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 80013775,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80013775",
    "index": 23,
    "name": "Annabelle",
    "maturity": "U/A 16+ ",
    "duration": "1h 38m",
    "synopsis": "When a husband finds the perfect gift for his wife -- a beautiful and rare doll -- the joy the creepy object brings to her is short-lived.",
    "year": "2014",
    "spoilers": "\n\nRating 8: In Santa Monica, California, John Form, a doctor, presents his expectant wife Mia with a rare vintage porcelain doll as a gift for their first child to be placed in a collection of dolls in their daughter's nursery.\n\nRating 10: That night, the couple is disturbed by the sounds of their next door neighbors, the Higgins, being murdered during a home invasion.\n\nRating 8: While Mia calls the police, she and John are attacked by the Higgins' killers.\n\nRating 8: The police arrive and shoot one killer, a man, dead while the female killer kills herself by slitting her throat inside the nursery while holding the doll.\n\nRating 6: News reports identify the assailants as the Higgins' estranged daughter, Annabelle, and her unidentified boyfriend, both members of a cult.\n\nRating 3: In the days following the attack, a series of paranormal activities occur around the Forms' residence.\n\nRating 10: Afterwards, Mia gives birth to a healthy baby girl.\n\nRating 8: She and John name their child Leah.\n\nRating 10: The family rents an apartment in Pasadena and, after finding the doll that John had discarded since Annabelle's previous attack in one of their boxes, another set of paranormal events plague Mia and her daughter.\n\nRating 3: Mia calls back Detective Clarkin to gather information about Annabelle and the cultists and learns that the cult intends to summon a demonic spirit.\n\nRating 6: With the help of bookseller and fellow tenant Evelyn, Mia realizes that the cult practiced devil worship, which summoned a demon who followed the family after they moved to their apartment so as to claim a soul.\n\nRating 3: Upon returning home, Mia and Leah are attacked by the demon who reveals itself while manipulating the doll.\n\nRating 6: Mia and John contact their parish priest, Father Perez, who informs them that demons sometimes attach themselves to inanimate objects as an advantage to accomplish their goals and that a human soul must be offered for a purpose.\n\nRating 10: Without any hopes of exorcising the demon out of the doll, Father Perez decides to take it away to seek help from the Warrens for investigation.\n\nRating 7: But before he can enter the church, the demon impersonating Annabelle's spirit attacks him and grabs the doll.\n\nRating 7: Father Perez is hospitalized the next day and, when John checks on him, the priest warns him  that after sensing its powerful presence, the demon's true intention is to claim Mia's soul.\n\nRating 3: That night, while Evelyn is visiting Mia, the demon uses Father Perez's physical form to sneak into the apartment and abduct Leah for her mother's soul.\n\nRating 3: To spare her daughter, Mia attempts to jump out of the window with the doll but John arrives in time along with Evelyn to stop her.\n\nRating 9: Evelyn decides to take her life in Mia's place instead as atonement for causing a car accident that resulted in the death of her daughter Ruby years ago.\n\nRating 10: As Evelyn lies dead on the road, the demon and the doll disappear.\n\nRating 10: Mia and John never saw or heard of the doll again and Leah is safely inside her crib.\n\nRating 10: Six months later, the doll is bought from an antique shop by a mother as a gift for her daughter Debbie, a nursing student, and is seen stored and locked away into a glass case in the Warren's artifact room."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies"
    ],
    "id": 81085815,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81085815",
    "index": 24,
    "name": "Don’t Listen",
    "maturity": "A ",
    "duration": "1h 37m",
    "synopsis": "After a tragic turn of events at the new home he's fixing up, Daniel hears a ghostly plea for help, spurring him to seek out a famous paranormal expert.",
    "year": "2020",
    "spoilers": "\n\nRating 10: Upon moving in a new home with their 9-year-old son Eric, Daniel and Sara are upended by psychophonies, first experienced by Eric and thus attributed by a psychologist to the kid's lack of stability and his own imagination.\n\nRating 10: Seasoned parapsychologist Germán and his daughter Ruth  turn in to provide help to Daniel."
},{
    "genre": "Action",
    "related-genre": [
        "Comedies",
        "Horror Movies",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81186049,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81186049",
    "index": 25,
    "name": "Day Shift",
    "maturity": "A ",
    "duration": "1h 53m",
    "synopsis": "An LA vampire hunter has a week to come up with the cash to pay for his kid's tuition and braces. Trying to make a living these days just might kill him.",
    "year": "2022",
    "spoilers": "\n\nRating 3: Bud Jablonski is a blue-collar dad who provides for his family apparently working as a pool cleaner.\n\nRating 3: His real job is hunting and killing vampires.\n\nRating 10: While at work Bud sees a man leaving the house where he's working.\n\nRating 3: He silently breaks into the house where he encounters two vampires, an elderly woman and a younger man, who lives there.\n\nRating 3: Following a lengthy fight, he kills the vampires and pulls out their fangs with pliers.\n\nRating 10: Bud tries to sell the fangs at a pawn shop, but the prices that Troy, the owner, offers are not enough to help him with his money troubles.\n\nRating 3: Bud's ex-wife Jocelyn is planning to move to Florida with their daughter, who attends a private school with high fees.\n\nRating 10: In order to pay the tuition, cover his debts, and buy his daughter braces, Bud is forced to return to the vampire hunting union.\n\nRating 7: Bud enlists his old army friend, \"Big\" John Elliot, to help him rejoin the union.\n\nRating 8: The union boss, Ralph Seeger, initially refuses, due to Bud's history of multiple code violations.\n\nRating 10: He eventually is given a final chance but must work under strict conditions: He must only work the day shift, which does not pay well, and must be supervised by a union rep named Seth.\n\nRating 3: Seth is tasked to look for, and report, any violations committed by Bud.\n\nRating 3: Meanwhile, a vampire named Audrey finds the vampires that Bud killed.\n\nRating 6: While searching for the man who killed the older of the two vampires, Audrey finds, tortures, and interrogates Troy.\n\nRating 7: Before she kills him, she reveals that humans used to worship vampires as gods and plans to restore the old order by building homes and using them to establish vampire colonies so she can build an army.\n\nRating 10: Bud and Seth go hunting, and although Bud violates several union protocols, Seth does not report them after learning of Bud's aim to support his family with his earnings.\n\nRating 8: After they find and destroy an unusual nest of vampires, Audrey contacts Bud and threatens his family, revealing that the elderly vampire was her daughter.\n\nRating 10: Bud rushes to his ex-wife to save her while being pursued by vampires but fails to get there in time.\n\nRating 7: His family is taken hostage by Audrey, and Seth is turned into a vampire.\n\nRating 6: Now set on rescuing his family, Bud and Seth recruit Bud's neighbor, an outcast vampire named Heather, to help them assault Audrey's stronghold.\n\nRating 8: At the stronghold, they are joined by Big John.\n\nRating 10: During the fight, John gets bitten and chooses to sacrifice himself so that Bud can save his family.\n\nRating 10: Bud is no match for Audrey's superior speed and physical strength, but through a clever trick, he gains the upper hand, kills her, and saves his family.\n\nRating 8: When Seeger arrives with backup from the union and tries to use Bud's numerous violations to kick him out, Seth uses his extensive knowledge of loopholes in the union's rules to prevent him from doing so.\n\nRating 3: As the Jablonski family drives away, Big John climbs out of a manhole in the street showing that he survived the explosion."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "Thriller Movies",
        "US Movies"
    ],
    "id": 81623510,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81623510",
    "index": 26,
    "name": "The Invitation",
    "maturity": "U/A 16+ ",
    "duration": "1h 45m",
    "synopsis": "Evie's long-lost cousin invites her to a swanky English wedding, where she uncovers a dark and twisted family secret that threatens to upend her life.",
    "year": "2022",
    "spoilers": "\n\nRating 10: In New York City, struggling artist Evelyn \"Evie\" Jackson makes a living freelancing for a catering business with her best friend Grace.\n\nRating 6: Evie takes a DNA test, discovering she has a distant cousin in England named Oliver Alexander.\n\nRating 10: She meets Oliver, who tells her the scandal of her great-grandmother, Emmaline, who had a secret child with a black footman.\n\nRating 10: He invites her to an upcoming family wedding in England.\n\nRating 10: Evie arrives in Whitby at the New Carfax Abbey, where she meets the lord of the manor, Walter De Ville, and Mrs. Swift, a longtime maid of the estate.\n\nRating 10: She also meets the rest of the Alexander family and the maids of honor, friendly Lucy and condescending Viktoria.\n\nRating 3: Evie gradually begins to notice unsettling occurrences during her stay.\n\nRating 3: She sees an apparition of Emmaline, who was shown in a flashback, hanging herself from the staircase.\n\nRating 10: Maids start disappearing as they are attacked by a shadowy figure.\n\nRating 3: Evie finds herself romanced by De Ville before discovering he had been researching her before her arrival.\n\nRating 10: She confronts him and threatens to leave, but the two reconcile and have sex.\n\nRating 3: The family hosts a rehearsal dinner, where Evie expects to finally meet the bride and groom.\n\nRating 7: Instead, De Ville announces that he and Evie are to be wed.\n\nRating 3: The butler Renfield, slits a maid's throat and pours her blood into a bowl.\n\nRating 3: De Ville, Lucy, and Viktoria are all revealed to be vampires who then drink the maid's blood.\n\nRating 10: Evie's ancestors, the Alexanders, are one of the three families who, for centuries, have each offered one of their women to become De Ville's wife in exchange for protection and wealth.\n\nRating 10: Emmaline was originally intended to be De Ville's third bride, but she killed herself due to her guilt of killing humans, and due to the loss of her love, Evie's great-grandfather, and infant son.\n\nRating 3: The Alexander family had trouble finding a female member until they found Evie.\n\nRating 3: Viktoria locks a frantic Evie inside a coffin, but she is freed by Mrs. Swift, who is killed by Mr. Field.\n\nRating 7: Evie makes it into town and asks an elderly couple, who reveal themselves to be Jonathan and Mina Harker, for help but is knocked unconscious, as they work for De Ville.\n\nRating 10: Evie wakes up to find herself with one of the maids, Imogen, and De Ville.\n\nRating 8: De Ville reveals himself to be Dracula as he mentions he was once known as the \"Son of the Dragon\".\n\nRating 10: Evie then watches De Ville bite into Imogen's leg and falls unconscious.\n\nRating 10: Upon waking up, Evie is now in a wedding dress, walking down the aisle to wed De Ville.\n\nRating 10: As they finish exchanging vows, she bites De Ville's arm, consuming his blood, and instantly transforms into a vampire.\n\nRating 3: She sets the wedding chapel on fire, stabs De Ville in the heart, which rapidly ages him, and flees with Diya, another maid.\n\nRating 3: An enraged Viktoria ambushes Evie, who is helped by Diya.\n\nRating 3: After Diya flees, Viktoria attacks Evie again before Lucy intervenes.\n\nRating 8: The two vampires fight before Lucy impales both Viktoria and herself on a spear, turning them both into ashes.\n\nRating 8: Shortly thereafter, Evie is attacked by Renfield wielding a spear, who states that he wished he had killed her great-grandfather and grandfather, before she kills him by breaking off the spearhead and stabbing him in the chest.\n\nRating 3: She is then chased by a wall-crawling De Ville, who grabs her by the throat.\n\nRating 8: She breaks free by severing his wrist with a cutting wire and kicks him into the flames.\n\nRating 10: As he burns alive, she loses her powers due to his death and reverts into the human form.\n\nRating 8: Evie escapes as the manor is engulfed in flames.\n\nRating 3: Two weeks later, in London, Evie and Grace have tracked down Oliver, who prepares to flee after having paid off the police.\n\nRating 8: The two women intend to kill him for tricking Evie and being complicit in the murders committed by the vampires."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 60000393,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/60000393",
    "index": 27,
    "name": "Final Destination",
    "maturity": "A ",
    "duration": "1h 37m",
    "synopsis": "After narrowly avoiding a fatal plane explosion, a group of seemingly lucky teen classmates finds that Death is not so easily cheated.",
    "year": "2000",
    "spoilers": "\n\nRating 7: High school student Alex Browning boards Volée Airlines Flight 180, a Boeing 747, with his classmates for their senior trip to Paris from John F. Kennedy Airport.\n\nRating 7: Just after take-off, the plane explodes, killing everyone on board.\n\nRating 7: Alex suddenly wakes up on the plane during the boarding process, realizing he just had a premonition.\n\nRating 10: When the events from his vision begin to actually occur, he panics, causing a fight between him and his rival Carter Horton.\n\nRating 8: Both of them are removed from the plane, along with Alex's best friend Tod Waggner, Carter's girlfriend Terry Chaney, teacher Valerie Lewton and Billy Hitchcock.\n\nRating 3: Clear Rivers, believing Alex's claims, exits the plane voluntarily.\n\nRating 3: All of the other passengers dismiss Alex's premonition until they witness the plane exploding shortly after take-off.\n\nRating 10: Afterwards, the survivors are interrogated by two FBI agents, Weine and Schreck, who are both suspicious of Alex.\n\nThirty-nine days later, after attending a memorial service for the victims, an unusual chain reaction causes Tod to accidentally hang himself in his shower that night.\n\nRating 3: While his death is ruled a suicide, Alex and Clear sneak into the funeral home to examine Tod's corpse.\n\nRating 8: The mortician, William Bludworth, reveals that everyone who got off the plane disrupted Death's plan and Death is now systematically reclaiming their lives.\n\nRating 9: The next day, while Alex and Clear discuss what they learned, the rest of the survivors reunite outside the cafe.\n\nRating 10: Terry is then killed when she accidentally steps into the path of a speeding bus.\n\nRating 10: After seeing a news report on the cause of the plane's explosion, Alex concludes that Death is killing the survivors according to the sequence they would have died on the plane.\n\nRating 10: Alex goes to save Ms. Lewton, however she is killed when a kitchen knife impales her and her house explodes.\n\nRating 10: The remaining survivors gather in Carter's car and Alex explains the situation as they drive through town.\n\nRating 10: Carter deduces he is next on Death's list and stops the car on a rural train crossing, resigned to die on his own terms.\n\nRating 5: The others escape the car as a train speeds towards it.\n\nRating 10: At the last minute, Carter changes his mind, but his seatbelt jams.\n\nRating 10: Alex manages to pull Carter out of the car just it's smashed by the train.\n\nRating 8: Moments later, a shrapnel from the car's wreckage flies into the air and decapitates Billy.\n\nRating 3: Alex realizes that by saving Carter, Death moved on to the next person on its list, Billy.\n\nRating 8: Alex then reveals that he is next one in line to die, followed by Clear.\n\nRating 3: Days later, while hiding out in a fortified cabin, Alex recalls changing seats in his premonition, meaning that Clear is actually next on Death's list.\n\nRating 3: He rushes to her house while being pursued by Weine and Schreck.\n\nRating 8: Alex arrives to find Clear trapped inside her car by a rogue power line and ignited gasoline.\n\nRating 3: Alex grabs the cable, allowing Clear to escape the car just before it explodes.\n\nRating 10: Six months later; Alex, Clear, and Carter fly to Paris to celebrate their survival.\n\nRating 10: While discussing everything that happened, Alex realizes that Death never came for him after he saved Clear.\n\nRating 10: He then starts seeing ominous omens and narrowly dodges a passing bus, causing it to crash into a structure holding a large parking sign.\n\nRating 3: The sign swings down towards Alex, who is tackled out of the way by Carter.\n\nRating 8: Carter gets to his feet and asks Alex who is next on Death's list.\n\nRating 10: The sign swings back down towards Carter as the screen cuts to black."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "Thriller Movies"
    ],
    "id": 81640341,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81640341",
    "index": 28,
    "name": "Poochandi",
    "maturity": "U/A 13+ ",
    "duration": "1h 56m",
    "synopsis": "A journalist hunting for paranormal stories in Malaysia gets pulled into one himself when he interviews a man about a chilling encounter with a spirit.",
    "year": "2022",
    "spoilers": "\n\nRating 8: An image of a scarecrow is what we get in the initial frames after which we are introduced to Murugan , a Tamil journalist from Madurai, who writes paranormal stories for a magazine in Malaysia.\n\nRating 10: On his journey, he meets Shankar , who narrates a paranormal incident that happened to him and his friends Anbu  and Guru .\n\nRating 3: Anbu has paralysis and he collects coins as a hobby.\n\nRating 9: One day, they use one of the oldest coins in his collection to play Ouija and call out to a spirit for fun.\n\nRating 8: Little do they realise that they are inviting a soul that's dangerous and mysterious in many ways.\n\nRating 10: As the film progresses, the soul begins to entice them into accomplishing its own desires.\n\nRating 5: Once they start unraveling the spirit's past, they stumble upon a historic connection that dates back to many centuries.\n\nRating 3: These friends come across a chilling twist at the interval point, and post that, the film turns into an investigative thriller that tries to decode the origin of the lost soul."
},{
    "genre": "Action",
    "related-genre": [
        "Horror Movies",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 60036256,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/60036256",
    "index": 29,
    "name": "Anacondas: The Hunt for the Blood Orchid",
    "maturity": "U/A 16+ ",
    "duration": "1h 36m",
    "synopsis": "A team of scientists sets out to find a rare orchid, unaware the flower is protected by deadly anacondas made even stronger by the mysterious plant.",
    "year": "2004",
    "spoilers": "\n\nRating 3: A team of researchers funded by New York pharmaceutical firm Wexel Hall, including Dr. Jack Byron, Gordon Mitchell, Sam Rogers, Gail Stern, Cole Burris, and Dr. Ben Douglas, leave for a jungle in Borneo to search for a flower called Perrinnia immortalis--\"the Blood Orchid\"—that they believe contains a fountain of youth.\n\nRating 8: Jack convinces guide Captain Bill Johnson and his partner Tran Wu to take an unsafe path despite their misgivings.\n\nRating 10: At one point, Gail falls into the water, loses her phone, and is attacked by a crocodile before Bill rescues her.\n\nRating 8: Their boat goes over a waterfall and breaks apart.\n\nRating 10: A giant anaconda emerges from the water and swallows Ben whole.\n\nRating 8: The rest of the team reach shore.\n\nRating 7: Bill assures them that it was the largest snake he has ever seen and that it should take weeks for it to grow hungry again.\n\nRating 10: However, most of the team demand that the expedition be called off.\n\nRating 10: They call for Bill's friend, John Livingston, who lives on the river, to join them, only to find Livingston attacked and his boat wrecked.\n\nRating 8: They find a small native village and a disembowelled anaconda, a pair of human legs hanging out of the snake's abdomen, and an orchid remain.\n\nRating 3: Evidently, the orchids are a part of the food chain, and these snakes grow over unusually long lives.\n\nRating 10: Jack realizes the orchids must be nearby, while Gail contends that the orchids may not work on humans.\n\nRating 8: Jack still wants to find the flowers, but the others rebel and start building an escape raft to leave the jungle.\n\nRating 8: Gordon discovers that Jack has hid Livingston's radio and gun.\n\nRating 10: The now-sociopathic Jack fails to convince him to continue with the expedition, so he paralyzes Gordon using a previously collected spider to stop him from informing the others.\n\nRating 5: Jack joins the others at the raft, but a suspicious Sam discovers Gordon and the spider bite.\n\nRating 3: An anaconda swallows Gordon alive as she informs the others, who arrive as it finishes.\n\nRating 3: Bill sets the building on fire, but notices the snake has escaped.\n\nRating 3: Jack, left alone, steals the raft.\n\nRating 7: Unable to make another raft, they hack through the jungle to beat Jack to the orchids and retrieve their raft.\n\nRating 10: On the way, they fall into a cave trying to escape from an anaconda.\n\nRating 3: Cole gets lost and finds human skeletons.\n\nRating 7: He is found by Tran, who then gets pulled under and eaten.\n\nRating 10: Bill, looking for the two, finds Tran's lost flashlight floating in bloody water.\n\nRating 8: A terrified Cole escapes from the cave, seconds ahead of the snake, which gets stuck in the hole.\n\nRating 8: Sam beheads it with a machete, but another snake captures the hysterical Cole.\n\nRating 8: The team follows to find him being constricted.\n\nRating 3: Bill throws his knife and impales the snake through the head, freeing Cole.\n\nRating 10: The group finds Jack and his raft.\n\nRating 10: Jack shoots Bill in the arm to keep him from attacking and forces the party to accompany him to the orchids, which grow above a pit in which a ball of male anacondas are mating with the female.\n\nRating 10: Sam is forced to cross the pit via a thin log to fill a backpack with orchids.\n\nRating 10: As she returns, the log cracks.\n\nRating 7: Jack orders her to throw him the backpack.\n\nRating 10: Sam threatens to drop the flowers into the pit, but Jack threatens to shoot the others in response.\n\nRating 10: The log breaks.\n\nRating 8: As the others try to reach Sam, Jack reaches for the backpack.\n\nRating 8: The spider he used earlier escapes from its jar and bites him.\n\nRating 8: He falls into the pit and is devoured.\n\nRating 6: The vine holding Sam also gives way, but she climbs out of the pit as one of the anacondas tries to get her.\n\nRating 6: Gail tricks the snake into biting their fuel container.\n\nRating 8: Bill shoots it, but the gun is empty.\n\nRating 3: Cole shoots a flare, setting the anaconda on fire and exploding the container, killing the other snakes.\n\nRating 3: An ensuing landslide buries the blood orchids.\n\nRating 10: The survivors—Bill, Sam, Cole and Gail—make it back to the raft and head to Kota Bharu."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies"
    ],
    "id": 80109295,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80109295",
    "index": 30,
    "name": "Veronica",
    "maturity": "U/A 16+ ",
    "duration": "1h 45m",
    "synopsis": "In 1991 Madrid, after holding a séance at school, a teen girl minding her younger siblings at home suspects an evil force has entered their apartment.",
    "year": "2017",
    "spoilers": "\n\nRating 3: The film opens in 1991 in medias res, with emergency services responding to a call from a young girl.\n\nRating 10: She sounds panicked and screams about something coming to get her brother before the call cuts off.\n\nRating 8: The film goes back in time three days.\n\nRating 10: Verónica is a 15-year-old girl living with her mother and three young siblings in an apartment in the working-class district of Vallecas, Madrid.\n\nRating 3: Their father recently died and their mother works long hours at a bar to support the family, leaving Verónica in charge of her younger siblings: twins Lucia and Irene, and Antoñito.\n\nRating 10: On the day of the solar eclipse, her teacher explains how some ancient cultures used eclipses to stage human sacrifices and summon dark spirits.\n\nRating 10: Verónica and her friends Rosa and Diana go into the basement to conduct a séance using a Ouija board.\n\nRating 3: Verónica wants to reach out to her late father, and Diana her late boyfriend, who died in a motorcycle accident.\n\nRating 10: Rosa and Diana pull their hands back when the glass cup becomes too hot.\n\nRating 8: Verónica's hand remains on it, and at the moment of the eclipse, the cup shatters, cutting her finger and dripping blood onto the board.\n\nRating 10: Verónica becomes unresponsive, whispering something repeatedly, then lets out a demonic scream.\n\nRating 10: She wakes in the school nurse's office, who tells her she probably passed out from iron deficiency.\n\nRating 10: Verónica begins experiencing paranormal occurrences and her friends avoid her.\n\nRating 10: Looking for answers, she goes back to the school basement and finds the school's elderly blind nun whom the students call \"Sister Death.\"\n\nRating 10: The nun explains that the séance attached a dark spirit to her and tries to compel the spirit to leave, but nothing happens.\n\nRating 3: Verónica draws protective Viking symbols for the kids, only for the demon to destroy them.\n\nRating 8: She tries to help Lucia when the spirit chokes her, but Lucia says it was Verónica who was choking her.\n\nRating 9: Verónica wakes up to find that she's on her first period.\n\nRating 8: As she scrubs her mattress, she finds burn marks on the underside.\n\nRating 4: She also finds on each of the kids' mattresses a large burn mark in the shape of a human body.\n\nRating 10: Sister Death tells Verónica that she used to see dark spirits when she was younger, and intentionally blinded herself in an unsuccessful attempt to stop the visions.\n\nRating 8: Verónica can force the spirits to leave by doing right what she did wrong as it is important to say goodbye to the spirit at the end of a séance.\n\nRating 7: Verónica asks Rosa and Diana to hold another séance, but they refuse.\n\nRating 3: Rosa reveals that at the séance, Verónica whispered that she herself would die in five days.\n\nRating 8: Desperate, Verónica decides to hold the séance with her siblings.\n\nRating 10: She has Antoñito draw the protective symbols on the walls, but he flips to the wrong page and instead draws symbols of invocation.\n\nRating 8: When she tells the spirit to say goodbye, it refuses.\n\nRating 3: She calls the police and escapes with her siblings.\n\nRating 8: However, she sees that she is not actually holding Antoñito but had imagined it.\n\nRating 10: Her brother is actually hiding in a closet.\n\nRating 3: She finds him but he won't go with her.\n\nRating 3: Verónica looks at herself in the mirror and sees the demon, realizing she has been possessed by the demon the entire time, and had been harming her siblings under its control.\n\nRating 8: She attempts to end the possession by slitting her own throat but is prevented by the demon.\n\nRating 10: The police enter to find her being attacked by an invisible force and passing out.\n\nRating 10: The medics carry her and Antoñito out while a shaken detective observes the scene.\n\nRating 8: As the detective watches a photograph of Verónica suddenly catch fire, he is informed that she has died.\n\nRating 3: Five years later in 1996, he reports of unexplained paranormal activity having occurred in Madrid.\n\nRating 3: It is explained that the movie is based on the true events of the first police report in Spain where a police officer certifies having witnessed paranormal activity."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 80091246,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80091246",
    "index": 31,
    "name": "The Conjuring 2",
    "maturity": "U/A 16+ ",
    "duration": "2h 13m",
    "synopsis": "After her daughter unwittingly releases a malevolent spirit in their house in London, a woman enlists the Warrens' help to confront the evil presence.",
    "year": "2016",
    "spoilers": "\n\nRating 3: In 1976, paranormal investigators Ed and Lorraine Warren investigate the Amityville murders at the Amityville house, to determine if a demonic presence was truly responsible for Ronald DeFeo Jr. killing his entire family on November 13, 1974, and the subsequent haunting incident involving the Lutz family.\n\nRating 7: During a seance, Lorraine is drawn into a vision where she relives the murders and encounters a demonic nun figure.\n\nRating 10: She then witnesses Ed being impaled, badly frightening her.\n\nRating 3: In 1977, the Hodgson family begins to experience strange occurrences in their home in the London borough of Enfield after Janet, the second-oldest of four children, plays with a ouija board.\n\nRating 3: Janet starts to sleepwalk and converses in her dreams with an entity in the form of an angry elderly man who sits in the family's armchair, insisting the house is his.\n\nRating 3: Eventually, the Hodgson siblings and their mother Peggy witness paranormal events, terrifying them into seeking refuge with their neighbors.\n\nRating 10: When the media attempts to interview the family, Janet is possessed by the elderly man, Bill Wilkins, who previously lived and died in the house.\n\nRating 3: As Janet shows more signs of demonic possession, the story eventually reaches the Warrens, and their assistance is requested to prove whether or not Janet's possession is a hoax.\n\nRating 8: Lorraine, fearful that her vision of Ed's death may become reality, warns him not to get involved.\n\nRating 8: She has another vision of the demonic nun in Ed's study.\n\nRating 9: The demon says its name, which Lorraine scratches into her Bible in a trance.\n\nRating 8: While staying at the Hodgson residence, Ed and Lorraine consult other paranormal investigators, including Maurice Grosse and Anita Gregory, on the legitimacy of the case.\n\nRating 10: Gregory presents video evidence of Janet wrecking the kitchen on purpose, thereby discrediting the haunting.\n\nRating 10: Based on this, Ed and Lorraine decide to leave, believing the family is lying for fame.\n\nRating 7: However, they discover that the spirit of Wilkins is only a pawn being manipulated by the true demon, the powerful nun, who is seeking to break Janet's will.\n\nRating 10: Lorraine realizes that her abilities had been blocked by the nun, preventing her from grasping the truth of Janet's possession.\n\nRating 7: Ed and Lorraine quickly return to the Hodgson residence and find Janet possessed and the rest of the Hodgsons locked outside the house.\n\nRating 8: Ed ventures inside alone and finds Janet at the window, ready to commit suicide.\n\nRating 10: He manages to grab Janet in time, but is close to falling.\n\nRating 8: Lightning strikes the tree in the yard, turning it into the stump that impales Ed in Lorraine's vision.\n\nRating 8: Lorraine finds her Bible in which she wrote the demon's name – Valak.\n\nRating 7: She addresses the demon by its name, successfully condemning it back to Hell.\n\nRating 10: Janet is freed of its possession, and Lorraine pulls her and Ed to safety.\n\nRating 8: After returning home, Ed adds an item to his and Lorraine's collection – a haunted \"Crooked Man\" zoetrope toy owned by Peggy's youngest child – placing it beside April Perron's music box and the Annabelle doll."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "Movies Based on Books"
    ],
    "id": 80217312,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80217312",
    "index": 32,
    "name": "The Ritual",
    "maturity": "A ",
    "duration": "1h 34m",
    "synopsis": "Four friends with a long-standing -- but strained -- connection take a hiking trip into the Swedish wilderness, from which they may never return.",
    "year": "2018",
    "spoilers": "\n\nRating 8: Five friends—Phil, Dom, Hutch, Luke, and Rob—meet at a pub and discuss plans for a group holiday.\n\nRating 8: Rob suggests hiking in Sweden, but gets rebuffed.\n\nRating 9: Afterward, Luke and Rob leave to purchase alcohol, but interrupt a robbery in progress.\n\nRating 8: Luke hides while the thieves harass Rob for his valuables.\n\nRating 6: Luke nearly intervenes, but stops himself before the thieves kill Rob for disobeying them.\n\nRating 10: Six months later, the remaining four embark on a hiking trip along the Kungsleden in northern Sweden in Rob's memory.\n\nRating 8: A day later, Dom injures his knee.\n\nRating 5: Hutch suggests they cut through the forest rather than use the longer marked trail.\n\nRating 8: Upon entering the forest, the group come across a gutted elk hanging from several branches, as well as mysterious symbols carved in the trees.\n\nRating 8: As night falls, a torrential rainstorm forces them to find shelter.\n\nRating 8: They discover an abandoned cabin, which they break into for the night.\n\nRating 7: Inside, they find necklaces bearing similar symbols and an effigy of a decapitated human torso made of twigs, with antlers for hands.\n\nRating 9: During the night, Luke has a nightmare about the robbery.\n\nRating 6: The next morning, the group awake to find Luke's chest bleeding from puncture wounds and a naked Phil praying to the effigy, all of them having had nightmares.\n\nRating 10: Disturbed by their unconscious actions, the group seek to leave the woods.\n\nRating 6: While discerning their location, Luke spots a large figure amongst the trees, but Dom doubts him.\n\nRating 10: In their ensuing argument, Dom calls Luke a coward for letting Rob die.\n\nRating 3: Later that night, Luke is having another nightmare about the robbery, and is awakened by Phil's screams.\n\nRating 10: He emerges from his tent and finds Hutch's tent empty and partially collapsed.\n\nRating 10: The remaining three men rush deeper into the woods to search for him, but by dawn, they realize they are lost and unable to locate their campsite.\n\nRating 8: Continuing their search without their supplies, they find Hutch gutted and impaled on tree branches; they give him an impromptu burial.\n\nRating 10: Around sunset, Phil is suddenly dragged away by an unseen creature.\n\nRating 3: Luke and Dom decide to run; as the creature gives chase, the men find a torch-lined path leading to a small settlement and rush into a cottage.\n\nRating 10: After entering they are knocked unconscious.\n\nRating 8: When they awake, they find themselves restrained in a cellar.\n\nRating 3: An elderly woman enters and inspects Luke's chest wounds, revealing she bears a similar marking.\n\nRating 3: On her way out, she orders two men to take Dom upstairs.\n\nRating 6: A younger woman enters and explains that preparations are being made for a sacrifice.\n\nRating 8: Sometime later, a beaten Dom is returned to the basement.\n\nRating 3: He tells Luke that he is to be sacrificed to the creature, urging him to escape and destroy the village before he too is sacrificed.\n\nRating 5: Desperate to escape, Luke breaks his thumb and partially frees himself from his restraints as Dom is tied up outside by the townsfolk.\n\nRating 8: Amidst the ritual, Dom has a vision of his wife emerging from the forest, only to realise it is the creature as it picks him up and impales him on a nearby tree.\n\nRating 8: Some time later, the young woman returns.\n\nRating 3: When Luke asks about the creature, she explains that it is a Jötunn named \"Moder,\" an ancient god-like entity and an offspring of Loki that the cult provides sacrifices to in return for immortality.\n\nRating 3: Luke has been chosen and is to either worship Moder or be sacrificed.\n\nRating 10: After she leaves, Luke fully frees himself and ventures upstairs.\n\nRating 10: Armed with a torch, he finds a congregation of mummified worshipers that begin to move and sets them alight, burning the cabin, and attracting Moder.\n\nRating 8: Luke finds a hunting rifle and heads downstairs, killing a follower before taking another man's axe.\n\nRating 5: The enraged Jötunn kills the young woman while Luke shoots at her and escapes.\n\nRating 7: Moder pursues him, crippling his mind with hallucinations of Rob's death before catching and forcing him to his knees.\n\nRating 5: Luke refuses to submit and strikes her with the axe.\n\nRating 10: Following hallucinatory sign-posts and rays of sunlight, he emerges in an open field.\n\nRating 6: Unable to leave the forest, Moder roars in anger while Luke shouts back in triumph before heading towards a paved road."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 70109690,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70109690",
    "index": 34,
    "name": "The Uninvited",
    "maturity": "U/A 16+ ",
    "duration": "1h 27m",
    "synopsis": "Haunted by nightmares after her mother's death, a grieving teen and her sister try to prove her mother's nurse — and future stepmom — can't be trusted.",
    "year": "2009",
    "spoilers": "\n\nRating 10: Following a suicide attempt after her terminally ill mother died in a house fire, Anna Ivers is discharged from a psychiatric institution after ten months; she has no memory of the actual fire, though recurring nightmares from that night frequently plague her.\n\nRating 10: Back at home, Anna reunites with her older sister Alex and comes to learn their father Steven has a new girlfriend, Rachel Summers, who had been their mother's live-in nurse.\n\nRating 10: Anna and Alex become convinced that Anna's nightmares are messages from their mother, telling them that Rachel murdered her so that she could be with Steven.\n\nRating 10: The girls remain angry at Steven for moving their mother into the boathouse when she got sick, her only way of calling for help being a bell that Rachel tied to her wrist.\n\nRating 8: Anna meets up with her old boyfriend Matt, who tells her he saw what happened the night her mother died, but Rachel intervenes before he can explain further.\n\nRating 10: Anna goes with Rachel into town, so Alex can look through Rachel’s possessions, and Anna can talk to Matt again.\n\nRating 10: The two secretly plan to meet that night but Matt fails to show up.\n\nRating 10: Anna has a ghastly hallucination of him and, the next morning, his dead body is pulled out of the water, his back broken.\n\nRating 10: The police state he fell from his boat and drowned.\n\nRating 9: After the sisters are unable to find a record of Rachel with the State Nursing Association, they conclude she is actually Mildred Kemp, a nanny who killed the children she was taking care of after she became obsessed with their widowed father.\n\nRating 8: While Steven is away on business, the girls try to gather evidence against Rachel to show the police, but Rachel catches them and sedates Alex.\n\nRating 8: Anna escapes and goes to the local police station, but they do not believe her and eventually call Rachel to take her home.\n\nRating 8: Rachel sedates Anna and puts her to bed; Anna sees Alex in the doorway with a knife before passing out.\n\nRating 10: When she wakes up, she finds that Alex has killed Rachel and thrown her body in a dumpster in their backyard.\n\nRating 8: When Steven arrives home, Anna explains that Rachel tried to murder them and Alex saved them.\n\nRating 8: Confused and panicked, Steven asks what Anna is talking about:\n\nRating 7: Alex had died in the fire along with their mother.\n\nRating 7: Anna looks down to find that the bloody knife is in her hand.\n\nRating 10: She then finally remembers what happened on the night of the fire: after catching Steven and Rachel having sex, she became enraged, filled a watering can from a gasoline tank in the boathouse, and carried it toward the house, intending to burn it down.\n\nRating 10: However, she did not fully close the faucet\n\nRating 8: and it spilt a trail of gasoline that ignited when a lantern fell.\n\nRating 10: Her mother was killed in the resulting explosion, as was Alex.\n\nRating 10: Flashbacks reveal that Anna had been hallucinating Alex since she left the institution, which is why no one else had ever responded to Alex's dialogues.\n\nRating 3: She also remembers killing Matt, who showed up at their planned meeting by letting him fall off a cliff and break his back because he revealed that he saw what Anna had done.\n\nRating 3: She finally remembers killing Rachel, who was not actually a murderer but a kind woman trying to make the family work; she had sedated Anna to try and keep her safe.\n\nRating 3: The next morning as Anna is arrested for murder, the police question Steven, who reveals that Rachel changed her last name three years ago to escape an abusive ex-boyfriend, which her real name was Rachel Worshinsky.\n\nRating 10: When Anna returns to the mental institution, she is welcomed back by the patient who lives in the room across from hers, whose nameplate reveals she is the real Mildred Kemp."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 70043240,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70043240",
    "index": 35,
    "name": "Hostel",
    "maturity": "A ",
    "duration": "1h 33m",
    "synopsis": "Three unsuspecting friends travel to a hostel in Slovakia in search of hookups, only to become the objects of unimaginable torture.",
    "year": "2005",
    "spoilers": "\n\nRating 10: Two college students, Paxton Rodriguez and Josh Brooks, travel across Europe with their Icelandic friend Óli Eriksson.\n\nRating 6: In the Netherlands, they visit an Amsterdam nightclub, followed by a brothel.\n\nRating 6: Unable to get back into their hostel because of a curfew, they accept the offer of a man named Alexei to stay at his apartment.\n\nRating 10: He convinces them that, instead of going to Barcelona, they should visit a hostel in Slovakia filled with beautiful women.\n\nRating 8: The three board a train to Slovakia, where they encounter a Dutch businessman, who touches Josh's leg.\n\nRating 10: Josh yells at him, causing him to leave.\n\nRating 3: Arriving in Slovakia, they find that their roommates in the hostel are two women, Natalya and Svetlana.\n\nRating 3: The women invite them to a spa, and later to a disco.\n\nRating 3: Josh has a run in with a gang of local criminal gypsy kids.\n\nRating 4: The Dutch businessman intervenes to defend him.\n\nRating 10: Josh apologizes for his reaction on the train.\n\nRating 3: Paxton and Josh have sex with Natalya and Svetlana, while Óli leaves with the desk girl, Vala.\n\nRating 10: The next morning, Óli does not return.\n\nRating 6: The two are approached by a Japanese woman named Kana, who shows them a photo of Óli and her friend Yuki, who is also missing.\n\nRating 8: Elsewhere, Óli has been decapitated, while Yuki is being tortured.\n\nRating 8: Josh is anxious to leave, but Paxton convinces him to stay one more night with Natalya and Svetlana.\n\nRating 7: Both women slip the men tranquilizers.\n\nRating 10: Josh faints on his bed.\n\nRating 10: The ill Paxton ends up locked in the pantry.\n\nRating 10: Josh wakes up in a dungeon-like room, where the Dutch businessman begins maiming him with a drill, making holes in Josh's body, slicing his achilles tendons, then slitting his throat.\n\nRating 3: Paxton wakes up in the disco and returns to the hostel, where he learns that he had supposedly checked out.\n\nRating 10: He is greeted by two women who invite him to the spa.\n\nRating 7: Suspicious, he locates Natalya and Svetlana; Natalya takes Paxton to an old factory, where he sees Josh's mutilated corpse being stitched together by the Dutch businessman.\n\nRating 8: Two men drag Paxton down a hallway, passing by several rooms where other people are being tortured.\n\nRating 5: Paxton is restrained and prepped to be tortured by a German client named Johann.\n\nRating 5: While cutting off a few of Paxton's fingers with a chainsaw, Johann unintentionally severs his hand restraints.\n\nRating 10: Johann falls over, accidentally severing his own leg with the chainsaw.\n\nRating 7: Paxton shoots Johann in the head with a gun.\n\nRating 8: He then kills a guard, changes into business clothes, and finds a business card for the Elite Hunting Club, an organization that allows its clientele to pay to kill and mutilate tourists.\n\nRating 3: Paxton also discovers Kana, whose face is being disfigured with a blowtorch by an American client.\n\nRating 3: Paxton kills the man and rescues Kana and they flee in a stolen car, pursued by guards.\n\nRating 3: Paxton runs over Natalya, Svetlana, and Alexei, killing two of them while the pursuing car finishes off the third.\n\nRating 8: He also encounters the gypsy delinquents from earlier and gives them a big pack of candy and gum.\n\nRating 8: They then attack and kill the men pursuing Paxton with concrete blocks.\n\nRating 10: The two make it to the train station.\n\nRating 3: Kana, seeing her disfigured face, kills herself by leaping in front of an oncoming train, which attracts attention and allows Paxton to board another train unnoticed.\n\nRating 10: Aboard, Paxton hears the voice of the Dutch businessman.\n\nRating 10: When the train stops in Vienna, Austria, Paxton follows the Dutch businessman into a public restroom and makes him suffer and kills him in revenge for his friends’ deaths and suffering he caused him before boarding another train.\n\nRating 3: In the director's cut of the film, Paxton follows the Dutch businessman being accompanied by his young daughter into a public restroom of a train station.\n\nRating 8: After finding her teddy bear in the women's restroom, the Dutch businessman frantically searches the crowd for his missing daughter.\n\nRating 8: Paxton is then seen aboard the moving train with the Dutch businessman's daughter, whom he has kidnapped."
},{
    "genre": "Horror",
    "related-genre": [
        "Comedies",
        "Horror Movies",
        "US Movies"
    ],
    "id": 80164456,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80164456",
    "index": 36,
    "name": "The Babysitter",
    "maturity": "A ",
    "duration": "1h 25m",
    "synopsis": "When Cole stays up past his bedtime, he discovers that his hot babysitter is part of a satanic cult that will stop at nothing to keep him quiet.",
    "year": "2017",
    "spoilers": "\n\nRating 5: Pre-teen student Cole is bullied by his neighbor Jeremy, but his babysitter Bee, who is one of his only two friends, stands up for him and scares Jeremy off.\n\nRating 10: The following day, when his parents go out for an overnight stay at a hotel, Bee and Cole spend quality time together until he has to go to bed.\n\nRating 9: Bee offers him some liquor to drink, but he secretly pours it out when she is not looking.\n\nRating 5: Cole is encouraged by a text from his neighbor and other friend Melanie to go see what Bee gets up to after he goes to sleep.\n\nRating 5: He sees Bee and several of her high school friends  playing a game of truth or dare formatted as a game of spin the bottle.\n\nRating 7: However, as Bee kisses Samuel on a dare, she pulls two daggers from behind her back and stabs him in the skull.\n\nRating 3: The others collect Samuel's blood, revealing themselves to be members of a demonic cult.\n\nRating 8: Cole hurries to his room where he calls 911, puts on his shoes, and finds his pocket knife.\n\nRating 10: He pretends to be asleep as Bee and the cult members enter his room to draw a sample of his blood.\n\nRating 10: After they leave, he tries to escape out the window, but Bee secretly hides in his room and waits until Cole passes out from the exhaustion and loss of blood.\n\nRating 3: Bee and her cult question Cole, while fending off his questions by saying they needed his blood for a science project.\n\nRating 8: When two cops arrive, Max kills one of them with a poker, but the other cop accidentally shoots Allison in the chest before Bee slits his throat.\n\nRating 10: Cole is forced to give the cult the police code to call off the other cops.\n\nRating 8: While Allison cries over being shot, Cole rushes up the stairs; John pursues him, but is pushed over the banister, landing on a trophy that impales his neck.\n\nRating 8: Cole escapes out his bedroom window and hides in the crawlspace under his house.\n\nRating 10: Although Sonya finds him, he traps her in the basement and then ignites a firework rocket with bug spray, burning her to death.\n\nRating 10: Max runs into Cole and shows appreciation for Cole's ingenuity.\n\nRating 8: Max then hears Cole's bully egging Cole's house.\n\nRating 10: Max urges Cole to start standing up for himself which results in Cole getting punched in the face by his bully.\n\nRating 7: Max then chases Cole up a tree house; Max is killed when he falls and is hanged by the rope swing.\n\nRating 8: Cole escapes to Melanie's house, but Bee follows him.\n\nRating 8: While hiding in a room, Cole apologizes to Melanie for dragging her into this situation and assures her that he is going to take care of things.\n\nRating 6: He asks Melanie to call the police, then she kisses Cole before he leaves.\n\nRating 10: Cole returns to his house to find that the evidence of the night's events had been cleaned up.\n\nRating 10: He also finds Allison pretending to be dead; before she can stab Cole with a kitchen knife, Bee kills her with a police officer's shotgun.\n\nRating 3: Bee explains to Cole that she was once insecure like him until she made a deal with the Devil to get whatever she wanted by sacrificing innocent people and spilling their blood on an ancient book while reciting its verses.\n\nRating 6: Since then, she has been traveling from town to town, preying on young boys like him.\n\nRating 5: Although she offers to let him join her cult, Cole refuses and burns the spell book.\n\nRating 3: He rushes to Melanie's house to take her dad's car, and drives it into his house while Bee is distracted by the burning book.\n\nRating 7: After crashing the car into her, they have one last emotional farewell before Cole climbs out of the wreckage and leaves her to die.\n\nRating 3: As the police and emergency crew arrive, Cole tells his parents that he no longer needs a babysitter.\n\nRating 8: Later, a firefighter going through Cole's house is attacked by Bee."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 70104894,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70104894",
    "index": 37,
    "name": "Friday the 13th",
    "maturity": "A ",
    "duration": "1h 37m",
    "synopsis": "At Crystal Lake, Clay searches for his missing sister as a hockey-masked killer targets him and a group of teens in this reboot of the horror franchise.",
    "year": "2009",
    "spoilers": "\n\nRating 3: On Friday, June 13, 1980, a young Jason Voorhees watches as his mother Pamela is beheaded by a camp counselor, who was trying to escape Mrs. Voorhees's murder spree around Camp Crystal Lake.\n\nRating 8: Almost thirty years later, five friends—Wade, Richie, his girlfriend Amanda, Mike, and his girlfriend Whitney—arrive for a camping trip at Crystal Lake, where they hope to find a crop of marijuana growing in the woods.\n\nRating 5: That night, an adult Jason kills everyone except Whitney, whom he captures as she resembles his mother at a young age.\n\nRating 10: Six weeks later, Trent, his girlfriend Jenna, and friends Chelsea, Bree, Chewie, Nolan, and Lawrence arrive at Trent's summer cabin on the shore of Crystal Lake.\n\nRating 3: Meanwhile, Whitney's brother Clay Miller arrives at the lake to search for her, despite his local sheriff's pleas to look elsewhere.\n\nRating 10: Clay visits Trent's cabin, and Jenna agrees to help him search for Whitney.\n\nRating 8: Chelsea and Nolan go wakeboarding on the lake where Jason kills Nolan with an arrow, and fatally stabs Chelsea with his machete.\n\nRating 8: Meanwhile, Clay and Jenna search the old Crystal Lake campgrounds, where they see Jason hauling a body into the abandoned camp house.\n\nRating 7: Jenna and Clay run back to the cabin to warn the others about Jason.\n\nRating 10: Chewie is killed by Jason in a tool shed near the cabin, while Trent and Bree have sex in a bedroom.\n\nRating 8: Jenna and Clay arrive, and Clay calls the police.\n\nRating 10: Jason then disconnects the cabin's electricity.\n\nRating 10: Lawrence heads outside to search for Chewie, and Jason kills him with an axe.\n\nRating 3: Jason then sneaks inside and kills Bree.\n\nRating 10: A police officer arrives and knocks on the front door, but is killed by Jason before he can enter.\n\nRating 10: Trent, Clay, and Jenna escape the cabin and become separated, and Trent is killed by Jason when he reaches the main road.\n\nRating 3: Jason chases Clay and Jenna back to the campgrounds, where Clay discovers Jason's lair and finds his sister underground, chained to a wall.\n\nRating 4: Clay frees Whitney, and all three try to escape as Jason arrives.\n\nRating 10: They find an exit, but Jenna is impaled by Jason's machete before she can escape.\n\nRating 10: Jason corners Clay and Whitney in a barn, and Whitney confuses Jason by pretending to be Pamela.\n\nRating 6: Clay and Whitney subdue Jason with a chain, and Whitney stabs Jason in the chest with his machete.\n\nRating 4: After sunrise, Clay and Whitney dump Jason's body into the lake, but before they leave, Jason bursts through the wooden dock and grabs Whitney."
},{
    "genre": "Horror",
    "related-genre": [
        "Hindi-Language Movies",
        "Horror Movies",
        "Thriller Movies"
    ],
    "id": 81151880,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81151880",
    "index": 38,
    "name": "Game Over",
    "maturity": "A ",
    "duration": "1h 37m",
    "synopsis": "As a series of murders hit close to home, a video game designer with post-traumatic stress must confront her demons, or risk becoming their victim.",
    "year": "2019",
    "spoilers": "\n\nRating 10: Game Over starts with a serial killer  stalking a girl with cancer from outside her house and later at midnight killing her by wrapping her head in plastic and tying her hands behind her.\n\nRating 8: After that he takes her to an abandoned field where he beheads her and sets her body on fire.\n\nRating 8: Later, the film focuses on Swapna  who is a single young woman and also a talented game designer.\n\nRating 4: She has a fear of the darkness, and also has post-traumatic stress more so known as 'anniversary reaction', a condition, which triggers unsettling feelings around the anniversary of a traumatic event.\n\nRating 3: For Swapna, it is the horrific memory of her rape that took place on last New Year's Eve.\n\nRating 8: It is her second time that she suffers from the uncontrollable feeling whenever she enters darkness; the first time was one year ago, the following days after she was raped.\n\nRating 8: Her symptom starts when she feels pain at her wrist, where there is a tattoo she got one year ago.\n\nRating 10: As she got the tattoo too long ago, it was explained technically impossible by a doctor that the pain was caused by it, but only she knows there is a connection between the tattoo and her miserable memory.\n\nRating 8: Her family have a traditional mindset that think decent girls should not have tattoos or go out in the night; to which she did not listen, and was later raped.\n\nRating 10: Instead of encouraging her afterward, her parents kept blaming the tragedy on her, for having a tattoo and going out at night.\n\nRating 3: Because of this, she leaves her parents, never contacted them since, and leads a secluded life with Kalamma , a housemaid who stays with her.\n\nRating 10: Her only solace is her love for gaming.\n\nRating 10: Swapna later learns that her tattoo ink was mixed with a stranger's ash, because of a mistake by the tattoo artist.\n\nRating 7: She begins to have some bizarre dreams and finds that the girl Amutha , a cancer survivor, was an unfortunate victim of a serial killer.\n\nRating 10: Amutha's mother tells Swapna that her daughter will always be with her and want her to fight.\n\nRating 8: The same serial killer that killed many young women in the city, including Amutha, finally targets Swapna, who is now temporarily a wheelchair user due to an attempted suicide.\n\nRating 7: The killer kills Mr Anwar, the security of her house, and Kalamma, and finally Swapna.\n\nRating 8: But before Swapna is killed, she is surprised to find that she has three of the same tattoo pattern on her wrist, where she had only one.\n\nRating 10: Swapna wakes up from the \"nightmare\", but finds now only two tattoo patterns are left on her wrist.\n\nRating 9: She now realizes that she was not killed in a dream, but it is Amutha's spirit, who wants Swapna to fight, that gave her three lives, just like video games she is often playing.\n\nRating 10: And now Swapna has lost one life, with two remaining.\n\nRating 10: To avoid the same mistake that got them all killed in her first life, Swapna, who is now using her second life, call the police and stay in the house with Kalamma to wait for the police.\n\nRating 3: Police arrive in time and shoot the killer before the latter kills Swapna and after, however, kills Kalamma.\n\nRating 3: She seems to be saved and is taken by the police to the station.\n\nRating 10: But on their way, their vehicle is exploded by a bomb set by the killers.\n\nRating 3: It is now revealed that there was not only one killer that was trying to kill her, but three.\n\nRating 3: Swapna now is using her third, also the last life to fight against the killers.\n\nRating 10: Encouraged by Amutha's spirit, Swapna conquers her fear for darkness.\n\nRating 5: She does not turn on the light to draw the killers' attention.\n\nRating 8: Swapna and Kalamma manages to kill the first killer by setting him on fire.\n\nRating 10: The second killer almost kills them both but is also taken down by them.\n\nRating 8: The third killer beats Kalamma to unconsciousness and confronts Swapna, who manages to stab him to death with a piece of broken mirror."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 70001995,
    "tag": "Horror Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70001995",
    "index": 39,
    "name": "Seed of Chucky",
    "maturity": "A ",
    "duration": "1h 26m",
    "synopsis": "The son of devilish dolls Chucky and Tiffany resurrects his parents, unleashing a new wave of murderous mayhem— this time in Hollywood.",
    "year": "2004",
    "spoilers": "\n\nRating 3: Six years after the previous film, Glen, the benevolent living-doll son of Chucky and Tiffany, has a nightmare in which he murders a little girl's parents.\n\nRating 10: In reality, he is living as a dummy for \"Psychs\", an abusive ventriloquist in England.\n\nRating 3: Glen sees a preview of Jennifer Tilly's new horror film Chucky Goes Psycho on television, which features Chucky and Tiffany dolls rebuilt from their original remains; Glen realizes that he is their son.\n\nRating 5: Desperate to know his parents, Glen escapes Psychs and tracks the Chucky and Tiffany dolls to a prop room in Hollywood.\n\nRating 10: Glen uses the Heart of Damballa, a voodoo amulet, to resurrect them.\n\nRating 3: Chucky faints upon learning he has a son, but Tiffany is overjoyed.\n\nRating 3: When a special effects technician starts taking Tiffany apart, she and Chucky decapitate him with a wire.\n\nRating 8: Jennifer finds the beheaded body and calls the police.\n\nRating 10: Chucky, Tiffany, and Glen sneak a ride to her home in her limousine.\n\nRating 10: Having witnessed his parents murder the technician, Glen asks them why they kill, as he feels violence is bad.\n\nRating 9: Chucky and Tiffany are taken aback by the question and don't know how to answer, until Chucky replies that it helps them to relax.\n\nRating 3: On the other hand, Tiffany, feeling parental responsibility, agrees with Glen and forces Chucky to agree to stop killing for the sake of their son; Chucky falsely promises to do so.\n\nRating 10: Jennifer tries to get a role as the Virgin Mary in Redman's directorial debut.\n\nRating 4: After he tells her she is not right for the part, Jennifer invites him to her home, intending to seduce him for the role, much to the chagrin of her agent Joan.\n\nRating 7: Chucky and Tiffany make plans to transfer their souls into Redman and Jennifer.\n\nRating 8: Tiffany knocks them out and uses a turkey baster to inseminate Jennifer with Chucky's semen, intending to use her baby as a host for Glen's soul.\n\nRating 8: Chucky takes Glen on a car ride – during which they drive Britney Spears' car off the road – to photographer Pete Peters' darkroom.\n\nRating 7: Peters had taken pictures of Tilly kissing Redman and of Chucky masturbating.\n\nRating 10: Glen tries to warn Peters that Chucky is about to attack, but Peters bumps into a shelf and causes a jar of sulphuric acid to fall into his head, accidentally killing him.\n\nRating 10: Chucky is overjoyed, believing Glen did this on purpose, and takes a picture to celebrate, much to the dismay of both Glen and Tiffany.\n\nRating 3: Jennifer awakens the following morning, realizes that she is pregnant, and claims Redman is responsible.\n\nRating 10: Redman denies this and reveals that he previously had a vasectomy, leaving Jennifer confused.\n\nRating 10: He also tells Jennifer that, in light of her pregnancy, she is fired from his film.\n\nRating 3: Tiffany eviscerates Redman in anger, which Glen witnesses.\n\nRating 3: The next day, Jennifer wakes up to find herself with a full pregnant belly, a consequence of the voodoo magic.\n\nRating 10: Chucky captures Jennifer and her chauffeur Stan to take Redman's place.\n\nRating 6: Jennifer's assistant Joan tries to help her, but she is killed by Glen's murderous twin sister, Glenda, whose soul shares Glen's body and has taken over.\n\nRating 8: Tiffany smacks Glenda to bring back Glen, who is horrified at what has happened.\n\nRating 10: Jennifer gives birth to twins, a boy and a girl, and Tiffany realizes that both Glen and Glenda can inhabit the two children.\n\nRating 10: Chucky, amidst Jennifer screaming for help along with the crying babies and Tiffany screaming at him to initiate the ritual before the police arrive, has a sensory overload and stops chanting the spell.\n\nRating 3: He has an epiphany: Chucky has finally accepted his circumstances as a living doll and no longer wishes to become human.\n\nRating 10: Disgusted, Tiffany rejects Chucky and decides to take Glen with her.\n\nRating 3: Enraged, Chucky throws a knife at Jennifer to stop Tiffany from leaving him, but Stan jumps in the way to save her.\n\nRating 7: The police arrive, forcing the dolls to flee.\n\nRating 8: Jennifer is rushed to the hospital.\n\nRating 10: Tiffany drugs Jennifer and begins to possess her, but Chucky breaks in and kills Tiffany with an axe.\n\nRating 3: Devastated, Glen snaps and attacks Chucky, striking him with the axe.\n\nRating 8: Chucky assumes it's Glenda again, but Glen reveals it is actually him, finally able to kill in revenge for his mother's death.\n\nRating 6: Glen shouts at his father, asking if he is finally proud of him, as he dismembers Chucky, who praises Glen for his actions, before being decapitated.\n\nRating 3: Realizing what he has done, Glen suffers an emotional breakdown as Jennifer comforts him.\n\nRating 10: Five years later, at a birthday party for Jennifer's children, a nanny quits her job because Jennifer's daughter Glenda scares her.\n\nRating 6: Jennifer beats her to death with the Tiffany doll body, revealing that Tiffany was successful in transferring her soul into Jennifer's body.\n\nRating 8: Meanwhile, Glen opens a birthday present to see Chucky's severed arm, which springs up to grab him."
}]