[{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "Movies Based on Books",
        "Spy Movies",
        "US Movies"
    ],
    "id": 80146758,
    "tag": "Kids & Family Movies",
    "image": "https://occ-0-2774-6.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABUuwa85zjDiGaUURrexIT0fgRozPOPQPJt2z4OtxHKJeaKSIBEngi4wDNklqQqm0x2oSDFgRaDg9fDeihLDMIl378es1pPtCI7g.jpg?r=860",
    "source": "https://www.netflix.com/in/title/80146758",
    "index": 1,
    "name": "The Boss Baby",
    "maturity": "U/A 7+ ",
    "duration": "1h 37m",
    "synopsis": "A kid finds himself at the center of a sinister corporate plot when his parents bring home a baby who only talks business when they're not around.",
    "year": "2017",
    "spoilers": "\n\nRating 8: Tim Templeton, an imaginative 7-year-old boy, relishes his parents' attention and is horrified when a new baby brother arrives.\n\nRating 8: Boss Baby, whom he first saw arriving in a taxi, clad in suit and tie, and carrying a briefcase, behaves normally around the adults, crying for attention, food and diapers all day and night.\n\nRating 8: However, Tim, quickly growing jealous, sees Baby behaving and talking like an adult whenever his parents are not looking.\n\nRating 6: One day, Baby holds a staff meeting with other toddlers and infants, under the guise of a neighborhood play date.\n\nRating 9: Tim attempts to record them on a cassette tape, but he is spotted and chased by Baby and his cronies.\n\nRating 8: The parents see this as the children playing in the yard.\n\nRating 10: When Baby destroys Tim's stuffed lamb, the latter attempts to slingshot him out a window, but his parents stop him and he accidentally slingshots the tape into the street, on which a car smashes it.\n\nRating 6: Tim is grounded until he learns to get along with Baby.\n\nRating 3: Later, Baby makes Tim suck a special pacifier that allows them to see Baby Corp, where babies come from.\n\nRating 3: Most babies go to families, but those unresponsive to tickling are sent to management, where they are given a special baby formula that allows them to think and behave as adults while remaining young forever.\n\nRating 7: Baby also explains he's on a special mission to discover why the world's love of babies is being threatened lately by love of puppies, and came to the Templetons as Tim's parents work for\n\nRating 8: Once his mission is done, he will leave.\n\nRating 8: However, the boys overhear Baby's boss threatening to fire him if he fail.\n\nRating 8: As that would mean Baby would have to stay with the Templetons and grow up, Tim and Baby agree to work together to prevent this from happening.\n\nRating 3: On Take Your Kid to Work Day, the parents take Tim and Baby with them to Puppy Co., where the boys sneak away to investigate.\n\nRating 3: They are captured by Francis Francis, CEO of Puppy Co, who reveals he was previously the Boss of Baby Corp, but started to slowly grow up because he was partially intolerant to the formula.\n\nRating 10: He was fired and forced to live with a hillbilly family, but saved his magic pacifier.\n\nRating 3: He steals Baby's formula, intending to use it to make a \"Forever Puppy\" incapable of aging or dying, which will take all love from babies and give him his revenge on BabyCorp.\n\nRating 8: Francis whisks Tim's parents away to a conference in Las Vegas, and leaves his brother Eugene to watch the children in the guise of a female nanny.\n\nRating 10: Without the formula, Baby starts to periodically revert to normal infant behavior.\n\nRating 10: The boys, with help from the neighborhood toddlers, escape Eugene and head to Las Vegas, where they find Francis ready to send a rocket of Forever Puppies out into the world.\n\nRating 8: Tim's parents suspect something is wrong when they hear their children, but are locked up underneath the rocket to be burned.\n\nRating 7: Tim and Baby fight Francis on a raised walkway, pretending to be pirates; they knock him into the vat of augmented formula, where he turns back into a baby and is taken home by Eugene.\n\nRating 10: Tim saves his parents, but Baby goes completely infantile and is stranded on the rocket, which is about to launch.\n\nRating 10: Tim sings him a lullaby, and Baby jumps to him and is revived by the formula.\n\nRating 8: Baby is taken back to Baby Corp and promoted to CEO.\n\nRating 10: Some Baby Corp employees enter Tim's house, where they remove evidence of Baby, and make his parents forget about him while they are sleeping.\n\nRating 10: One of them asks Tim if he would like to forget too, but he declines.\n\nRating 10: Baby and Tim miss each other terribly, and Tim finally invites Baby back, saying if there is only love enough for one of them, Baby can have it all.\n\nRating 10: Realizing that love is something that grows, instead of being split, Baby returns, this time as a normal infant boy named Theodore \"Ted\" Templeton.\n\nRating 10: Years later, an adult Tim and Ted tell the story to Tim's eldest daughter, who is apprehensive about the arrival of her new baby sister.\n\nRating 10: After the adults leave, the newborn little girl reveals she is a Boss Baby, too, surprising the elder daughter."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "US Movies"
    ],
    "id": 81221372,
    "tag": "Kids & Family Movies",
    "image": "https://occ-0-2774-6.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABSOdvjP-MYvl6otr1nsybL4rFHAbkDuv2rDUp0maRqrL0nJYX8Ni4QnW9B2iE-PeGcUzGCQdtFYxPey__ZRlPlCSjwdBLWaASO4.jpg?r=c49",
    "source": "https://www.netflix.com/in/title/81221372",
    "index": 1,
    "name": "Tom and Jerry",
    "maturity": "U/A 7+ ",
    "duration": "1h 41m",
    "synopsis": "The classic cat-and-mouse duo creates chaos at a swanky NYC hotel when alley cat Tom is hired to get rid of scheming mouse Jerry before a VIP wedding.",
    "year": "2021",
    "spoilers": "\n\nRating 3: In a world co-populated by humans and cartoon animals, Tom Cat, who dreams of becoming a pianist, moves to Manhattan and buskes in Central Park, while Jerry Mouse is in search of a new home.\n\nRating 10: After Tom's keyboard is destroyed in an altercation, he chases Jerry, but accidentally tackles a young woman named Kayla Forester, causing her to lose her job.\n\nRating 10: Down on her luck, Kayla wants to prove her talents and looks for a position at New York's fanciest hotel, the Royal Gate, where Jerry moves in and Tom fails to break in.\n\nRating 3: Kayla, with a stolen resume, is hired to help plan a high-profile wedding and gets a tour of the hotel, while Jerry's usual antics involve stealing food and items to ramp up his new home, and Tom plans more strategies to enter the hotel and capture Jerry.\n\nRating 10: Local celebrities Preeta Mehta and her fiancé Ben are greeted, as they arrive, along with their pets Spike and Toots.\n\nRating 8: All, except for Spike, are unaware of Jerry stealing from Preeta's handbag.\n\nRating 8: As the couple and their pets are escorted to their room, Jerry's presence is revealed, which puts the wedding and the hotel at risk.\n\nRating 10: Kayla offers to catch Jerry, but fails and realizes that he'll be hard to catch.\n\nRating 3: After many failed attempts, Tom successfully enters the hotel, and his ensuing chase after Jerry wrecks a hotel room.\n\nRating 8: Due to noise complaints, Kayla comes to check, but she befriends Tom, due to their shared goal of catching Jerry.\n\nRating 10: Owner Mr Dubros hires Tom to exterminate Jerry, while Tom and Kayla's boss Terence threatens to fire them if Tom can't catch Jerry.\n\nRating 3: After many failed attempts, Tom designs an elaborate mouse trap and gets Jerry out of the hotel.\n\nRating 10: Meanwhile, Kayla helps with the wedding plans and learns from Preeta that her engagement ring is missing.\n\nRating 8: Jerry returns, to clash with Tom, and reveals to Kayla that he had Preeta's ring and agrees to give it back to her if she lets him live in the hotel.\n\nRating 10: Before Kayla can agree, Terence returns from walking Spike and notices Tom looking for Jerry hiding in Kayla's coat pocket, but creates a huge scene that causes Spike, Tom, and Jerry to destroy the hotel's lobby.\n\nRating 9: Terence is suspended, while Kayla is promoted to event manager, for returning Preeta's ring.\n\nRating 7: Kayla tells Tom and Jerry that they will have to get along and spend the next day bonding if they want to stay in the hotel, to which they reluctantly agree.\n\nRating 10: While Kayla takes care of the hotel and manages the wedding with the crew, Tom and Jerry explore the city, but are imprisoned at a pound, after inadvertently disrupting a New York Yankees baseball game, by committing fan interference.\n\nRating 10: A vengeful Terence separately visits Tom and Jerry and feeds them lies about what they said about each other behind their back, inciting them to a battle at the ceremony that throws the wedding into carnage and destroys the rest of the hotel.\n\nRating 3: After Kayla comes clean and leaves in humiliation, Terence evicts Tom, and Preeta renounces the wedding.\n\nRating 10: A sorrowful Tom and Jerry put their differences aside, and convince Kayla and the hotel crew, including a sceptical Terence, to salvage the wedding.\n\nRating 8: While the pair lure Preeta and Toots to Central Park, where the wedding is held at.\n\nRating 5: Kayla promises to Preeta that Tom and Jerry have atoned for their behaviour, and Ben apologizes to Preeta for his extensive expenses, in light of impressing her dad.\n\nRating 7: Kayla and the stolen resume's owner reconcile with each other and get jobs at the hotel, while Tom strives to be a pianist and plays the piano for Toots, with Jerry joining the party until a mishap causes them to fight again.\n\nRating 3: In the post-credit scene, Ben receives a bill for both weddings."
},{
    "genre": "Kids",
    "related-genre": [
        "Children & Family Movies",
        "Westerns",
        "US Movies"
    ],
    "id": 81594709,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81594709",
    "index": 1,
    "name": "Spirit Untamed",
    "maturity": "U/A 7+ ",
    "duration": "1h 27m",
    "synopsis": "After moving to a new town, a rebellious girl forms a bond with a wild mustang and finds a connection to her late mother’s legacy as a trick rider.",
    "year": "2021",
    "spoilers": "\n\nRating 10: In the early 1900s of the Wild West, Milagro Navarro-Prescott performs her trademark act in the circus until she falls from a horse during one of her performances and dies.\n\nRating 9: Years later, her young daughter, Fortuna Esperanza \"Lucky\" Navarro-Prescott, has been living with her aunt Cora and grandfather James in a city on the east coast.\n\nRating 3: However, after Lucky lets a squirrel in their house and ruins her grandfather's campaign party, she and Cora head to the western town of Miradero where they will stay with Lucky's father Jim, whom Lucky has not really known of after the incident with Milagro, for the summer.\n\nRating 10: On the train over, Lucky notices a kiger mustang running with his herd, and goes to the back of the train to meet him.\n\nRating 10: Upon arriving in Miradero, the pair meet local young riders Pru Granger , and Abigail Stone .\n\nRating 8: The next day, Lucky goes to a corral where she sees the same horse from before trying to be abusively manhandled by a man named Hendricks.\n\nRating 9: Lucky tells Jim and Cora about the horse, thinking he can be her new friend, but Jim does not want Lucky going near the horses after what happened to Milagro.\n\nRating 10: Nonetheless, Pru and Abigail help Lucky win over the trust of the horse, whom she names Spirit.\n\nRating 10: After a while, Spirit trusts Lucky enough to eat an apple she offers him, and allows her to pet him, sealing their bond.\n\nRating 4: Lucky attempts to ride Spirit but he escapes from the corral and runs away, while Lucky is saved by Pru and Abigail after almost falling off a cliff.\n\nRating 3: Jim finds and scolds Lucky for disobeying him.\n\nRating 8: They go home arguing, making Lucky think he has given up on her.\n\nRating 3: She sneaks out at night through the forest where she finds Spirit and his herd together, but are interrupted by Hendricks and his men, who capture all the horses but Spirit and take them in with a stolen train.\n\nRating 10: Knowing Hendricks and his men are wranglers, who are taking the horses to a boat to be auctioned and worked to death, Lucky agrees to help Spirit rescue his herd.\n\nRating 8: She enlists Pru and Abigail with their horses to embark on a journey to try and cut the wranglers off on their path by beating them to a water depot located beyond a summit called Heck Mountain.\n\nRating 10: During the trip, Lucky builds up her relationship with Spirit, and becomes good friends with Pru and Abigail as they travel.\n\nRating 3: The girls reach the water depot the night before the wranglers are set to arrive, but Lucky wakes up the next day realizing the wranglers made it earlier than expected.\n\nRating 10: Spirit desperately attempts to save his herd on his own, but gets taken in by the wranglers.\n\nRating 10: Determined to save Spirit, Lucky and her friends follow the train to the docks, where the wranglers are boarding the horses onto the boat.\n\nRating 10: The girls arrive too late to stop the boat from leaving, but they manage to save Spirit.\n\nRating 3: Lucky and Spirit get on board by leaping off the docks, and free the other horses and subdue the wranglers, with Spirit knocking Hendricks off the boat.\n\nRating 3: Jim, Cora, and Al  show up on a fast steam train, and arrest Hendricks and the other wranglers.\n\nRating 3: On their way back to Miradero, the girls travel to a field in the middle of the wilderness, and Lucky lets Spirit go, saying that he needs to stay with his herd.\n\nRating 4: When she returns home, Lucky and Cora initially plan to return to the city, but after Lucky bonds with Jim at a rodeo, she decides instead to stay in Miradero with him and her friends, as Spirit is seen riding through the fields with his herd."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "US Movies"
    ],
    "id": 80994666,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80994666",
    "index": 1,
    "name": "We Can Be Heroes",
    "maturity": "U/A 7+ ",
    "duration": "1h 40m",
    "synopsis": "When alien invaders capture Earth’s superheroes, their kids must learn to work together to save their parents — and the planet.",
    "year": "2020",
    "spoilers": "\n\nRating 10: Missy Moreno is at home with her dad, Marcus, when they receive word to come to the rescue of heroes where Missy has to go with her father and be with other Heroics' children.\n\nRating 10: Missy meets the other children there:\n\nRating 8: The kids watch the battle between the aliens and Heroics on television, ending with the Heroics' capture.\n\nRating 10: Missy realizes that Ojo's drawings tell the future.\n\nRating 8: When a drawing shows aliens breaking into the vault, the kids hatch a plan to escape.\n\nRating 3: Face Maker tricks the guards into coming into the vault where Guppy subdues them, but not before one of the guards triggers an emergency lockdown.\n\nRating 8: Rewind sends them back in time, Wheels stops the guard from pushing the button, and Noodles steals their security badges.\n\nRating 10: Mrs. Granada spots Missy in the hallway and seals the doors, but A-Capella makes a staircase to the roof, allowing them to escape.\n\nRating 10: Noodles secure a vehicle, and the kids escape.\n\nRating 10: They land at the home of Missy's grandmother, Anita Moreno, who is the Heroics' trainer and helps the kids master their powers and work as a team.\n\nRating 5: The aliens arrive and Grandma sends the kids through a tunnel that leads to an empty field before she is captured.\n\nRating 8: The kids spot an empty alien craft and use it to reach the Mother ship.\n\nRating 8: Locating a room with a purple pyramid, they see the president and Ms. Granada speaking.\n\nRating 7: They are alien spies, sent to prepare Earth for a \"takeover\".\n\nRating 8: The kids are placed in a cell.\n\nRating 10: Guppy makes a replica of the key from the children's tears and opens the door.\n\nRating 5: A fight between the kids and the aliens ensues, and Wild Card is caught and taken for questioning while the others seek the pyramid.\n\nRating 8: Wheels hacks into the motherboard, but Ojo reveals that she can speak and is the Supreme Commander of the aliens.\n\nRating 3: Missy communicates with Wild Card in the control room; Face Maker has switched places with him.\n\nRating 10: Granada goes after Wild Card, but not before the protective shield around the motherboard is deactivated.\n\nRating 3: With the kids holding off the aliens, Wheels and Noodles remove the motherboard and swap it with a new one deactivating the alien's rocket and foiling the takeover.\n\nRating 10: To the kids' surprise, their parents emerge from the rocket.\n\nRating 3: Ojo reveals that she and Ms. Granada faked the \"takeover\" to train the kids to be the new Heroics.\n\nRating 10: The kids reunite with their parents and are soon ready to save the world."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "Movies Based on Books",
        "US Movies"
    ],
    "id": 60022058,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/60022058",
    "index": 1,
    "name": "Stuart Little 2",
    "maturity": "U/A 7+ ",
    "duration": "1h 17m",
    "synopsis": "Trouble's in the air for spirited city mouse Stuart and family cat Snowbell when a new canary friend flies into danger with a ruthless falcon.",
    "year": "2002",
    "spoilers": "\n\nRating 10: Set three years after the events of the first film, Stuart Little has settled into family life with his parents, older brother George, and baby sister Martha, who has yet to say her first words.\n\nRating 10: Stuart is becoming tired of his adoptive mother Eleanor's overprotectiveness due to his small size, and is finding himself lonely when George would rather play with his own friend, Will.\n\nRating 10: When playing by himself, Stuart accidentally wrecks George's toy plane, prompting George to furiously throw it into a trash can.\n\nRating 8: Stuart's adoptive father Frederick tells him there is a 'silver lining' to every bad situation, and encourages him to find a new friend of his own.\n\nRating 7: When driving home from school in his roadster, Stuart meets Margalo, a canary who falls into his car.\n\nRating 3: Margalo states she has injured her wing being chased by a predatory Falcon, and Stuart takes her home to recover.\n\nRating 10: Unbeknownst to the Littles, Margalo is in fact physically healthy, and is working with Falcon to steal precious items from households.\n\nRating 5: However, she soon bonds with the Littles, and feels immense guilt over what she is planning to do; Falcon warns her that if she does not complete their plan, he will kill Stuart.\n\nRating 10: Margalo steals Eleanor's ring, prompting Stuart to venture down the Littles' kitchen drain in an unfruitful attempt to find it again.\n\nRating 3: He soon finds himself in trouble, but Margalo rescues him; realizing the danger she is putting him in, she leaves the next morning.\n\nRating 8: Stuart becomes convinced Falcon has kidnapped her, and sets off to find her with the family cat Snowbell, convincing George to conduct a series of elaborate  lies to Eleanor in order to cover for him.\n\nRating 7: Stuart and Snowbell seek out street-cat Monty, who tells them that Falcon lives at the top of the Pishkin Building, and warns that he is an extremely dangerous foe.\n\nRating 3: Stuart uses a balloon to fly to the summit of the Pishkin Building, but is taken aback when Margalo reveals her alliance with Falcon.\n\nRating 10: Falcon traps Margalo in a paint can, and attempts to kill Stuart by dropping him from the sky; Stuart instead lands in a garbage truck and is taken to a garbage barge out at sea.\n\nRating 8: Initially devastated at the series of events, Stuart soon finds his silver lining by rediscovering and subsequently repairing George's broken toy plane, which he uses to fly back to land.\n\nRating 8: Meanwhile, George, after being reprimanded by his parents for lying and interrogated on Stuart's whereabouts, confesses where Stuart is to them, prompting them to head out and look for him.\n\nRating 8: In the meantime, Snowbell has also ventured up the Pishkin Building, and frees Margalo from the paint can, only to become trapped in it himself.\n\nRating 10: Margalo breaks free from Falcon's control, and flies away with Eleanor's ring, prompting Falcon to give chase.\n\nRating 10: Stuart arrives in his toy plane, and a furious chase occurs through New York, with the Littles following from behind.\n\nRating 5: Stuart ultimately wins the battle by using the ring to blind Falcon's vision, before jumping from the plane and allowing it to crash into Falcon as he falls into a trash can and is most likely eaten by Monty.\n\nRating 10: The day saved, Frederick and Eleanor forgive Stuart for running away and George for lying to them, and tell them they are extremely proud of them for their bravery.\n\nRating 10: Later, Margalo fulfills her dream of flying south for the winter, planning on returning to the Little household in the spring.\n\nRating 7: Martha stuns everyone by using her first words to say goodbye to Margalo."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "Movies Based on Books",
        "US Movies"
    ],
    "id": 81286595,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81286595",
    "index": 1,
    "name": "Clifford the Big Red Dog",
    "maturity": "U/A 7+ ",
    "duration": "1h 37m",
    "synopsis": "After their tiny red puppy grows into a 25-foot giant, a young girl and her uncle must protect their lovable new pet from an evil genetics company.",
    "year": "2021",
    "spoilers": "\n\nRating 8: In New York City, Emily Elizabeth Howard, a 12-year-old middle school student who lives with her English accent mother, Maggie, is regularly bullied by a popular girl at school named Florence, but finds comfort in her only new friend Owen Yu.\n\nRating 8: Maggie leaves her in the care of her van-dwelling and irresponsible uncle Casey before going to Chicago for a business trip.\n\nRating 10: Mr. Bridwell, who runs an animal rescue tent at a park, introduces Emily to a small red puppy whose family had been taken by dogcatchers.\n\nRating 10: He tells her that the puppy will grow based on how much love he receives.\n\nRating 10: Casey rejects the adoption due to dogs not being allowed in the apartment building.\n\nRating 3: When Emily gets home from school, she finds the puppy in her backpack and names him Clifford.\n\nRating 8: Casey allows her to keep Clifford only for one night.\n\nRating 10: The next morning, Clifford has grown to giant proportions.\n\nRating 10: Emily and Casey attempt to hide him from the building's superintendent, Mr. Packard.\n\nRating 7: They try taking Clifford to a veterinarian, but he chases and plays with a man in an inflatable bubble.\n\nRating 3: Word of his existence quickly spreads online.\n\nRating 3: After learning from the vet's secretary of Bridwell's past miracles with animals and their owners, the Howards plan to get information on his whereabouts.\n\nRating 10: As Emily is getting lunch for Clifford from the cafeteria, Clifford escapes from Casey's truck and humiliates Florence, giving Emily the friends she always wanted.\n\nRating 3: Zac Tieran, the owner of biotechnology company Lyfegro, discovers Clifford on social media.\n\nRating 8: He lies to the police that Clifford is his dog and has them search for him.\n\nRating 4: After being evicted from their apartment and chased by the police and Lyfegro guards, Emily and Casey take shelter in Owen's lavish apartment.\n\nRating 3: Casey tells Emily she can keep Clifford if they find Bridwell and take his advice.\n\nRating 10: If he cannot help, Clifford must be sent to China, where Owen's father has a sanctuary.\n\nRating 10: They race to the hospital, only to find Bridwell's empty bed and a patient who tells them Bridwell has died.\n\nRating 10: Clifford is thus sent away by a boat arranged by Mr. Yu as Emily tearfully says goodbye.\n\nRating 6: The next day, Clifford is captured on the ship by Lyfegro personnel and sent to Lyfegro.\n\nRating 5: Emily soon learns Bridwell did not die, so she and Casey try to save Clifford from being operated on at Lyfegro, aided by friends from their neighborhood.\n\nRating 8: They break into Lyfegro's headquarters and rescue Clifford, who then flees through the city with Emily riding on him.\n\nRating 10: At Manhattan Bridge Park, a large crowd gathers as Emily desperately asks Bridwell to help, and he tells her that she must stand up for herself and for Clifford and that being different is a gift.\n\nRating 10: Emily explains to everyone the importance of love, regardless of differences.\n\nRating 10: However, Tieran, who arrived right after Emily finished her monologue, orders the police chief to see who Clifford's owner is by checking an ID chip he had implanted.\n\nRating 10: When the chip identifies Emily as Clifford's rightful owner, the police arrest Tieran and inform him that he will be fined for lying to them.\n\nRating 10: Emily, Casey, and Maggie are welcomed back into their apartment.\n\nRating 3: Casey gets a job at Scholastic Corporation and moves out of his van."
},{
    "genre": "Drama",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Sports Movies",
        "Dramas"
    ],
    "id": 81283585,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81283585",
    "index": 1,
    "name": "Skater Girl",
    "maturity": "U/A 7+ ",
    "duration": "1h 49m",
    "synopsis": "When a teen in rural India discovers a life-changing passion for skateboarding, she faces a rough road as she follows her dream to compete.",
    "year": "2021",
    "spoilers": "\n\nRating 10: In the present day in a remote village in Rajasthan, teenager Prerna is living a life bound by tradition and duty to her parents.\n\nRating 10: When London-bred advertising executive Jessica arrives in the village to learn more about her late father's childhood, Prerna and the other local children are introduced to an exciting new adventure thanks to Jessica and her old friend Erick who cruises into town on a skateboard.\n\nRating 10: The kids become infatuated with the sport, skating through the village, disrupting everything and everyone around them.\n\nRating 3: Determined to empower and encourage their newfound passion, Jessica sets out on an uphill battle to build the kids their own skatepark, leaving Prerna with a difficult choice between conforming to society's expectations of her or living out her dream of competing in the National Skateboarding Championships."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "Movies Based on Books",
        "US Movies"
    ],
    "id": 81011712,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81011712",
    "index": 1,
    "name": "YES DAY",
    "maturity": "U/A 7+ ",
    "duration": "1h 29m",
    "synopsis": "A mom and dad who usually say no decide to say yes to their kids' wildest requests — with a few ground rules — on a whirlwind day of fun and adventure.",
    "year": "2021",
    "spoilers": "\n\nRating 8: Allison and Carlos Torres are married with three children: Katie, Nando, and Ellie.\n\nRating 10: When they first met, they were adventurous and said yes to everything.\n\nRating 8: However, once having children, they feel they must say no to protect them.\n\nRating 10: One evening, they are called into a parent-teacher conference at school where they discover Katie and Nando have both submitted homework calling their mom a dictator.\n\nRating 10: Allison expresses frustration that her children perceive her this way and tells Carlos that she feels he makes her play the role of \"bad cop\" with their children.\n\nRating 8: Mr. Deacon, a school employee, and father of six overhears and shares with them that he maintains order in his house by having a 'yes day' from time to time: one 24-hour period where the parents cannot say no, within reason.\n\nRating 10: Carlos and Allison present the idea to their family, telling them that if they don't get into trouble, do their chores, and keep their grades up, they can have a yes day as a reward.\n\nRating 3: Katie makes a wager with Allison that if her mom makes it through Yes Day, Katie will go to the music festival Fleek Fest with her mother.\n\nRating 10: If she doesn't make it, Katie will be allowed to go with a friend, Layla.\n\nRating 8: The children eventually manage to earn a yes day and put together a list of five activities for the day.\n\nRating 3: The first three are Ellie dressing her parents in crazy outfits and requests that they don't look at anything with a screen on it all day, ordering a massive $40 sundae that is free if they can eat it all in 30 minutes, that they successfully eat, going through a car wash with the windows down, and entering a capture the flag competition, where each family member leads a group; the goal is for one team to catch the others, throwing balloons filled with Kool-Aid at their opponents.\n\nRating 10: Allison wins the game for her team, winning the children's approval.\n\nRating 10: Carlos, however, is tempted to drop out of Yes Day, but ultimately decides he can't bear to disappoint his family.\n\nRating 10: The fourth event is a trip to Six Flags Magic Mountain.\n\nRating 8: When Katie steps away, Allison sees texts on her daughter's phone from Layla indicating she and Katie will be hanging out with older boys at Fleekfest.\n\nRating 10: Allison tells her that the wager is off and she's going to Fleekfest with her, not Layla.\n\nRating 10: Hurt, Katie storms off.\n\nRating 8: In an attempt to win a pink gorilla for Katie as an apology, Allison and Carlos get into a fight with another park-goer and are arrested.\n\nRating 7: The children sneak away.\n\nRating 10: Katie goes to Fleekfest with Layla but quickly becomes uncomfortable being alone with older boys, and her friend abandons her.\n\nRating 8: Nando stages a \"nerd party\" at the house as the final big event, but it quickly gets out of control when Ellie accidentally sets off a foam explosion inside the house that was meant for the backyard.\n\nRating 10: Meanwhile, Katie's phone dies while trying to contact her siblings and she panics.\n\nRating 10: With help from H.E.R., who is performing at the event, Allison finds Katie and they reconcile.\n\nRating 10: H.E.R. is moved and invites them on stage for a song.\n\nRating 4: Carlos arrives home and finally manages to be a disciplinarian, forcing the party to stop and the children to help with the cleanup.\n\nRating 8: As Yes Day draws to a close, Ellie makes one final request.\n\nRating 10: They all spend the night playing games as a family in a tent in the backyard, until Nando's foam bomb  starts to fill up the house.\n\nRating 10: In a mid-credits scene, the Torres family and other players pelt Mr. Deacon with Kool-Aid balloons at the Capture the Flag field as revenge for suggesting Yes Day in the first place."
},{
    "genre": "Romance",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Romantic Comedies",
        "Comedies",
        "Romantic Movies",
        "US Movies"
    ],
    "id": 81228331,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81228331",
    "index": 1,
    "name": "The Royal Treatment",
    "maturity": "U/A 7+ ",
    "duration": "1h 37m",
    "synopsis": "New York hairdresser Izzy seizes the chance to work at the wedding of a charming prince, but when sparks between them fly, will love — or duty — prevail?",
    "year": "2022",
    "spoilers": "\n\nRating 3: Izzy  is a hairdresser.\n\nRating 8: One day, the microwave in her salon causes a fire.\n\nRating 8: The assistant of the salon's landlord, Doug, asks for payment for the damage so she gives the money she had saved for traveling the world.\n\nRating 8: The prince of Lavania, Prince Thomas, asks his assistant Walter to schedule a haircut.\n\nRating 10: Walter mistakenly calls up Izzy's salon, telling her that she will be paid $500 for the haircut.\n\nRating 10: Izzy agrees.\n\nRating 10: When she meets the prince and starts cutting his hair, a housekeeper comes with tea and accidentally drops it.\n\nRating 10: Izzy is upset at how badly the housekeeper is treated and leaves without finishing the Prince's haircut.\n\nRating 3: She returns to the salon, where Thomas comes in to finish the haircut.\n\nRating 10: Afterward, Izzy agrees to walk the prince back to the metro and the two share a fun night.\n\nRating 8: The next day Thomas, his fiancée Lauren, and her mother discuss who to hire as the makeup artists for the wedding.\n\nRating 10: Walter recommends Izzy's salon.\n\nRating 10: Lauren and her mother agree and Izzy and her friends travel to Lavania.\n\nRating 7: They'll get $50,000 dollars as payment for the royal wedding.\n\nRating 3: Another assistant, Madam Fabre, tests their makeup skills.\n\nRating 8: Izzy passes but her coworkers don't so Madam Fabre trains them.\n\nRating 10: Izzy goes to see the province and Thomas accompanies her.\n\nRating 6: They have fun at the Uber de glares which is considered by the royals as a 'dangerous' part of town.\n\nRating 5: The next day, Thomas states to his family that he wants to do more for the locals.\n\nRating 8: Izzy encourages the locals to donate to the less fortunate children by leaving items at the castle gate.\n\nRating 5: Lauren tells Thomas that she wants part of their new estate to be for her work studio.\n\nRating 6: Thomas finds the guard house full of donated toys for the children.\n\nRating 3: He also decides to donate some royal furniture that the queen threw out.\n\nRating 3: Izzy and Thomas drive the toys and some royal furniture to the orphanage.\n\nRating 10: Lauren's mother observes that Thomas and Izzy are getting too close.\n\nRating 10: Lauren is not concerned, commenting that she would rather focus on her business ideas than marry someone she barely knows.\n\nRating 10: When a photo of them ends up in the papers, Izzy is asked to leave.\n\nRating 3: It is revealed that the reason why the King and Queen want Thomas to marry Lauren is because her family could help them get out of debt.\n\nRating 10: On the wedding day, Walter tells Thomas that he knows Thomas is in love with Izzy.\n\nRating 10: Thomas tells Lauren he can't marry her.\n\nRating 7: She is relieved as she also does not want to get married.\n\nRating 3: Izzy returns to find that there was a major fire in the salon.\n\nRating 8: When Doug visits asking for money, she tells him that she had spoken with the owner, who had expected Doug to rewire the property last year.\n\nRating 10: The family makes plans to refurbish the salon but Izzy tells them she doesn't want to work at the salon anymore, instead choosing to be director of a local community center.\n\nRating 6: As Izzy gazes at the road from her house fire exit, she hears horse hooves.\n\nRating 10: Prince Thomas rides to Izzy's house on horseback and confesses his feelings for her.\n\nRating 10: They kiss.\n\nRating 3: The movie ends with them going to get gelato on horseback."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Dramas",
        "Martial Arts Movies",
        "US Movies"
    ],
    "id": 70125931,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70125931",
    "index": 1,
    "name": "The Karate Kid",
    "maturity": "U/A 7+ ",
    "duration": "2h 20m",
    "synopsis": "In China, Dre learns to defend himself against a bully under the guidance of an unassuming kung fu master in this remake of the 1984 classic.",
    "year": "2010",
    "spoilers": "\n\nRating 3: 12-year-old Dre Parker leaves Detroit for Beijing after his widowed mother Sherry gets a job transfer at a car factory.\n\nRating 10: There, Dre meets Meiying, a young violinist who reciprocates his attention.\n\nRating 8: However, 15-year-old Cheng, a rebellious Kung Fu prodigy whose family is close to Meiying's, keeps them apart by constantly attacking, teasing and bullying Dre.\n\nRating 10: As revenge, Dre throws a bucket of dirty water over Cheng and his gang after a school field trip to the Forbidden City.\n\nRating 7: Enraged, they chase, corner and brutally beat Dre at an alley.\n\nRating 9: Mr. Han, a maintenance man who repaired for Sherry, intervenes and fends off the boys, revealing himself to be a Kung Fu master.\n\nRating 8: Mr. Han heals Dre's injuries using the ancient Chinese medicine methods of fire cupping.\n\nRating 6: He explains that Cheng and his friends are not inherently bad, but made so by Master Li, who teaches his students to be merciless towards their enemies.\n\nRating 8: Intrigued, Dre asks if Han could teach him Kung Fu.\n\nRating 3: Mr. Han refuses and instead brings him to Li's Fighting Dragon studio to make peace.\n\nRating 3: Li harshly rebuffs the peace offer and challenges Dre to a fight with Cheng.\n\nRating 8: Mr. Han instead counters that Dre compete against Li's students at an upcoming Kung Fu tournament.\n\nRating 10: He requests that his students leave Dre alone to train until then.\n\nRating 3: Li begrudgingly accepts as long as Dre shows up at the tournament.\n\nRating 10: Mr. Han begins to teach Dre Kung Fu by emphasizing movements that apply to life in general.\n\nRating 10: He conveys that serenity and maturity, not punches and power, are the true keys to mastering Kung fu.\n\nRating 10: Han makes Dre perform repetitive motions using his jacket.\n\nRating 10: Through this, Dre develops muscle memory.\n\nRating 8: Han takes him to a Taoist temple in the Wudang Mountains.\n\nRating 3: There, Dre witnesses a woman making a cobra reflect her movements and later drinks the water from a Taoist well.\n\nRating 10: After many weeks of laborious training, Mr. Han gives Dre a day off.\n\nRating 10: Dre goes to see Meiying, persuading her to cut school for a day of fun.\n\nRating 10: This makes her nearly late for a violin audition, and her parents thus deem Dre a bad influence, forbidding her from ever seeing him again.\n\nRating 10: Dre heads to see Mr. Han, but finds him drunk and depressed, smashing a car he was working on.\n\nRating 8: Mr. Han tearfully explains that he crashed the same car years ago, which killed his wife Zhang and 10-year-old son Gong Gong.\n\nRating 7: He fixes the car every year but smashes it to remind himself of what happened.\n\nRating 6: Dre decides to train harder and help his teacher overcome his trauma.\n\nRating 8: Mr. Han assists Dre in writing and reciting a note of apology in Mandarin to Meiying's father.\n\nRating 8: He accepts the apology, promising that Meiying will attend the tournament to support Dre.\n\nRating 10: At the tournament, the under-confident Dre starts defeating all of his opponents.\n\nRating 10: Enraged, Li orders Liang, one of his students, to injure Dre in the semi-finals.\n\nRating 4: Liang reluctantly does so by delivering a series of crippling blows to Dre's leg.\n\nRating 7: He gets disqualified as a result, and Dre advances to the final against Cheng.\n\nRating 5: Dre pleads with Mr. Han to heal his leg via the fire cupping method.\n\nRating 3: Realizing this is more about overcoming Dre's fear than anything else, Mr. Han complies.\n\nRating 10: The final match starts.\n\nRating 8: On Li's orders, Cheng attacks Dre's injured leg.\n\nRating 10: This causes Dre to lose balance.\n\nRating 8: Dre struggles but manages to get up and uses the snake stance he saw at the temple.\n\nRating 10: The move is successful, and Dre catches Cheng with a kick to the head, defeating him.\n\nRating 10: Dre wins the tournament, earning the respect of Cheng and his classmates.\n\nRating 3: Cheng presents Dre with the trophy and all of the Fighting Dragon students bow down to Mr. Han, accepting him as their new master, leaving Li defeated.\n\nRating 10: In a sequence that was shot but cut from the final product, Master Li raises his hand to slap Cheng and his friends for not beating Dre in the tournament , but he is stopped and reprimanded by Mr. Han, who thought that Master Li's students had already suffered too much at his hands.\n\nRating 8: This eventually leads to a Kung Fu battle between Mr. Han and Master Li, who end up facing off in front of a surprised audience, the frightened Fighting Dragons and a shocked, confused, and injured Dre, who even with a limp, tries to go where Mr. Han is fighting, without understanding what happened.\n\nRating 8: The fight ends as Mr. Han kicks Master Li off the stage where the old master was sitting and furious, leaps from the stage towards Master Li, pinning him down and with his fist raised says against Master Li in Mandarin with a menacing tone: \"Do not stop when our enemy is down.\n\nRating 8: No mercy.\n\nRating 5: No mercy in studio.\n\nRating 3: No mercy in competition.\n\nRating 8: No mercy in life.\n\nRating 8: Our enemy deserves pain\".\n\nRating 8: Dre and the Fighting Dragons watch from afar.\n\nRating 5: One of the members of the Fighting Dragons tells Mr. Han to knock out Master Li.\n\nRating 8: However, he is stopped by Dre, who says that Master Li has had enough of a beating.\n\nRating 10: Dre and Mr. Han are congratulated by Cheng and the Fighting Dragons as they leave.\n\nRating 8: In the end, Sherry , along with Meiying, leave with the tournament trophy won by Dre, but not before punching Master Li for his students’ actions against Dre."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Movies Based on Books",
        "US Movies"
    ],
    "id": 80993016,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80993016",
    "index": 1,
    "name": "Roald Dahl's Matilda The Musical",
    "maturity": "U/A 7+ ",
    "duration": "1h 56m",
    "synopsis": "An extraordinary girl with a sharp mind and a vivid imagination takes a daring stand to change her story — with miraculous results. Meet Matilda.",
    "year": "2022",
    "spoilers": "\n\nRating 8: In a hospital, while other parents adore their newborn children, Mrs. Wormwood is distraught to learn she is pregnant and in labour.\n\nRating 8: To her husband Mr. Wormwood's confusion, she gives birth to a girl, Matilda.\n\nRating 10: Despite her parents' constant disdain, Matilda becomes a sweet child who loves reading and visits the librarian Mrs. Phelps daily.\n\nRating 10: Upon discovering that Matilda has not been properly schooled, teacher Miss Jennifer Honey and an inspector visit the house to suggest Matilda be sent to Crunchem Hall.\n\nRating 7: Angry about being fined for not sending his daughter to school, Mr. Wormwood warns the severe headmistress, Miss Agatha Trunchbull, about Matilda.\n\nRating 10: Before school, Matilda tells Mrs. Phelps a story about an escapologist who falls in love with and marries an acrobat.\n\nRating 8: Arriving at school, Matilda and her fellow new student Lavender are warned about the terrible way the students are treated there.\n\nRating 8: In Honey's classroom, Matilda solves a complex mathematical equation on the board and confesses that she loves reading most.\n\nRating 5: An impressed Honey asks Trunchbull to move Matilda to a more advanced class, but Trunchbull refuses to let Matilda be an exception to the rules.\n\nRating 10: At home, when Matilda criticizes her father, he rips her book apart and wrongly sends her to bed; the next day, she retaliates by gluing his hat to his head.\n\nRating 8: During the students' lunch, Trunchbull falsely accuses Matilda of stealing a slice of her private chocolate cake, but Bruce Bogtrotter accidentally reveals he is the culprit by belching.\n\nRating 7: Trunchbull forces him to eat the entire cake, saying he will be forgiven if he eats every last crumb.\n\nRating 10: Bruce's success thrills Matilda, Honey, and the students.\n\nRating 3: After school, Matilda returns to Mrs. Phelps and continues her story: the now-pregnant acrobat is forced to perform a dangerous stunt by her husband's stepsister; she is horribly injured and dies after giving birth to a daughter.\n\nRating 10: The escapologist forgives the stepsister and asks her to help him raise his daughter.\n\nRating 10: The stepsister blames the daughter for her stepsister's death and secretly abuses her.\n\nRating 10: When the escapologist discovers his daughter is mistreated, he never returns from confronting the stepsister.\n\nRating 3: The next day, after Trunchbull forces the children through challenging exercises to crush their rebelliousness.\n\nRating 6: Lavender slips her pet newt into her drinking water, and after Matilda stands up to Trunchbull, she uses her newly discovered telekinesis to embarrass Trunchbull.\n\nRating 3: Honey invites Matilda to her cottage, where Matilda learns that the escapologist and the acrobat were Miss Honey's parents and the evil stepsister is Trunchbull.\n\nRating 5: Returning home, Matilda learns that her father has cheated the mafia and the family will be fleeing to Spain, distressing Matilda about never seeing her friends again.\n\nRating 8: When the children return to school, Trunchbull forces Honey's class to spell words correctly or be locked in a new Chokey.\n\nRating 8: She has Lavender spell a made-up word, tricking the other children into purposefully spelling words incorrectly in rebellion.\n\nRating 10: Matilda uses her telekinesis to pretend to be the vengeful ghost of Honey's father, then destroys all the Chokeys and throws Trunchbull out of the school.\n\nRating 3: Honey tells Trunchbull never to return and takes back the keys to her father's house.\n\nRating 10: After Trunchbull runs away, the students openly revolt and destroy Trunchbull's statue.\n\nRating 7: Mr. and Mrs. Wormwood come to take Matilda to Spain with them, but before they can leave Honey pleads with them to let Matilda stay with her.\n\nRating 3: They reluctantly agree to let  Matilda stay who uses her powers to unglue her father's hat.\n\nRating 8: With Miss Honey as the new headmistress, the students rename Crunchem Hall\n\nRating 8: renovate the school with a new playground and a giraffe.\n\nRating 10: When Matilda finishes her story for Mrs. Phelps, she is overjoyed that Matilda's true story has a happy ending, in which Matilda and Miss Honey live happily together."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "US Movies"
    ],
    "id": 81312563,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81312563",
    "index": 1,
    "name": "The SpongeBob Movie: Sponge on the Run",
    "maturity": "U/A 7+ ",
    "duration": "1h 35m",
    "synopsis": "When his best friend Gary is suddenly snatched away, SpongeBob takes Patrick on a madcap mission far beyond Bikini Bottom to save their pink-shelled pal.",
    "year": "2020",
    "spoilers": "\n\nRating 7: In Bikini Bottom, Plankton works on a new plan to steal the Krabby Patty formula while Karen argues that SpongeBob is actually responsible for all his previous failures and not Mr. Krabs.\n\nRating 6: Meanwhile, in Atlantic City, selfish ruler King Poseidon uses up all the slime from his latest sea snail, which is necessary to maintain his appearance.\n\nRating 3: Poseidon decrees the obtaining of a new snail, and Plankton kidnaps SpongeBob's pet snail Gary so that SpongeBob will no longer interfere with his plans.\n\nRating 9: The next morning, SpongeBob learns from Patrick that Gary was taken to Atlantic City.\n\nRating 3: As part of his plan, Plankton offers Otto, a robot built by Sandy, to take them to the city with the hopes that they never return.\n\nRating 10: Without SpongeBob cooking Krabby Patties, the Krusty Krab's enraged customers trash the restaurant despite Mr. Krabs and Squidward's efforts to stop them.\n\nRating 8: Otto drives SpongeBob and Patrick to an old Western town where they meet a tumbleweed spirit named Sage.\n\nRating 10: Sage reveals to SpongeBob and Patrick that they are dreaming, and must overcome a special mission to continue their search.\n\nRating 10: He gives them a \"Challenge Coin\" that will give them bravery to enter into a tavern haunted by ghostly zombie pirates.\n\nRating 3: SpongeBob and Patrick discover that the pirates' souls are trapped by an evil spirit known as \"El Diablo\", and decide to help free them.\n\nRating 10: Diablo traps the duo in his office, where they accidentally disintegrate him.\n\nRating 10: The pirates' souls are freed, and SpongeBob and Patrick are woken up by Otto.\n\nRating 3: Now accompanied by Sage, SpongeBob discovers that as soon as Gary's slime runs out, Poseidon will have him enslaved with the rest of his previous snails.\n\nRating 7: Arriving at Atlantic City, Sage warns the pair not to be distracted by the city's attractions, but they ignore his warnings.\n\nRating 3: After a fun-filled night, SpongeBob and Patrick discover that they have lost the \"Challenge Coin\" that allowed them to be brave, but they nonetheless enter Poseidon's palace.\n\nRating 8: When they try to take Gary, both are arrested and imprisoned in the dungeon.\n\nRating 3: Back in Bikini Bottom, Plankton arrives at the Krusty Krab.\n\nRating 8: Mr. Krabs willingly gives him the formula, feeling depressed without SpongeBob.\n\nRating 9: However, seeing Mr. Krabs so upset makes Plankton feel guilty.\n\nRating 10: Upon finding out that SpongeBob and Patrick will be executed in a luxury show in Poseidon's palace, Mr. Krabs, Squidward, Sandy, and a redeemed Plankton decide to save them.\n\nRating 6: In prison, Sage reveals to SpongeBob and Patrick that the \"Challenge Coin\" never had powers and that the bravery came from themselves.\n\nRating 10: Before SpongeBob is executed, Mr. Krabs, Squidward, Plankton, and Sandy burst into the show to testify in favor of SpongeBob.\n\nRating 10: Along with Patrick, each recounts an experience they had with SpongeBob at a summer camp, earning the audience's gratitude.\n\nRating 7: Afterwards, the group perform a musical number to distract Poseidon and take Gary.\n\nRating 9: Poseidon realizes the distraction and orders his guards to capture the group.\n\nRating 7: SpongeBob and his friends manage to escape the guards and head towards the exit, but are once again cornered when Otto leaves them behind.\n\nRating 5: Poseidon offers to drop charges against the group on the condition that SpongeBob leaves Gary with him.\n\nRating 4: SpongeBob refuses, arguing that his friends decided to rescue him even if they risked death.\n\nRating 5: When Poseidon finds out that he has no friends and reveals that he needs the slime for his appearance, SpongeBob offers to be his friend.\n\nRating 3: Poseidon removes all his arrangements and return to his true appearance.\n\nRating 10: Everyone accepts his appearance, and Poseidon allows SpongeBob to take Gary back home.\n\nRating 8: Poseidon releases all his enslaved snails to accompany them and Bikini Bottom ends up becoming a \"sea snail refuge\"."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "US Movies"
    ],
    "id": 81199142,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81199142",
    "index": 1,
    "name": "The Croods: A New Age",
    "maturity": "U/A 7+ ",
    "duration": "1h 35m",
    "synopsis": "While searching for a new home, the Croods discover a walled-in paradise inhabited by the inventive Betterman family. Then it all goes bananas.",
    "year": "2020",
    "spoilers": "\n\nRating 3: A flashback shows the death of Guy's parents when he was a child.\n\nRating 10: As they drown in tar, they tell him to find somewhere called \"tomorrow\".\n\nRating 10: He goes on a long journey and meets a young Belt before taking him along for the ride.\n\nRating 10: This eventually leads up to events of meeting Eep and her family.\n\nRating 8: The Croods, along with Guy and their pets Chunky and Douglas, are still searching for a place to settle down, all the while surviving many dangerous creatures along the way.\n\nRating 10: Grug is repeatedly annoyed at Eep and Guy's blossoming romance, fearing they may separate from the rest of the pack.\n\nRating 4: This fear intensifies after Guy proposes to Eep that they find their own \"tomorrow\" without the rest of the Croods.\n\nRating 10: As Grug walks off in anger, he soon comes across a giant wall and leads the whole pack to it.\n\nRating 10: On the other side lays an idyllic paradise-like land rich in agriculture that the Croods quickly become enamored with.\n\nRating 3: However, they are soon caught in a net and are released by the owners of the land, a couple called Phil and Hope Betterman, who were best friends with Guy's parents before their deaths and Guy's disappearance.\n\nRating 10: The Bettermans welcome the Croods to their giant tree-home as house guests, where they meet their daughter and Guy's old friend, Dawn, who immediately befriends Eep.\n\nRating 10: Life with the Bettermans becomes degrading for Grug as the Bettermans soon reveal themselves to be technologically advanced, better-mannered, and visibly condescending toward the Croods.\n\nRating 8: Believing that Guy is better off with them, they hatch a scheme to get Guy to leave the Croods.\n\nRating 5: Phil eventually takes Grug to his secret man-cave, a sauna-like place behind some waterfalls, where he manipulates him into believing Guy should leave their pack in exchange for Eep staying with her family.\n\nRating 10: Meanwhile, Hope angers Ugga by insulting her family's lifestyle and attempts to manipulate her like Phil, but fails, thus leading to Ugga and Grug's decision to leave.\n\nRating 3: Sometime after this, Eep discovers that Dawn has never left the inside of the wall.\n\nRating 8: Relating this to the solitude she faced in her cave, Eep convinces Dawn to use Chunky to escape the land and jump their wall for a joyride that ends with a bee stinging Dawn and having her hand swell up.\n\nRating 10: When Eep takes her back home, Guy, upon finding out, scolds her for her recklessness, ending with him insensitively calling her a \"cave-girl\".\n\nRating 8: At dinner, tensions rise between the parents as well as Guy and Eep, especially when Dawn's swelling is revealed, culminating in Grug accidentally revealing his and Phil's deal.\n\nRating 7: Having had enough, the Croods decide to leave in the morning, but Guy decides to stay after he and Eep have a falling out.\n\nRating 3: Soon, the land is attacked by Punch Monkeys, monkeys with human-like strength, on account of Grug and Ugga eating a bunch of bananas the Bettermans hoard around their land and have forbidden Grug from eating.\n\nRating 6: Phil reveals he sends the Punch Monkeys the bananas every day so that they leave the Bettermans alone and since Grug and Ugga ate them, the Punch Monkeys become upset and kidnap Grug, Phil, and Guy and take them to their homeland.\n\nRating 8: As the men are taken, the remaining Croods and Bettermans leave to rescue the men, but eventually get marooned on an island full of Wolf-Spiders, wolves with the characteristics of arachnids.\n\nRating 8: During their time together, Hope finally snaps, lashing out on the Croods and running off.\n\nRating 6: However, during an encounter with the Wolf-Spiders, she learns the error of her ways and accepts the Croods.\n\nRating 3: When they learn the location of the men, they name themselves \"The Thunder Sisters\", after a female-exclusive clan Gran was in when she was younger.\n\nRating 10: At the Punch Monkey home, Grug, Guy and Phil soon discover that Phil's diversion of a river to irrigate his farm unknowingly deprived the Punch Monkeys of their water supply and that the Punch Monkeys need the bananas not only to eat, but to offer to a large primate monster called the Spiny Mandrilla in hopes of appeasing it.\n\nRating 10: The Punch Monkeys make Grug and Phil fight gladiator-style to see who will be the sacrifice and when they wear each other out, they exchange their bitter feelings with each other, making Guy regret what he said during his and Eep's fallout.\n\nRating 8: Soon, the Punch Monkeys dress all three men as bananas to sacrifice to the giant Spiny Mandrilla.\n\nRating 10: Grug and Phil apologize for their poor behavior, and for putting pressure on Guy, but just as they are about to be eaten, the Thunder Sisters show up to rescue them.\n\nRating 3: A long and perilous battle ends with Guy and Eep on a giant skull-chandelier where they reconcile and use it to defeat the Spiny Mandrilla by using fire to sever the ropes and send the skull falling into the abyss below.\n\nRating 8: The Spiny Mandrilla climbs back out of the depths and grabs Eep by her \"peanut toe\", which she uses as a prosthetic phalange, and pulls it off, sending the monster plummeting to its death and allowing the families to escape the work.\n\nRating 10: With their differences finally settled, the Bettermans allow the Croods to live in their land as neighbors, with Guy realizing that Eep is his \"tomorrow\".\n\nRating 8: Guy and Eep soon move into one of the Bettermans’ bedrooms together, which Grug approves of, and the Punch Monkeys become their next door neighbors."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "Movies Based on Books",
        "US Movies"
    ],
    "id": 28631029,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/28631029",
    "index": 1,
    "name": "Stuart Little",
    "maturity": "U/A 7+ ",
    "duration": "1h 24m",
    "synopsis": "When his parents adopt a mouse instead of a little boy, George realizes brothers come in all shapes and sizes. But Snowbell the cat is not so welcoming.",
    "year": "1999",
    "spoilers": "\n\nRating 10: Frederick and Eleanor Little are a happily married couple living in New York City, intending to adopt a younger brother for their son, George.\n\nRating 7: When they visit the orphanage, they meet a young anthropomorphic mouse named Stuart and, despite the head of the orphanage Mrs. Keeper's initial objections, choose him instead.\n\nRating 10: Upon returning home, Stuart struggles to fit in; George is disappointed and refuses to acknowledge Stuart as his brother, and the family cat, Snowbell, is disgusted at the fact that he is now a pet to a mouse.\n\nRating 10: Eleanor then goes on to accidentally trap Stuart in the washing machine one morning after a load of laundry.\n\nRating 10: She rescues Stuart from swallowing too much detergent, but Stuart becomes ill as he coughs up soap bubbles.\n\nRating 7: Stuart then recovers after a visit from Dr. Beechwood.\n\nRating 8: After Stuart admits to the Littles that he feels an empty space inside him, they meet with Mrs. Keeper to find out some information about Stuart's real parents, but are told nothing due to confidentiality.\n\nRating 10: As time goes by, George and Stuart start to bond after Stuart encourages him to finish making his model boat for an upcoming race.\n\nRating 5: Meanwhile, Snowbell and his friend Monty host a meeting with a rogue alley cat named Smokey and hatch a plan to have Stuart removed from the household.\n\nRating 10: On the day of the race, Stuart accidentally breaks George's remote control, rendering his boat inoperable.\n\nRating 10: He jumps in and takes control of it himself, narrowly avoiding a crash on the water and subsequently winning the race.\n\nRating 3: Later that night while celebrating, they are interrupted by a mouse couple who arrive at the house; they introduce themselves as Reggie and Camille Stout, and claim to be Stuart's biological parents who were forced to give him up due to poverty.\n\nRating 8: The Littles reluctantly agree to allow Stuart to leave with the Stouts, leaving George forlorn.\n\nRating 8: The orphanage contacts the Littles to ask how Stuart is doing, and when Frederick and Eleanor explain he has gone home with his real parents, Mrs. Keeper informs them that Stuart's real parents died several years earlier when a canned food pyramid fell on them in a supermarket, hence why he was put up for adoption to begin with.\n\nRating 8: Realizing Stuart has been kidnapped , the family organizes a huge search party around the city.\n\nRating 8: Fearing that his involvement in the deception will be exposed, Snowbell informs Smokey that the Littles have found out about the Stouts, so Smokey decides Stuart must be killed instead.\n\nRating 8: Filled with remorse due to Stuart's overwhelming sadness, Reggie and Camille tell him the truth and order him to run away for his own safety; he is delighted to hear he is not a Stout and makes his way back to the Little house.\n\nRating 10: On the way through the park, he is ambushed by Smokey and his gang but manages to evade them by going into a sewer.\n\nRating 10: He makes it home, greeted by a jealous Snowbell who tells him the family are out celebrating his absence.\n\nRating 10: Heartbroken, Stuart leaves.\n\nRating 3: In Central Park, he stops to rest for the night in a birds' nest, and is later found by a remorseful Snowbell, who admits he lied and encourages him to come home.\n\nRating 3: When the pair are confronted by the other cats, Snowbell refuses to hand Stuart over and the cats give chase.\n\nRating 3: They eventually corner Stuart as he hangs from a tree branch over a pond of cold water; Snowbell saves him by breaking the branch the cats are on, sending Monty and the others plummeting into the pond below, which they quickly swim out of.\n\nRating 3: Smokey sneaks up behind Snowbell to kill him but before he can do so, Stuart intervenes by releasing a thin branch that hits Smokey in the face, which also sends him plunging into the pond.\n\nRating 6: Smokey swims and climbs out of the pond, furious and humiliated at being defeated by a \"mouse and his pet cat\", and wonders what could be worse.\n\nRating 8: His question is answered when he is suddenly attacked by two stray dogs, who presumably kill him.\n\nRating 10: Snowbell takes Stuart home, just as the Littles are getting ready for bed.\n\nRating 10: George spots Stuart through the front window and everyone is happily reunited.\n\nRating 3: When Frederick asks how he made it back, he tells them he owes his life to Snowbell, who has finally realized Stuart truly is family."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "Movies Based on Books",
        "US Movies"
    ],
    "id": 70021648,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70021648",
    "index": 1,
    "name": "Charlie and the Chocolate Factory",
    "maturity": "U/A 7+ ",
    "duration": "1h 54m",
    "synopsis": "The eccentric Willy Wonka opens the doors of his candy factory to five lucky kids who learn the secrets behind his amazing confections.",
    "year": "2005",
    "spoilers": "\n\nRating 10: Charlie Bucket is a kind and loving boy who lives in poverty with his family near the Wonka Factory.\n\nRating 10: The company's owner, Willy Wonka, has long closed his factory to the public due to problems concerning industrial espionage, which also caused all his employees, including Charlie's Grandpa Joe, to lose their jobs.\n\nRating 10: Charlie's father, meanwhile, has more recently been laid off from his own job at a toothpaste factory, although he does not admit this to Charlie.\n\nRating 8: One day, Wonka announces a contest in which Golden Tickets have been placed in five random Wonka Bars worldwide, and the winners will receive a full tour of the factory as well as a lifetime supply of chocolate, while one will receive an additional prize at the end of the tour.\n\nRating 8: Wonka's sales subsequently skyrocket, and the first four tickets are found by the gluttonous Augustus Gloop, the spoiled Veruca Salt, the arrogant Violet Beauregarde, and the ill-tempered Mike Teavee.\n\nRating 10: Charlie tries twice to find a ticket, but both bars come up empty.\n\nRating 8: After overhearing that the final ticket was found in Russia, Charlie finds a banknote and purchases a third Wonka Bar.\n\nRating 8: The Russian ticket is revealed to be a forgery just as Charlie discovers the real ticket inside the wrapper.\n\nRating 3: He receives monetary offers for the ticket, but the cashier warns him not to trade it regardless, and Charlie runs back home.\n\nRating 9: At home, Charlie initially wants to trade the ticket for money for his family's betterment, but after a pep talk from Grandpa George, he decides to keep it and brings Grandpa Joe to accompany him on the tour.\n\nRating 10: Charlie and the other ticket holders are greeted outside the factory by Wonka, who then leads them into the facility.\n\nRating 10: Individual character flaws cause the other four children to give in to temptation, resulting in their elimination from the tour while Wonka's new employees, the Oompa-Loompas, sing a song of morality after each.\n\nRating 8: Meanwhile, Wonka reminisces on his troubled past and how his dentist father, Wilbur, strictly forbade him from consuming any candy.\n\nRating 3: After sneaking a piece of candy, Wonka instantly became hooked and ran away from home to follow his dreams.\n\nRating 10: When he returned, however, both his father and their house were gone.\n\nRating 7: After the tour, the four eliminated children leave the factory with an exaggerated characteristic or deformity related to their elimination while Charlie learns that Wonka, now approaching retirement, intended to find a worthy heir.\n\nRating 8: Since Charlie was the least ill-behaved of the five, Wonka invites Charlie to come live and work in the factory with him, provided that he leave his family behind.\n\nRating 10: Charlie declines, as his family is the most important thing in his life.\n\nRating 10: As Charlie and his family's life improve, Wonka becomes despondent, causing his company and sales to decline.\n\nRating 10: He eventually turns to Charlie for advice, and he decides to help Wonka reconcile with his estranged father, Wilbur.\n\nRating 10: During the reunion, Charlie notices newspaper clippings of Wonka's success which Wilbur collected, while Wonka realizes the value of family as he and Wilbur finally reconcile.\n\nRating 10: Afterwards, Wonka allows Charlie and his family to move into the factory together."
},{
    "genre": "Kids",
    "related-genre": [
        "Children & Family Movies",
        "Comedies"
    ],
    "id": 81381727,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81381727",
    "index": 1,
    "name": "Jungle Beat: The Movie",
    "maturity": "U/A 7+ ",
    "duration": "1h 29m",
    "synopsis": "When a lost and lonely alien crash-lands on Earth, his new crew of talking animal friends helps him get back home — and try to save the world!",
    "year": "2021",
    "spoilers": "\n\nRating 10: In a jungle isolated in the African plains, live a group of animals including Munki the bold, adventurous ape, Trunk, the big-hearted elephant, Rocky, the dog-like rhino, Tallbert, the earnest and awkward giraffe, Humph, the grumpy hedgehog who is very protective over his property, Ribbert, the lazy frog, a female ostrich and her three unhatched chicks that always try to escape, and Ray the firefly.\n\nRating 10: One morning, Munki and Trunk wake up to discover that they can speak, which they take advantage of.\n\nRating 10: They learn that the source of them talking is an jello-like, four-legged alien named Fneep, who has come from the planet Scaldron to conquer Earth and has brought some amazing technology with him, including a translation device called a speech pod that lets the animals talk for the first time that Munki tries on the others.\n\nRating 10: The animals make him give in easily and allow themselves to surrender peacefully, making Fneep's conquest a success.\n\nRating 7: They learn from Fneep that his ship crashed near the mountains, and since he's conquered Earth, he can use the homing beacon in his ship that summons the Scaldronians instantly.\n\nRating 10: Munki, Trunk, Rocky, and Humph agree to come with him on the way to Fneep's ship.\n\nRating 10: While crossing the plains, they meet a group of singing wildebeest, whose leader misbelieves that Fneep may become the new leader due to the fact that he's conquered Earth and tries to keep his position, but Fneep manages to outdo him, and tells him that the herd are great at what they do and that only reason they follow him is that they love what he does.\n\nRating 10: Resolved, the leader allows them to pass.\n\nRating 9: One of the ostrich eggs tries to follow them and is almost run over by a wildebeest stampede, hatching in the process.\n\nRating 3: Once out of the egg, she believes that since she is a bird, she can also fly, and tries to, but to no avail.\n\nRating 10: After witnessing the mother ostrich hugging the baby ostrich, he learns that hugs are for making someone feel better, knowing he/she isn't alone, saying \"I love you\", and to feel special.\n\nRating 3: They learn from Fneep that the only way for Scaldronians to feel special is to conquer planets, which prove that they're strong and worthy of respect, and that he's a terrible conqueror due to not conquering any planets until now.\n\nRating 3: Munki, Trunk, and Rocky tell that it doesn't matter if he hasn't conquered any planets and try to give him hugs, but he refuses.\n\nRating 8: Meanwhile, Humph, who had gone farther than the others, finds Fneep's ship and accidentally jumpstarts the ship by making a hole in the hull after ramming it several times and touches the exposed wire with his tongue after being lured by the spark's bright light, which electrocutes him and elongates his spikes.\n\nRating 3: He learns from a hologram from Fneep's father, Captain Grogon, that Fneep's next step in conquering Earth is to capture all the Earth creatures and imprison them in the Scaldronian museum, the Great Hall Of Conquest, and sets off to rejoin and warn the others.\n\nRating 8: Later that night, Fneep goes to the ship all by himself and after getting back into his ship, a long 60-step reading of the Planet Conquering Manual of how to activate the homing beacon, which is fact, just a simple red button for just 60 steps, pushes the beacon, and Grogon's ship arrives instantly above him.\n\nRating 6: Despite Humph's pleas and the fact that they're out of the translator's range meaning they can't understand him, the gang eventually reach Fneep's impact site, where he's greeted by Grogon and learn that Fneep lied about conquering Earth.\n\nRating 8: Grogon takes advantage of this to get his 1000th victory, but he stops him by lying that the animals are invincible and unstoppable, making the gang safe for now.\n\nRating 10: Fneep is forced to leave Earth and conquer another one instead, but Munki, Trunk, Rocky, and Humph, refusing to believe what Fneep said, sneak aboard on one of the transporters and tell that Fneep still actually conquered the planet, but they learn from Grogon that the only way to show that the planet is conquered is by using a constellation-creating device into the sky and tries to use his own, but Munki stops him and tries to buy time while Trunk, who fell to the ground with Fneep's star after blasting a hole in the ship with Grogon's gun, which is later blocked by a piece, assigns the baby ostrich to get Fneep's star on board the ship by manually using her trunk to make her fly.\n\nRating 10: However, after a long battle, Grogon overpowers them all, prevents Fneep from using his star by restraining him and shoots his star into the sky, but Fneep proclaims even though his star's in the sky, he hasn't conquered the animals yet due to their \"secret weapon\", which is, in fact, hugs, which he uses to confront his dad, and makes him and himself to turn orange, filling him with happiness and joy.\n\nRating 10: After this, they try to do this to the other Scaldronians, which results in the ship about to crash, but the baby ostrich takes control and saves everyone.\n\nRating 10: Eventually, all the other Scaldronians are all effected by the hugs, and Grogon declaims the earth and allows Fneep to claim it.\n\nRating 8: Grogon and Fneep plan to return home to use the hugs on every Scaldronian and repay the group by giving them the speech pods, some of the Scaldronian tech, and a load of giant bananas for Munki to satisfy his hunger.\n\nRating 3: In the post-credits scenes, Grogon discovers that Ribbert has eaten his gun after eating Fneep's, Tallbert is seen talking in Shona language with the translation device Trunk and the mama ostrich use on him, and Munki, in a protective suit made of vines, finally manages to give Humph a hug."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "Movies Based on Books",
        "US Movies"
    ],
    "id": 70033005,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70033005",
    "index": 1,
    "name": "Matilda",
    "maturity": "U/A 7+ ",
    "duration": "1h 38m",
    "synopsis": "Cursed with a cruel school principal and parents, a little girl discovers her hidden powers -- which she uses to stand up to the bullies in her life.",
    "year": "1996",
    "spoilers": "\n\nRating 8: Young genius Matilda Wormwood is mistreated by her father Harry, a used car salesman; her mother Zinnia; and her older brother Michael.\n\nRating 10: Smart and independent, she finds solace in the fictional worlds of books at the public library.\n\nRating 8: When Matilda's parents refuse to enroll her in school, she puts hydrogen peroxide  in her father's hair tonic, and puts Super Glue on his hat.\n\nRating 10: Harry catches Matilda reading Moby-Dick, rips it up, and forces her to watch television.\n\nRating 10: Matilda becomes increasingly enraged until the television explodes out of nowhere.\n\nRating 7: Harry sells a car to Miss Agatha Trunchbull, the tyrannical principal of Crunchem Hall Elementary School, in exchange for admitting Matilda as a student.\n\nRating 6: Upon her first day, Matilda meets a girl named Hortensia, who warns her about the headmistress's ways and watches Miss Trunchbull in horror as she swings a girl named Amanda Tripp around and hammer throw her over an iron fence and into a field of flowers.\n\nRating 5: Matilda's teacher, Miss Jennifer Honey, who notices the ease with which Matilda answers middle school multiplication questions, requests that Matilda be moved to a higher class, but Trunchbull refuses and proceeds to tell Miss Honey if she cannot handle Matilda herself, that Ms. Trunchbull would lock her in the chokey.\n\nRating 10: The Wormwoods are not interested either and disrespectfully kick her out of their house one night when Miss Honey came for a visit.\n\nRating 7: Matilda discovers her father is under surveillance by the Federal Bureau of Investigation/FBI over his illegal dealings of car parts.\n\nRating 10: Her parents refuse to believe her as Zinnia flirts with the two agents whom she believes are speedboat salesmen.\n\nRating 10: After discovering the car Mr. Wormwood sold her was faulty, Trunchbull locks Matilda in 'the Chokey', a small cramped cupboard resembling an iron maiden, as punishment with broken glass and nails sticking out of it.\n\nRating 8: While she waits to be let out, her friend Lavender puts a newt in Trunchbull's water jug.\n\nRating 3: Trunchbull accuses Matilda, who, in anger at the injustice, mysteriously tips the glass over, splashing the newt onto Trunchbull.\n\nRating 10: Matilda is unable to reproduce her powers to Miss Honey during a test.\n\nRating 10: Miss Honey invites Matilda over to her house for tea after school and lets her in on a secret: her mother died when she was two, and her father Magnus invited his wife's stepsister, Trunchbull, to live with them and look after her, but Trunchbull abused her.\n\nRating 10: Magnus died, apparently by suicide, three years later, supposedly leaving everything in his Will and testament to Trunchbull, who Miss Honey suspects murdered him.\n\nRating 10: Matilda and Miss Honey sneak into Trunchbull's house to retrieve some of Miss Honey's belongings, but narrowly escape when Trunchbull unexpectedly returns early due to her car acting up.\n\nRating 7: Matilda practices her telekinetic powers and thwarts the FBI agents to buy Harry time to come to his senses.\n\nRating 6: She returns to Trunchbull's house on a very windy night and attempts to scare her out of it but Trunchbull becomes aware of Matilda's visiting upon finding her red hair ribbon which blew onto her car's antenna.\n\nRating 8: The next day, Matilda reveals her powers to Miss Honey but Trunchbull visits the class to make Matilda confess.\n\nRating 10: Matilda telekinetically writes a message on the blackboard, posing as the vengeful spirit of Magnus  and accusing Trunchbull of murdering him.\n\nRating 7: Trunchbull attacks students at random in a rage, but Matilda protects them and the student body, both junior and senior, throw lunches at her as she is ran out the school for good.\n\nRating 3: Miss Honey moves back into her house.\n\nHarry, Zinnia, and Michael come to Miss Honey's house to collect Matilda and flee to Guam to avoid the FBI.\n\nRating 10: Matilda refuses to go, saying she would rather be adopted by Miss Honey.\n\nRating 8: Her parents are initially reluctant but her mother apologizes for never understanding her only daughter.\n\nRating 10: Desperate to leave, the parents sign the adoption papers that Matilda copied from a library book and Matilda lives happily with Miss Honey, who becomes the principal of Crunchem Hall, which they ended up having to add an upper school because children never wanted to leave."
},{
    "genre": "Drama",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Hindi-Language Movies",
        "Dramas",
        "Comedies"
    ],
    "id": 70139072,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70139072",
    "index": 1,
    "name": "Chillar Party",
    "maturity": "U/A 7+ ",
    "duration": "2h 6m",
    "synopsis": "Eight feisty boys befriend young drifter Fatka. When a mean politician threatens Fatka's way of life, the boys band together in honor of their pal.",
    "year": "2011",
    "spoilers": "\n\nRating 10: Eight innocent but feisty kids lead carefree lives in Chandan Nagar, a colony in Mumbai, where each has his own identity and a nickname based on these qualities.\n\nRating 10: Not only that, but their whole team has a nickname that has earned them significant notoriety.\n\nRating 8: They explain that they have mainly two enemies - the 'oversized' neighbouring cricket team to whom they always lose, and a dog they named \"Loose Motion\" since she dirties their cricket pitch, so they develop an enmity against dogs.\n\nRating 9: Their hopes are shattered shortly after a boy, Fatka, who was employed for washing the cars of the society, enters with his dog Bhidu.\n\nRating 10: They do everything to throw the boy and his dog out, but become unsuccessful.\n\nRating 10: Eventually they develop a friendship with each other as Fatka helps them by serving as the lead bowler during the match with the neighbouring cricket team.\n\nRating 8: During this time, they also start interacting with a young girl who moves in, and an unemployed youngster who becomes successful after Fatka helps him out.\n\nRating 7: But their happiness is short-lived when a reckless politician, welfare minister Shashikant Bhide, enters their life after his personal secretary Dubey is attacked by Bhidu for hurting Fatka.\n\nRating 10: Bhide announces in a news telecast that all the stray dogs roaming about in residential buildings in Mumbai will be caught and terminated, misleading audiences with a concern for public safety.\n\nRating 10: He further informs that the dog can only be saved if the society files a No Objection Certificate within 1 month.\n\nRating 7: The kids, shocked by this, strive hard to get the NOC, wherein they have to get at least more than 50% votes of the total residents in the society i.e. 31 votes.\n\nRating 7: But they manage only 10 votes after 15 days.\n\nRating 8: With more efforts gone in vain, the kids finally organize a march across the streets purely in underwears.\n\nRating 10: This gains them enough traction to pull 10 more votes.\n\nRating 8: With more hard work and awareness they manage to get another 10 votes counting a total of 30 votes.\n\nRating 7: With only a day left for the deadline as declared by Bhide, they approach secretary L.N. Tandon, who is close to Bhide and has resented the kids all this while.\n\nRating 3: Whilst all this chaos is going on, a TV channel invites Bhide and the kids for face-off.\n\nRating 8: Seeing this as their last chance, they attend the interview which is being telecast across India.\n\nRating 8: Knowing that that is the last day and dog catchers are after Bhidu, they pray hard to save him.\n\nRating 3: During the interview they are constantly mocked by Bhide who questions their education and upbringing, but it soon takes a turn and culminates in the kids answering Bhide back with their moral education responses.\n\nRating 10: Having won, the kids plead to leave after a moving speech by Fatka, and the interviewers agree.\n\nRating 7: When they reach the society, they are disheartened as there is no sight of Bhidu.\n\nRating 3: Suddenly, Bhidu comes jumping in, wearing a collar reading \"Bhidu- Chandan Nagar Society\".\n\nRating 10: While they are happy seeing Baidu, they realize Tandon changed his mind after the face-off; he too is happy and seen cheering for them."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "US Movies"
    ],
    "id": 81023618,
    "tag": "Kids & Family Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81023618",
    "index": 1,
    "name": "Finding ‘Ohana",
    "maturity": "U/A 7+ ",
    "duration": "2h 3m",
    "synopsis": "On Oʻahu for the summer, two siblings from Brooklyn connect with their Hawaiian heritage — and their family — on a daring quest for long-lost treasure.",
    "year": "2021",
    "spoilers": "\n\nRating 6: New York–raised Hawaiian siblings Pili and Ioane \"E\" temporarily relocate from New York to Oahu with their mother Leilani to help her father, Kimo, whose health and financial issues are becoming serious.\n\nRating 10: Pili is an avid geocaching fan, and her malaise at being separated from her beloved New York is assuaged by secretly liberating an old diary from her grandfather's art studio.\n\nRating 10: Meanwhile, E is distracted from his own search for better Internet signal by the requisite pretty local girl, Hana, who has big dreams of her own.\n\nRating 10: The siblings find themselves learning about their Hawaiian heritage as Pili goes on a Goonies-style quest for lost pirate treasure.\n\nRating 10: Pili is aided on her quest by local boy Casper, a nerdy but resourceful boy with a big heart, and joined by E and Hana."
}]