[{
    "genre": "Comedies",
    "related-genre": [
        "Comedies",
        "Horror Movies"
    ],
    "id": 81632774,
    "tag": "Tamil-Language Movies",
    "image": "https://occ-0-2218-6.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABZYY_LlUBn1bBg7ApUm04Ec3K7VhT7aGC15Sa8FGp3idd0aADWkv8W2Xv3M8Jba2dsgETXwGmcIfLtavHZwEtA0oVyvHT7DAQJ0.jpg?r=847",
    "source": "https://www.netflix.com/in/title/81632774",
    "index": 81,
    "name": "Katteri",
    "maturity": "U/A 13+ ",
    "duration": "1h 52m",
    "synopsis": "A group of bungling crooks heads to a deserted village to seek out hidden treasure — but aren't prepared for the gaggle of ghosts they encounter inside.",
    "year": "2022",
    "spoilers": "\n\nRating 8: The film begins with a 1968 local village festival.\n\nRating 8: One person cuts an electric post, another person comes and pushes down the post, and the electric wire rips all of the village people.\n\nRating 8: And then the film is set in 2019.\n\nRating 6: Gajja, Kaliyurunda, and Sankar, a group of kidnappers, kidnap Kamini and bring her to Naina.\n\nRating 8: Naina orders his henchmen to kill the kidnappers so they can't tell anyone about it.\n\nRating 5: The kidnappers escape from the henchmen and come to Kiran's first night room and tell them about the kidnap and Naina's plan to ask for a huge ransom from Kamini's family.\n\nRating 3: Shwetha instructs them to kidnap Kamini from the henchmen and demand a large ransom.\n\nRating 3: As per her instruction, Kiran and his friends kidnap Kamini and ask her about Maanga Mani.\n\nRating 10: Kamini tells them about him.\n\nRating 3: He was taking a treatment from her, and a few weeks ago, he said he was about to go on a treasure hunt for gold.\n\nRating 3: Shwetha finds Maanga Mani's location by entering his number on Truecaller.\n\nRating 9: They went to the same location that was shown on Truecaller.\n\nRating 3: The village's name is Kolaatipuram.\n\nRating 3: When they enter the village, the behavior of the villagers is weird, and they realize that the villagers are ghosts.\n\nRating 3: They are the people who died in 1968.\n\nRating 10: After knowing that the villagers are ghosts, they try to elope from the village, but they can't escape from the village.\n\nRating 10: Wherever they run, they end up in the festival area.\n\nRating 6: And Kamini tells them that Sankar was taken by a ghost, Mathamma, who asked her, \"Am I beautiful?\"\n\nRating 10: Shwetha instructs them to meet Maathamma and correctly answer questions in order to obtain the gold.\n\nRating 3: So they walked to the place of Mathamma.\n\nRating 10: Shwetha ran away after seeing Mathamma, and Kiran and his friends got beaten by Mathamma.\n\nRating 10: Mathamma tells her story, which happened in 1968.\n\nRating 3: She, her sister Mohini, and her uncle Venu were living in the same house.\n\nRating 3: Venu tells Sambath to dig a well at the back of their house and orders Mohini to help him.\n\nRating 10: While digging the well, the land slides and the well becomes too deep.\n\nRating 10: Sambath gets out of the well with the help of Mohini and Mathamma.\n\nRating 8: He requests that they bring a lamp to measure the depth of the well.\n\nRating 7: They tied a rope around the lamp and put the lamp into the well.\n\nRating 10: When they pulled up the rope, the lamp was missing, but a mud pot was tied with the rope.\n\nRating 6: When they opened the mud pot, the pot was filled with gold jewels.\n\nRating 8: By seeing this, Sambath tells them he is going to buy more lamps to get more gold.\n\nRating 8: After Sambath leaves, they discover a piece of paper with the words, \"If you have anything else, send it to me.\"\n\nRating 10: So they took a chicken and threw it down the well, and this time they got a large mud pot filled with gold and a piece of paper that said, \"If you have anything else, send it to me.\"\n\nRating 10: Sambath came back with a lot of lamps, and he put all of those lamps into the well, but when he pulled the rope, all of those lamps were damaged.\n\nRating 8: When he saw those damaged lamps, he got angry and took an aruval and entered the well tied up with a rope.\n\nRating 10: When Mathamma and Mohini pulled the rope, a big wooden barrel appeared with a paper written with \"Keep sending this to me\".\n\nRating 10: By seeing the paper, they send their drunkard uncle Venu into the well.\n\nRating 6: They understood that the well needed human flesh.\n\nRating 8: So they ask Aarumugam, a police officer, for dead bodies.\n\nRating 6: He also gave them some dead bodies.\n\nRating 10: One night, he enters the house of Mathamma and sees a lot of gold.\n\nRating 10: At that time, Kaatteri came out of the well and ate one of the policemen and wrote on the wall, \"Do not starve the well.\"\n\nRating 10: By knowing this, he planned to kill all of the villagers and feed the Kaatteri.\n\nRating 3: During the festival, he cuts the electric post and the wire rips the people.\n\nRating 8: They put all of the dead bodies into the well.\n\nRating 8: He also pushed Mohini and Mathamma into the well.\n\nRating 8: Mathamma's story ends, and she asks Kiran, \"Tell me now, which part of my story was a fact and which was fiction.\"\n\nRating 8: Suddenly, Kamini behaves abnormally, and her face changes to Mohini's.\n\nRating 3: Ponnambalam comes to the house and asks Kiran to burn Kamini.\n\nRating 8: Kiran burns her, and Ponnambalam captures the ghost of Mohini.\n\nRating 3: When Kaatteri comes to kill them, they try to manage and save their lives.\n\nRating 3: By luck, they managed that night, and then Ponnambalam tried to kill Kiran while running after him.\n\nRating 10: He fell down and shot himself in the chest and died.\n\nRating 8: Kiran took the bottle that has Mohini's ghost in it and gave it to Naina.\n\nRating 3: Naina opens it, and he gets frightened by seeing the ghost.\n\nRating 8: In bed, Kiran asks Shwetha about how she knows that Aarumugam is Naina, and Shwetha asks Kiran 'am I beautiful '?"
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Dramas",
        "Action & Adventure"
    ],
    "id": 81417659,
    "tag": "Tamil-Language Movies",
    "image": "https://occ-0-2218-6.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABSI-XLS9JFd62UOA6PVjEOQ4xUMn7VJBcR4IujSUEtc0P5FjMh3VksbTut3Lgxmry_Yj3MUGYx4uOnKxWyX7BWLRpwMfRpVMyL7Xjqa70uC2xev5swRJVr0TZBiLNdk1GlBq.jpg?r=0a3",
    "source": "https://www.netflix.com/in/title/81417659",
    "index": 82,
    "name": "Jagame Thandhiram",
    "maturity": "A ",
    "duration": "2h 38m",
    "synopsis": "When a clever, carefree gangster is recruited to help an overseas crime lord take down a rival, he is caught off guard by the moral dilemmas that follow.",
    "year": "2021",
    "spoilers": "\n\nRating 3: Suruli is a gangster from Madurai who runs a parotta restaurant.\n\nRating 10: Due to his thug-like behaviour, he is unable to find a bride and even when his marriage is fixed, the bride runs away when she finds out about his criminal background.\n\nRating 8: His notoriety comes to the attention of an Englishman named John, who is a right-hand man of a London-based white supremacist don named Peter Sprott.\n\nRating 3: John offers £200,000 per week to Suruli if he works for Peter against a rival don Sivadoss, who is Peter's arch-nemesis and has considerable influence among London's Tamil-speaking population.\n\nRating 8: Suruli accepts the offer with the intention to use the money to eventually settle down and give up his criminal activities, and leaves for London where he learns more about Sivadoss and his gang as well as their activities which involve smuggling weapons from conflict-ridden countries in exchange for money.\n\nRating 3: Peter's gang, led by Suruli and John, raid Sivadoss's boat yard where the smuggling is in process under Sivadoss's right-hand man Rajan.\n\nRating 8: During the raid, Suruli kills Rajan as well.\n\nRating 3: Sivadoss and his gang realise that Suruli is responsible for killing Rajan and kidnap him.\n\nRating 8: Suruli and Sivadoss negotiate to kill Peter under the ruse of inviting him for a \"peace talk\" to end their feud, in exchange for £600,000 as well as a parotta restaurant in London, but during the \"peace talk\", Suruli betrays Sivadoss and hands over an aruval to Peter, who uses it to hack Sivadoss to death.\n\nRating 10: As a reward for Sivadoss's death, Peter offers Suruli a designated area in London to start his business and allow Tamils to live there, and christens the area Little Madurai.\n\nRating 10: Meanwhile, Suruli falls in love with Attila, a Sri Lankan Tamil singer.\n\nRating 7: When he initially approaches Attila, she reveals that she is a widow with a seven-year-old son named Dheeran.\n\nRating 3: However, she soon reciprocates Suruli's feelings.\n\nRating 7: While on a date at a park, they are attacked by Sivadoss's remaining henchmen Deepan and Dharani, who have sworn to take revenge on Suruli for betraying and helping Peter to kill Sivadoss.\n\nRating 8: Deepan shoots Suruli, leaving him critically wounded.\n\nRating 8: However, he soon manages to recover under Attila's care.\n\nRating 4: But one day, he captures her after she injects a mysterious drug into his drip bag with the intention to kill him.\n\nRating 3: When confronted, Attila reveals why she wants to kill him.\n\nRating 3: Attila, Dheeran and Attila's brother are the only survivors of an aerial attack on their village in Sri Lanka during the Sri Lankan Civil War.\n\nRating 3: It is also revealed that Dheeran is not Attila's son, but her brother's son.\n\nRating 8: At a refugee camp, they are convinced by Sivadoss's aide to join Sivadoss's gang, who would help them move to London under the guise of husband, wife and child and are offered fake passports.\n\nRating 10: On the way, Attila's brother is caught and thrown into Peter's private prison, which is used to hold refugees and illegal immigrants, but Attila and Dheeran safely make it to London.\n\nRating 8: Attila further reveals that Sivadoss was involved in smuggling with the intention to use the money to help the illegal immigrants and refugees from all countries financially and legally, and was planning to fight for her brother's release as well.\n\nRating 9: Sivadoss, on hearing about Suruli's love for Attila, decided to offer him protection and get him married to Attila.\n\nRating 10: But due to Sivadoss's death, the money to fight for the immigrants' rights had dried up, and Attila's brother has no chance of being released from prison as a result.\n\nRating 10: Hence, Attila had planned the encounter in the park between Suruli, Deepan and Dharani with the intention to kill Suruli, but she still saved him due to her love for him.\n\nRating 3: Suruli also learns about a bill pending in the British parliament called BICORE, whose purpose is for restricting immigration and is being pushed by Peter and a few other lawmakers.\n\nRating 6: If passed, most of the refugees and illegal immigrants would be deported or thrown into prisons, which would benefit Peter.\n\nRating 10: On hearing this, Suruli has a change of heart and decides to help Attila, Deepan and Dharani in their fight against Peter and BICORE.\n\nRating 7: With the help of Deepan and Dharani, he manages to recover the money which Sivadoss had acquired for the immigrants, and this money is used to release some of the immigrants, including Attila's brother.\n\nRating 6: Suruli and Attila resume their relationship.\n\nRating 3: Meanwhile, Peter asks Suruli to travel to Birmingham to kill Andrews, a minister who is against BICORE.\n\nRating 10: Suruli realises that Peter wants him to kill Andrews so that his death can be blamed on an immigrant, and thus BICORE would gain more support and be passed in Parliament.\n\nRating 8: He refuses to kill Andrews.\n\nRating 8: In retribution, Peter, John and their men attack Little Madurai and, in the process, kill Suruli's close friend Murugesan.\n\nRating 3: With no other option, Suruli's accepts Peter's demands and leaves for Birmingham.\n\nRating 8: However, during the journey, Suruli, Deepan and Dharani kill John and head for Peter's mansion instead.\n\nRating 7: They manage to shoot down Peter's goons and barge into Peter's room.\n\nRating 4: Despite Deepan and Dharani wanting to kill Peter, Suruli decides against it and instead transports Peter to a remote land on the Afghanistan–Iran border.\n\nRating 10: Suruli, Deepan and Dharani then destroy all proof of Peter's British citizenship, offer him a fake passport from the \"Republic of Mattuthavani\", and leave him there to live as a stateless refugee forever."
},{
    "genre": "Action",
    "related-genre": [
        "Dramas",
        "Action & Adventure"
    ],
    "id": 80203997,
    "tag": "Tamil-Language Movies",
    "image": "https://occ-0-2218-6.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABVFJ_3oXSgg0yQ_O3npxyr3LPFgGnLEXWPJ81DlGTYZr4mkn4F27_IbQQG6yhKV1lw7q2pJWn7XopUKbcJU2l9oBe1akBx1cPEM.jpg?r=def",
    "source": "https://www.netflix.com/in/title/80203997",
    "index": 83,
    "name": "Baahubali 2: The Conclusion",
    "maturity": "U/A 16+ ",
    "duration": "2h 46m",
    "synopsis": "To avenge his father's death, a young man leads an army into battle against a cruel tyrant in this Tamil conclusion to the historic saga.",
    "year": "2017",
    "spoilers": "\n\nRating 8: Kattappa continues to narrate how he was under compulsion to assassinate Amarendra Bahubali.\n\nRating 10: After vanquishing the Kalakeyas, Amarendra is declared as the heir apparent to the throne while Bhallaladeva is announced as the kingdom's future commander-in-chief.\n\nRating 6: Rajmata Sivagami Devi sends Amarendra on a tour under disguise with Kattappa for attaining knowledge in political affairs.\n\nRating 10: During the tour, Amarendra witnesses the valour of Kuntala's Princess Devasena / Thevasenai when she resists a group of attackers.\n\nRating 10: Falling in love with her, he approaches her after the fight, posing as a simpleton and Kattappa plays along with him as his uncle.\n\nRating 10: Amarendra is accepted as guard at the royal palace of Kuntala while Bhallaladeva perceives about Amarendra's acts and upon viewing Devasena's portrait, lusts for her and acquires a promise from Shivagami, who assures Bhallaladeva's marriage with Devasena oblivious to the fact that Amarendra has already fallen in love with her.\n\nRating 8: Shivagami sends an emissary to Kuntala proposing marriage but the emissary portrays it in a patronizing way leaving Devasena enraged.\n\nRating 3: She gives a scathing reply rejecting the proposal and upon receiving her response, Shivagami sends an order to Amarendra that Devasena be brought to Mahishmati as a captive.\n\nRating 8: In Kuntala, an attack by Pindari dacoits on the royal palace exposes Amarendra and Kattappa's bravery and they nullify the attack with assistance from Devasena's maternal cousin Kumara Varma who overcomes his cowardice.\n\nRating 10: Upon being confronted when Amarendra receives a message to capture Devasena, Kattappa reveals that Amarendra is the future king of Mahishmati.\n\nRating 8: Amarendra, promising Devasena that he would protect her honour at any cost takes her to Mahishmati.\n\nRating 3: In the court, the misunderstanding is brought to light and Shivagami asks Amarendra to choose between the throne and Devasena.\n\nRating 3: Unwilling to break his promise to the princess, he chooses to marry her and serve the kingdom as its commander-in-chief.\n\nRating 4: Bhallaladeva's coronation takes place at a grand note but he seethes with jealousy over his popularity among citizens.\n\nRating 8: Devasena expects a child and during her baby shower, Bhallaladeva deprives Amarendra of his commander post under pretext of making sure that Amarendra spends most of his time with his pregnant wife and the post is offered to Sethupathi.\n\nRating 8: Devasena questions the decision, declaring it unfair and confronts Shivagami for her inactions.\n\nRating 8: She asks Amarendra to ascend the throne as a gift to her that leaves everyone stunned.\n\nRating 8: Devasena, during her visit to a temple cuts Sethupathi's fingers off with a dagger when he dares to misbehave with visiting women and her.\n\nRating 8: She is shackled and produced in the court where Amarendra beheads Sethupathi for his misdeeds and as a result, both Devasena and Amarendra are banished from royal palace and are supposed to live as commoners.\n\nRating 8: As Amarendra's fame does not decrease, Bijjaladeva and Bhallaladeva stage a conspiracy to further turn Shivagami against Amarendra.\n\nRating 8: Bijjaladeva convinces Kumara Varma\n\nRating 8: that Amarendra, Devasena and their unborn baby's lives shall be threatened by Bhallaladeva's machinations and manipulates him into entering the palace at stealth of night for assassinating Bhallaladeva to do good.\n\nRating 8: However, Kumara Varma and his companions are defeated and killed before which Kumara Varma learns that it is a conspiracy to have Shivagami pass an order to assassinate Amarendra.\n\nRating 8: Shivagami, who believes that Kumara Varma is sent by Amarendra for murdering Bhallaladeva secretly passes an order to Kattappa for assassinating Amarendra as declaring it publicly would lead to an internal war.\n\nRating 3: Destined to be bound to the kingdom, Kattappa helplessly lures Amarendra into a secluded place feigning that he is in trouble where Amarendra is backstabbed and killed.\n\nRating 3: Kattappa is made aware of Bhallaladeva's treachery and exposes it to Shivagami, who regrets while Devasena delivers a male child.\n\nRating 3: Shivagami declares to the panicked hordes outside the palace that Amarendra died and his son Mahendra Baahubali would ascend the throne.\n\nRating 8: She orders an assembly to punish Bhallaladeva and his father but as Bhallaladeva and his men are about to seize Shivagami, she flees with the new King but falls into a river after being hit by an arrow shot by Bhallaladeva which leads her to a passage that ends down the mountain.\n\nRating 3: Bhallaladeva becomes a tyrannical emperor who holds Devasena prisoner for the next 25 years and destroys Kuntala, Mahendra ends up in alliance with the rebels who try to rescue her.\n\nRating 10: After listening to the whole story, Mahendra Baahubali  immediately declares war.\n\nRating 5: He assembles the rebel army, consisting of villagers and scattered soldiers.\n\nRating 3: With Kattappa's and Avantika's assistance, the army lays siege to Mahishmati.\n\nRating 8: Bhallaladeva recaptures Devasena, but Kattappa, Mahendra, and the rebels breach the city walls and save her.\n\nRating 3: Mahendra fights his uncle and pins him down using the chains from Devasena's cage.\n\nRating 7: After completing a cleansing ritual, Devasena burns Bhallaladeva on a pyre, ending his reign permanently.\n\nRating 10: The next day, Mahendra is crowned as the new king of Mahishmati with Avantika as his queen.\n\nRating 10: He declares Mahishmati will be dedicated to upholding peace and justice under his leadership.\n\nRating 3: He also orders his men to toss the head of Bhallaladeva's statue out of the palace walls, where it is swept to the great waterfall.\n\nRating 7: It breaks as it falls and crashes against the cliff's walls and lands near the lingam that Mahendra carried earlier."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Action & Adventure"
    ],
    "id": 81644302,
    "tag": "Tamil-Language Movies",
    "image": "https://occ-0-2218-6.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABSUEOTJ79eiVHJWXo7kGFJlkXMvGf-ZnWHqRBXI5usSZ5eyF58rZKmU91mZsuuwVxMVCGFXONdnH_9leG1x7CaYMhivxeow1n7c.jpg?r=d11",
    "source": "https://www.netflix.com/in/title/81644302",
    "index": 84,
    "name": "Thunivu",
    "maturity": "U/A 16+ ",
    "duration": "2h 22m",
    "synopsis": "A major bank heist takes an unnerving turn when a mysterious interloper known only as Dark Devil begins to hijack the operation.",
    "year": "2023",
    "spoilers": "\n\nRating 8: Radha, a dreaded gangster, and his men plan a heist at \"Your Bank\", one of the biggest privately-owned bank in Chennai, with the support of ACP Ramachandran.\n\nRating 8: They plan to rob ₹500 crore on 21 May, coinciding with the Governor's party event at his residence.\n\nRating 10: On the day of the heist, Radha and his men hijack the bank, only to discover that the bank is already hijacked by a mysterious man nicknamed Michael Jackson and his accomplice, Kanmani.\n\nRating 10: The commandos arrive inside the bank, but get defeated.\n\nRating 6: Jackson later makes a deal with Radha to help him rob ₹5000 crores, in exchange for a share of the money, for which Radha and his men reluctantly agree.\n\nRating 10: When Radha finds that the bank locker contains only ₹1,510 crores, they decide to kill Jackson, only to be defeated.\n\nRating 8: Jackson insists that Antony alias Anto, a police constable to be the negotiator, much to Ramachandran's ire.\n\nRating 8: He uses a voice changer of Michael Jackson, tricking the people and the media into referring him as Michael Jackson.\n\nRating 10: Ramachandran tries to kill Jackson with a sniper, only for him to make an explosion in a car parked nearby the bank using a bomb.\n\nRating 3: With the events being leaked to the media, city commissioner Dayalan is called in to handle the situation.\n\nRating 8: While inspecting the bank, Jackson finds explosives, disguised as fire extinguishers, and deduces that a third team has also entered the bank, without him knowing.\n\nRating 7: The police tracks a van where Kanmani is guiding Jackson, but Kanmani destroys the van, and escapes.\n\nRating 3: Ramachandran sends his men to trace Kanmani, but she kills them and exposes Ramachandran's involvement in the heist to Dayalan, who interrogates him, and he confesses that he along with his childhood friend Shyam, the Tamil Nadu Branch Head of Your Bank, planned the heist.\n\nRating 8: Ramachandran tried hiring Jackson, who goes by the name \"Dark Devil\", for the job, but he refused.\n\nRating 8: Ramachandran later hired Radha's gang for the job, without revealing that they will be killed after the heist.\n\nRating 3: Radha and his gang join and assist Dark Devil after hearing Ramachandran's confession through bugs planted on Dayalan's base.\n\nRating 3: Shyam flees from police after they learnt about his involvement, but is captured by Kanmani.\n\nRating 3: Meanwhile, Dayalan finds that Valavan was the one who wired and planted explosives in the drainage, and begins to search for him.\n\nRating 3: He also learns that Dark Devil and his team actually died a few months ago.\n\nRating 10: Ramachandran tries to prove that Dark Devil is alive by detonating a dummy bomb only to get killed when the bomb turns out to be a real one and explodes after the wire in it gets detached.\n\nRating 3: Dark Devil learns from Kanmani that there are ₹25,000 crores available in the bank.\n\nRating 4: Dark Devil tells Dayalan to arrange a meeting between him and chairman of Your Bank, Krish.\n\nRating 6: As Dark Devil deduced, the third team, revealed to be some of the bank's staff, attack Radha and his team in the locker, before assaulting Dark Devil and hold him captive.\n\nRating 5: Krish arrives and reveals that the third team were hired by him and tells them to destroy the bank's chest with explosives with hostage inside.\n\nRating 10: Krish also forces Dark Devil to reveal himself, where Dark Devil reveals that he and his teammates lived happily together like a family.\n\nRating 3: After having committed a heist in Bangkok, Dark Devil's members, Jijo and Achara planned to get married.\n\nRating 9: They all travelled to Araku Valley, Andhra Pradesh to arrange their marriage and celebrate, but they were ambushed by assailants sent by Krish and Shyam, who feared that they would reveal their heist plan to others.\n\nRating 8: Jijo and Achara got killed, but Dark Devil and Kanmani managed to escape and the killers faked their deaths for the rest of their deal money.\n\nRating 7: The duo reached the house of an old couple, who tends their wounds and revealed about his son Kavin, an honest bank official, who wanted to return the money to the people who invested in mutual funds.\n\nRating 10: However, Kavin was killed by Krish, and made it look like a mob did this during a strike.\n\nRating 10: Having learnt about this, Dark Devil and Kanmani decided to bring Krish and the bank officials to justice.\n\nRating 7: After the revelation, Dark Devil defeats Krish and his team, where he forces him on live to reveal about his financial scam of the ₹25,000 crore, which was invested in the mutual funds, and the atrocities committed against people by the bank officials.\n\nRating 8: Shyam, who was made to wear a bomb vest is sent to Dayalan, where he reveals everything about the heist and Krish's involvement in it, before he is killed by Kanmani's phone call.\n\nRating 3: Dark Devil also brings mutual funds chairman Harsha, who was abducted by Kanmani at gunpoint and Sunil Dutta, who was abducted from Mauritius by Dark Devil's men and was also responsible for stealing data from the NSE backup server of the Indian Stock Exchange.\n\nRating 8: Sunil confesses that he invested in 10 companies belonging to Krish and reveals that the ₹25,000 crore is in the bank's secret chest locker.\n\nRating 10: With the help of a mole in the media, Krish falsely frames Dark Devil and his team as terrorists, and cuts the live telecast.\n\nRating 10: Dayalan learns from Rajesh that everyone in the bank are going to be killed, except Krish, before commandos arrive and take control of the situation, and Dayalan is suspended.\n\nRating 10: In the bank, Dark Devil opens the secret locker with the help of Radha and his men, only to find that the money is counterfeit money.\n\nRating 8: Dark Devil locks Krish, Sunil and Harsha in the secret locker, before Krish reveals that the money is stacked in 25 of the 1500 containers of his ship, which he discreetly records as a video.\n\nRating 10: The commandos open fire, with the bank severely damaged.\n\nRating 8: Krish, Sunil and Harsha are killed in the secret locker by an explosive.\n\nRating 10: Kanmani arrives in a fire truck stuffed with RDX, and threatens to detonate them, unless the hostages are released, forcing the commandos to cease fire.\n\nRating 3: She along with Dark Devil, wearing masks, escape with the help of the public and reach a boat, planning to escape by sea, while Radha and his gang also escape in the ensuing chaos.\n\nRating 3: A chase ensues where Dark Devil, Kanmani, and the rest of their team shoot the commandos and coast guards, using an M2 Browning.\n\nRating 8: However, they get shot and fall into the sea.\n\nRating 8: Later, the media broadcasts the video which Dark Devil discreetly recorded, and Dayalan's suspension is revoked.\n\nRating 6: Meanwhile, Dark Devil and Kanmani fake their deaths and escape using sea scooters and reached their boat, settling in international waters.\n\nRating 3: Dayalan and his team board a helicopter to the ship, where they find the ₹25,000 crore."
},{
    "genre": "Drama",
    "related-genre": [
        "Dramas",
        "Action & Adventure"
    ],
    "id": 81072516,
    "tag": "Tamil-Language Movies",
    "image": "https://occ-0-2218-6.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABabOlq7w-PCWUhi-BU-ZHDjDl7mO4Po1W1QV9BcKdNRlJtLu79x2WD2KMLPOkfXcmGBDIHdRKpDz4x3sLlVp953a1EibH7CH0yI.jpg?r=358",
    "source": "https://www.netflix.com/in/title/81072516",
    "index": 85,
    "name": "Sarkar",
    "maturity": "A ",
    "duration": "2h 42m",
    "synopsis": "A ruthless businessman’s mission to expose electoral fraud brings him into a heated and dangerous political conflict with two corrupt ministers.",
    "year": "2018",
    "spoilers": "\n\nRating 3: Sundar Ramaswamy is a wealthy and ruthless NRI corporate raider in the US, referred to as a corporate monster due to his ruthless business dealings.\n\nRating 8: He arrives in Chennai to cast his vote in the Tamil Nadu Legislative Assembly election.\n\nRating 10: However, he finds that someone else had already voted in his place.\n\nRating 3: Sundar approaches the Tamil Nadu State Election Commission and demands a stay on the election result for his constituency, an annulment of the fraud elector's vote, and the ability to legitimately cast his vote, to which they agree.\n\nRating 3: He raises awareness among the public regarding fraud voting and finds that many people too faced a similar problem to his when trying to vote.\n\nRating 10: M. Masilamani, the previous C.M of Tamil Nadu, is re-elected, his daughter Komalavalli, and fellow politician and brother Malarvannan \"Rendu\" celebrate.\n\nRating 10: Sundar visits his family, whilst rekindling with Nila, who is his brother's estranged sister-in-law.\n\nRating 8: Meanwhile, Masilamani receives suitcases full of black money, as he discovers a journalist, Muthukumar, hiding inside the suitcase, to record evidence of his corruption, and Masilamani kills him and buries the case.\n\nRating 3: Sundar's actions bring him into conflict Masilamani and Rendu.\n\nRating 10: Although Masilamani's party wins the elections, the Election Commission annuls the result based on Sundar's plea to recount the votes, and fresh elections are scheduled to take place within the next 15 days.\n\nRating 10: After many assassination attempts on him by Rendu's henchmen, Sundar decides to contest the election against Masilamani as an Independent candidate and resigns from his company to avoid any conflict-of-interest.\n\nRating 10: Initially unpopular among the masses due to his corporate background, Sundar delivers a speech detailing his rise from a humble fisherman background to a businessman and his struggle from poverty to riches, gaining massive support.\n\nRating 3: Sundar and his supporters gatecrash an event involving the merger of Masilamani's party with the opposition.\n\nRating 8: After Sundar confronts Masilamani regarding his silence on district-related issues, the police brutally beats up Sundar and his supporters.\n\nRating 3: At this juncture, he realises that the entire political system in the state and country needs reform, so he decides to contest in all constituencies in Tamil Nadu along with his supporters.\n\nRating 5: Sundar acquires video evidence wherein people who had attempted to expose Masilamani's corruption were killed under mysterious circumstances, and he plans to reveal it to the media to discredit Masilamani and have him arrested.\n\nRating 3: Meanwhile, Masilamani's daughter Komalavalli, based in Canada] arrives in Chennai after finding out that her father and uncle have lost support due to Sundar.\n\nRating 10: She decides to spoil Sundar's reputation and frame him as a corrupt and power-hungry person.\n\nRating 10: Komalavalli orchestrates a car accident, planting a case of money, which is stolen by a mysterious person, blaming Sundar for the accident, which causes him to lose considerable public support.\n\nRating 6: She furthers her agenda by killing her father with an overdose of diabetic tablets so that her party will gain sympathy votes.\n\nRating 3: These crimes ensure that Komalavalli, the new Chief Ministerial candidate for her party, would likely win the election.\n\nRating 10: On Election Day, Twitter messages generated from Muthukumar allege that Sundar has stashed black money in various locations, which further degrades Sundar's reputation.\n\nRating 10: However, unknown to anyone, the tweets were sent by Sundar himself, as Muthukumar was one of those activists killed by Masilamani.\n\nRating 8: Further messages lead to Muthukumar's decomposed body being found, exposing Komalavalli's lies.\n\nRating 8: Meanwhile, Komalavalli finds out that her mother has decided to expose her role in Masilamani's death at the latter's memorial in front of the media later in the day.\n\nRating 10: She arrives at the memorial with her henchmen to stop the expose, but Sundar subdues her henchmen, and her mother's confession is live-streamed, which ensures that the public support is back with Sundar.\n\nRating 3: Sundar and his supporters win the election, while Komalavalli and Rendu are arrested for their various crimes.\n\nRating 7: However, Sundar decides against becoming the Chief Minister, and instead chooses one of his supporters, an honest collector, to be the next Chief Minister."
},{
    "genre": "Romance",
    "related-genre": [
        "Romantic Comedies",
        "Dramas",
        "Comedies",
        "Romantic Movies"
    ],
    "id": 81642992,
    "tag": "Tamil-Language Movies",
    "image": "https://occ-0-2218-6.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABT9Sy-yaHfJ2fsV-9bg6OtVArJew217vUQT-K-zO0wmr15fcEzWWRlt9VK8rjb8oMvEpys8Qol-p0OkmaaogvOlnH3WpN4Xs9rA.jpg?r=958",
    "source": "https://www.netflix.com/in/title/81642992",
    "index": 86,
    "name": "Love Today",
    "maturity": "U/A 16+ ",
    "duration": "2h 32m",
    "synopsis": "Before they get married, a couple must swap phones for 24 hours at the behest of the bride-to-be's suspicious father.",
    "year": "2022",
    "spoilers": "\n\nRating 10: Uthaman Pradeep, a 24-year-old support engineer employed in Cognizant in Chennai has been in a romantic relationship with Nikitha, daughter of Adv.\n\nRating 3: Venu Sastri that is hidden from their respective families.\n\nRating 3: They believe that they know each other perfectly and  are so far ready to take their relationship to the next level i.e, marriage but wait for Pradeep's elder sister Divya's wedding with an unattractive dentist Yogi, whose principles she admires.\n\nRating 10: Nevertheless, Venu discovers Nikitha's affair with Pradeep and invites him home to discuss.\n\nRating 8: Initially, he playfully teases Pradeep but puts forward a peculiar deal; Pradeep and Nikitha should switch their mobile phones for a day not without revealing their respective passwords and if they do not have any problem thereafter, Venu shall agree to their wedding.\n\nRating 10: Otherwise, they have to part ways.\n\nRating 10: Pradeep and Nikitha oblige to his proposal half-heartedly but the former deletes all the messages in WhatsApp before handing over the phone to Nikitha.\n\nRating 3: Pradeep returns home and Divya is supposed to be marrying Yogi after four days.\n\nRating 7: Goaded by his friends, Pradeep goes through Nikitha's WhatsApp and reads her conversation with Revi, her boy bestie and discovers that he proposed to her\n\nRating 8: but she rejected it as she was already indulged in an affair with Pradeep.\n\nRating 7: However, the latter is disappointed with the fact that Nikitha is close to Revi and shares everything with him despite knowing about his one-sided love for her.\n\nRating 8: He further perceives that Nikitha had gone on a late night long drive with her ex-boyfriend\n\nRating 3: Mamakutty few days ago to Puducherry after lying to Pradeep.\n\nRating 8: Infuriated, he makes a phone call to Nikitha, confronts her and questions her loyalty, leaving her in tears.\n\nRating 4: The next day, Pradeep proposes to Venu that the phones not be exchanged until Divya's wedding is over and Venu complies; secretly, he suggests Nikitha to restore all the deleted messages in Pradeep's mobile phone.\n\nRating 10: Divya's trust in Yogi, which hitherto was strong, begins to weaken when she discovers Pradeep's situation and realizes that Yogi has always been overprotective of his mobile phone; she begins to suspect him.\n\nRating 4: Along with her friends and Pradeep, Divya tries to get Yogi's phone intending to check its contents; her actions contribute to the growing wedge between her and Yogi.\n\nRating 10: Nikitha and Pradeep's relationship gets worsened when she perceives his addiction to pornography, his attempts to build conversation with his ex-girlfriend and his conversations with several women under guise of a filmmaker.\n\nRating 9: Pradeep realizes that in his mobile phone, he is still logged into another Instagram account which is being used by several college mates of his alongside him for mischievous acts.\n\nRating 8: Intending to log out of that account, Pradeep invites Nikitha to a restaurant but she shows up with Revi much to Pradeep's dismay.\n\nRating 3: His friends try to delete the account and sends an OTP to Pradeep's mobile phone; he tries to grab his phone from Nikitha but Revi helps her get hold of it and exposes the account.\n\nRating 10: Nikitha slaps Pradeep claiming that she and her sister Shwetha received perverted messages from the same account; she believes that he texted them from the fake account and breaks up with him despite his justifications.\n\nRating 8: He further assaults Revi for interfering that drives a wedge between them once again.\n\nRating 8: Pradeep returns home and suspects that his best friend Mani is behind the messages and fights with him as well, though he claims that he didn't do it.\n\nRating 10: During Divya's wedding reception, Pradeep sees her arguing with him over his phone secrecy and tries to help her snatch Yogi's phone but Saraswathi, Pradeep's mother slaps him.\n\nRating 6: She confronts him for his antics and he breaks down, detailing all the events.\n\nRating 10: Consoling him, Saraswathi asks Pradeep to trust Nikitha while all along, he has just been expecting her to  be trustworthy to him.\n\nRating 6: Yogi meets Pradeep and discloses to him that in his mobile phone, there are several conversations in his friends' group mocking his appearance and that Divya has been the only one who understood him and admired him.\n\nRating 10: He didn't want her to see his phone as he fears that she might regret getting to him if she goes through all the comments he faced.\n\nRating 10: Divya overhears the conversation and in contrast to Yogi's fears, she understands him and respects him even more.\n\nRating 10: They both reconcile and Yogi gives her his phone\n\nRating 10: but she refuses to see.\n\nRating 10: Pradeep reconciles with Mani and his friends as well.\n\nRating 7: Elsewhere, a porn clip, apparently that of Nikitha goes viral and is seen by everyone.\n\nRating 10: Venu refuses to trust Nikitha, assaults her physically and disowns her despite her plea that the woman in the clip is not her; broken, she leaves home.\n\nRating 4: Shwetha makes a phone call to Pradeep, explaining the events and he goes on a search for Nikitha while his friends keep calling Nikitha's friends to inquire about her.\n\nRating 10: Revi, whom Nikitha has trusted always, refuses to trust her while Pradeep's associate, an ethical hacker discovers that the clip is doctored by Nikitha's publicity loving colleague Kaushik.\n\nRating 5: Pradeep finds that a tree has grown out of a fruit he planted in the childhood and struggled to grow it as he has been continuously digging it to see if it is growing.\n\nRating 10: It has grown after he stopped digging and having faith in its growth; this makes him realize that trust is important in building a relationship.\n\nRating 8: He locates Nikitha near a beach and reconciles with her while Kaushik confesses his deeds online and gets arrested by the Police.\n\nRating 8: Venu discloses to the couple that his intentions behind asking them to switch their phones was not to break their relationship but to see if they trust each other despite all the obstacles.\n\nRating 10: He agrees to their wedding and asks Pradeep to arrange a meeting with his mother to discuss the wedding.\n\nRating 3: After meeting Saraswathi, Venu proposes that they exchange their mobile phones for another test."
},{
    "genre": "Action",
    "related-genre": [
        "Action & Adventure"
    ],
    "id": 81508241,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81508241",
    "index": 87,
    "name": "Beast",
    "maturity": "U/A 16+ ",
    "duration": "2h 36m",
    "synopsis": "A jaded former intelligence agent is pulled back into action when an attack at a mall creates a tense hostage situation.",
    "year": "2022",
    "spoilers": "\n\nRating 8: Veera Raghavan, a RAW field agent, is assigned to capture a terrorist named Umar Farooq.\n\nRating 8: While he successfully manages to do so, a missile shot by him to prevent Farooq's escape injures and kills a civilian child, traumatising Veera, who quits the agency and returns to Chennai.\n\nRating 7: 11 months later, Veera is still reeling from PTSD.\n\nRating 8: He meets Preethi at a wedding, and they fall for each other, where she convinces him to join her company Dominic & Soldiers, a failing security service.\n\nRating 3: Meanwhile, the Tamil Nadu government gets intel that a major terrorist event is planned in Chennai.\n\nRating 3: Along with Preethi and her boss Dominic Irudhayaraj, Veera visits the East Coast mall, which is their last client where he observes a series of suspicious activities and deduces that someone else has taken over the mall.\n\nRating 10: Veera is proven right, as terrorists, led by Umar Farooq's brother Umar Saif, open fire and hijack the mall.\n\nRating 4: Veera, Preethi, Dominic and others hide unharmed inside an unopened restaurant.\n\nRating 8: The government, led by Deputy NSA Althaf Hussain, tries to negotiate with the terrorists, who demands the release of Farooq.\n\nRating 3: Althaf learns that Veera is also trapped inside the mall and manages to establish contact with him, where he tries to convince Veera to help them.\n\nRating 10: Though initially hesitant, Veera gets convinced when he realises that the terrorists are here for Farooq, where he kills one of the terrorists and captures another one alive and brings him to their hideout.\n\nRating 4: Veera manages to infiltrate the terrorists and eliminates a few of them.\n\nRating 8: The Home Minister, who is in league with Saif, gets them to stage the execution of his wife and daughter Aparna, who are also in the mall on live television.\n\nRating 8: Enraged about the government's forceful decision to release Farooq, Veera retaliates and kidnaps the Home Minister's wife and Aparna where he pretends to be a Bangladeshi militant to confuse the terrorists, and threatens to kill them if Farooq is released.\n\nRating 8: Senses his impending defeat, Saif seemingly gives up, only to slip among the crowd pretending to be a hostage, and soon figures out Veera's real identity due to Dominic where he forces him and his aides to give up and captures all of them.\n\nRating 10: With the help of Aparna, Veera manages to escape, and eliminates Saif and the other terrorists while making sure that the hostages escape to safety.\n\nRating 8: The Home Minister is arrested for his involvement in the hijack.\n\nRating 8: Despite all the negotiations, Farooq is released.\n\nRating 8: Few months later, Veera captures Farooq in Pakistan and after surviving a long air chase, manages to bring him back to India to have him imprisoned.\n\nRating 10: After the mission, Veera, Preethi, Dominic and the rest of his crew celebrate their escapades in Goa."
},{
    "genre": "Comedies",
    "related-genre": [
        "Comedies"
    ],
    "id": 81644285,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81644285",
    "index": 88,
    "name": "Naai Sekar Returns",
    "maturity": "U/A 13+ ",
    "duration": "2h 19m",
    "synopsis": "When a bungling dognapper accidentally steals a powerful don’s pet, he is thrust into a wild caper that sparks a quest for his \"magical\" childhood dog.",
    "year": "2022",
    "spoilers": "\n\nRating 3: In 1989, Natrajan, his wife, and his mother-in-law visit the God Bairava temple to request the God for a child, since Natarajan and his wife have no children.\n\nRating 6: Just then, a saint visits the temple in shelter from the storm.\n\nRating 7: Natrajan and his family make an offering of prasad to him.\n\nRating 10: After hearing their story of having no child, he gifts them a dog, saying that it is not an ordinary dog; it has powers that will solve their problems and give them wealth.\n\nRating 10: The sayings of the saint became true: Natrajan's wife falls pregnant and gives birth to a male child, and Natrajan's family becomes rich through his lorry business.\n\nRating 3: They name the dog Bhairavar.\n\nRating 3: In the present day, Naai Sekar is a petty criminal who collects ransom money by kidnapping the dogs of the rich.\n\nRating 10: While attempting to kidnap a rich man's dog, he accidentally kidnaps local rowdy Dass's dog.\n\nRating 8: However, he manages to collect a ransom from Dass, but when Dass's henchmen find Sekar and his gang, they beat them.\n\nRating 8: Sekar's gang struggles to escape from Dass; in the fight, Dass gets shot in the groin by Sekar.\n\nRating 3: In fear of getting killed by Dass or his henchmen, they are planning to go to Kerala.\n\nRating 10: Sekar's grandmother scolds them and tells him about his family's history.\n\nRating 4: Soon after Sekar's birth, his family hired a servant named Meganathan alias Max to take care of Bhairavar.\n\nRating 8: Max kidnaps the dog after learning about its good fortune from a drunk Natarajan.\n\nRating 10: After losing the dog, their family's state became bad: Sekar's mother dies and Natarajan never came back from searching for his dog.\n\nRating 3: So Sekar goes to Lala Palace in Hyderabad to get the dog from Max.\n\nRating 7: Sekar discovers that Max is looking for a blind man to marry his sister Bobby.\n\nRating 10: So he pretends to be blind to enter the palace and kidnap the dog.\n\nRating 3: Eventually, he witnesses Max murdering his girlfriend Gora.\n\nRating 10: He eventually passes Max's tests and earns his approval.\n\nRating 9: He sets the wedding on Friday and requests him to invite all his friends and relations.\n\nRating 10: He invites his two friends.\n\nRating 3: Dass gets discharged from the hospital and finds out that Sekar is in Hyderabad from Surangani.\n\nRating 3: Later, Sekar kidnaps his dog \"Jackie\" and is just about to escape when Max catches him.\n\nRating 4: Sekar says that \"Jackie\" is his dog Bhairavar and he has come to take his dog.\n\nRating 8: Max takes out his gun, but Bhairavar bites him on his hand, causing Sekar to take the gun and shoot Max in the same manner and spot he shot Dass.\n\nRating 8: When the henchmen are about to attack Sekar, a police officer arrives at Lala Palace to arrest Sekar, but Sekar cleverly informs the police officer about Dass's and Max's crimes and has them arrested.\n\nRating 4: Sekar then reunites with Bhairavar, and they both drive out of Lala Palace."
},{
    "genre": "Drama",
    "related-genre": [
        "Dramas",
        "Comedies"
    ],
    "id": 81588444,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81588444",
    "index": 89,
    "name": "Don",
    "maturity": "U/A 13+ ",
    "duration": "2h 43m",
    "synopsis": "Seeking a sense of purpose, a wayward college student navigates life on campus while enduring a controlling father and a disciplinarian professor.",
    "year": "2022",
    "spoilers": "\n\nRating 10: Chakaravarthi, a famous film director, is desperately trying to make it to college.\n\nRating 8: As he drives, he narrates the story of his college days.\n\nRating 6: Past: Chakaravarthi's father, Ganesan, is a strict father who cares a lot about Chakaravarthi's studies and wants him to be a civil engineer.\n\nRating 8: But Chakaravarthi hates studying and lies to his father about his test marks.\n\nRating 10: At the same time, Chakaravarthi falls in love with Angu, Angaiyarkanni, alias Angu, during his 12th year of school.\n\nRating 3: Initially, she avoids him but soon reciprocates his feelings, but they end up going their separate ways after Ganesan and Angu's father confront about their relationship since Chakaravarthi claims Angu is just his friend to avoid his father bashing him up.\n\nRating 4: Chakaravarthi joins BEC  in Coimbatore.\n\nRating 10: However, the college's disciplinarian professor, Bhoominathan, whom the students fear and hate, ruins his expectations of enjoying college life.\n\nRating 3: Chakaravarthi constructs a plan to send Bhoominathan away to be a visiting professor at St. Paul's University in Russia so that students can be happy.\n\nRating 10: Meanwhile, Chakaravarthi meets Angu again, who is also a part of BEC.\n\nRating 8: Angu befriends Lilly, a first-year student, despite his attempts to woo her.\n\nRating 4: Lilly explains to Chakravarthi that, after the incident in their school days, Angu's father stopped talking to her.\n\nRating 10: Chakaravarthi successfully patches them up after creating a short film and ends it on an emotional note that Angu's father and Angu reconcile.\n\nRating 10: Angu is impressed and reciprocates his feelings.\n\nRating 8: Amidst this, Bhoominathan unexpectedly returns from Russia and discovers that Chakaravarthi sent him there.\n\nRating 8: In revenge, his assistant clicks a photo of Chakaravarthi and Angu at the Taj Mahal.\n\nRating 9: He uses it to complain to Killivallavan, the BEC chairman.\n\nRating 10: Chakaravarthi, in return, presents a picture of Bhoominathan with Miss Swetha at the Taj Mahal.\n\nRating 5: It gains the wrath of Killivallavan, who is disappointed about Bhoominathan.\n\nRating 8: Meanwhile, Ganesan discovers the truth about Chakaravarthi, including his college test scores.\n\nRating 8: Feeling cheated and enraged, he slaps Chakaravarthi.\n\nRating 3: Chakaravarthi decides to venture into filmmaking by attending a short film competition.\n\nRating 10: However, Ganesan does not allow him to do filmmaking and wants him to do engineering.\n\nRating 3: Chakaravarthi secretly films portions of the college with cameraman Perusu.\n\nRating 10: At the film's climax, Bhoominathan finds out about his secret filming.\n\nRating 4: In a muddle of guns, drama, and confusion, Bhoominathan suffers an accident that severely injures his neck, but Bhoominathan eventually survives.\n\nRating 10: The chairman of BEC dismisses Chakravarthi from the college.\n\nRating 10: Ganesan discovers Chakaravarthi's secret filmmaking and destroys his short film, resulting in an intense confrontation between them.\n\nRating 10: Frustrated with his father, he leaves the house.\n\nRating 3: Bhoominathan gradually recovers while Chakaravarthi prepares another short film for the competition.\n\nRating 10: Bhoominathan and Chakaravarthi develop a positive rapport.\n\nRating 8: Bhoominathan tells Chakravarthi that he spoke with the chairman.\n\nRating 8: He informs Chakaravarthi that if he clears all of his arrears, he can get his engineering degree, thus burying the hatchet and ending their conflict.\n\nRating 10: Chakaravarthi's short film gets shortlisted to the top and becomes a feature film, which enters the 100 Crore Club.\n\nRating 10: The film 'Untold Love' is about Chakaravarthi's emotional bond with Ganesan.\n\nRating 3: He realises Ganesan really cared for him before he died.\n\nRating 8: Chakaravarthi later marries Angu.\n\nRating 10: Present: Chakaravarthi was desperate to get an engineering education from Bhoominathan; that was the only reason to attend college.\n\nRating 10: He accepts and takes his degree.\n\nRating 10: Chakravarthi then delivers an emotional speech to the students and audience.\n\nRating 10: He also sees a vision of Ganesan applauding.\n\nRating 10: Chakaravarthi gets added to the Proud Alumni list at BEC, which was something he asked Bhoominathan in his earlier college days."
},{
    "genre": "Drama",
    "related-genre": [
        "TV Dramas",
        "Dramas",
        "Independent Movies",
        "Social Issue TV Dramas"
    ],
    "id": 81341216,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81341216",
    "index": 90,
    "name": "Paava Kadhaigal",
    "maturity": "A ",
    "duration": "1 Season",
    "synopsis": "At times dark, at times disturbing, four short films explore stories of those who dare to dream and desire — and those determined to stand in their way.",
    "year": "2020",
    "spoilers": "\n\nRating 10: Set in the early 1980s in a small town in Kovai district, Sathar , a Muslim transwoman is in love with their Hindu childhood friend Saravanan , who she affectionately calls 'thangam ' and believes that once her sex reassignment surgery is done, they can get married and live together as a normal couple.\n\nRating 7: She earns money by standing in a queue for villagers in the ration shop and delivering their goods to their homes.\n\nRating 10: Saravanan returns to the village after completing his studies and has also acquired a good bank job.\n\nRating 8: Saravanan confides in Sathar that he is in love with her younger sister Sahira .\n\nRating 10: Though heartbroken, Sathar comes to terms with the harsh truth and unites Saravanan and Sahira, who start seeing each other.\n\nRating 3: Word spreads to both the families about the budding love, and due to the religious differences, both families oppose the relationship.\n\nRating 10: Despite Sathar's efforts to protect Sahira, she gets beaten up by their abusive father.\n\nRating 3: Saravanan and Sahira plan to elope and get married, and Sathar gives them the money she has saved up for her sex reassignment surgery.\n\nRating 10: One year later, Saravanan and Sahira's families reconcile with each other and invite the young couple and their newborn son back home.\n\nRating 10: Saravanan and Sahira are excited to reunite with Sathar.\n\nRating 10: While on the way home, they meet with Saravanan's maternal uncle, who tells them what transpired after they left.\n\nRating 10: The villagers are told that after Sathar had helped the couple elope, she was disowned by her family and was thrown out of the house.\n\nRating 10: Saravanan's dad made the villagers get back their ration cards from Sathar, and she was left without livelihood.\n\nRating 10: She was forced to live on the streets where she is stalked and harassed by the town's hooligans.\n\nRating 3: On one such night, she was being chased by the hooligans, and all the villagers refused to let her into their homes.\n\nRating 10: Out of desperation, she goes back to her parents for help, but her mother refuses to open the door and instead begs her to die at the hands of the thugs since that would make it easier for her to marry off the rest of her sisters and restore the family's honor.\n\nRating 3: Sathar is devastated upon hearing this, and walks as prey willingly into the hands of the waiting thugs who violate and kill her mercilessly.\n\nRating 8: Saravanan and Sahira are inconsolable at the entire village's heartlessness and the misfortune they caused Sathar.\n\nRating 10: They leave without meeting their parents despite their constant pleas.\n\nRating 8: Saravanan goes to their favorite spot on the riverside, finds Sathar's little possessions and cries for his long-gone friend.\n\nRating 8: Twin sisters Aadhilakshmi and Jothilakshmi  are the daughters of a feudal village lord, Veerasimman .\n\nRating 8: Jothi lives in the city, while Aadhi lives in the village with her father.\n\nRating 8: Veerasimman seemingly endorses inter-caste marriages for his political agenda, but deep down in his heart, he has a strong hatred towards lower-caste villagers, and his henchmen, headed by Narikutty , go about killing couples who marry out of their caste.\n\nRating 10: It is at this point that Aadhilakshmi naively believes in the change of her father's attitude and reveals that she is in love with their family driver  who is from a different caste.\n\nRating 10: She confides in Jothi and asks her to come to their village to meet them all.\n\nRating 8: Meanwhile, Veerasimman, on the advice of Narikutty, agrees to kill Aadhi and her boyfriend to preserve the honor of their community.\n\nRating 3: Narikutty sets up a live wire and gets Aadhi to fatally electrocute herself.\n\nRating 8: Her boyfriend is also murdered in a seemingly innocent car crash.\n\nRating 10: Jothilakshmi arrives at her village with her friends Penelope  and \"Bad Boy\" Bharani .\n\nRating 8: Penelope and Jothi find that Aadhi is missing and things have not changed in her household.\n\nRating 8: Suspecting yet another inter-caste relationship, Narikutty beats up Bharani, and this forces Penelope to reveal that she is a lesbian in a relationship with her and Bharani is just their friend.\n\nRating 10: Veerasimman and Narikutty are horrified at this and threaten to kill everyone.\n\nRating 10: At Aadhi's funeral, Penelope and Bharani are given a death threat and are forced to leave town leaving Jothi behind.\n\nRating 10: Jothi becomes depressed and begs her father to let her go alive and says that she would never come back.\n\nRating 3: Penelope and Bharani arrive that night to pick her up, and surprisingly, Veerasimman does not object.\n\nRating 3: On their way back to the city, Penelope calls Veerasimman and Narikutty to tell that Jothi is in fact in a relationship with Bharani and the lesbian relationship was just an act to escape the violence.\n\nRating 8: Years later, it is revealed that Veerasimman really has had a change of heart and escaped his village and its caste-based violence and lives in France with his daughter.\n\nRating 10: Sathya  and Mathi  are a close-knit middle-class couple living in Madurai with their three children: a college-going son Bharath , an older daughter Vaidehi , and a 12-year-old daughter Ponnuthaayi .\n\nRating 3: When Vaidehi attains puberty, she is advised by a strictly old-fashioned Mathi on how to stop behaving like a child and start acting like a woman, protect herself, and to lead a dignified and honorable life from now onward.\n\nRating 7: But one night, Ponnuthayi is wrongly kidnapped  after her dance lessons and is sexually abused by a rich brat from their neighborhood.\n\nRating 8: She comes back home traumatized, and the entire family is distraught at the wrong that befell their young child.\n\nRating 10: Not wanting to go public with the incident, Mathi refuses to lodge a police complaint despite the pleas of Bharath and Sathya.\n\nRating 10: Sathya is helpless as a father and struggles to cope up with his day-to-day life.\n\nRating 3: Mathi tries her best to protect Ponnuthaayi from the prying eyes of her neighbors and relatives who start believing rumors following Ponnuthaayi's brief disappearance.\n\nRating 10: Ponnuthaayi slowly recovers from her injuries, and Sathya gives her a reassurance that there is nothing wrong on her part and asks her to continue following her dreams.\n\nRating 10: Mathi is unable to deal with the questions heaped at her and the stories framed by society.\n\nRating 8: She briefly imagines pushing Ponnuthaayi off a cliff to avoid the dishonor, but she pulls herself together and is ashamed of her own thoughts.\n\nRating 3: She resolves to continue living with her head held high.\n\nRating 7: An angst-ridden Bharath manages to track down the perpetrator, who is his own college senior.\n\nRating 10: He swears revenge, and with the help of his friends, he manages to castrate the culprit to prevent him from harming any other girl.\n\nRating 10: The film begins with a pregnant Sumathi  happily reunited with her estranged family in her village.\n\nRating 10: She was cut off from her parents and siblings a few years ago after she eloped and married Hari , a boy from a lower caste.\n\nRating 10: Both Sumathi and Hari are well-educated and live independently in Bangalore.\n\nRating 10: When Sumathi's father Janakiraman  learns that she is pregnant with his grandchild, he keeps his animosity aside and visits her in the city.\n\nRating 10: Though hesitant to accept his son-in-law at first, Janakiraman willingly invites both of them to his house in the village for Sumathi's baby shower rituals.\n\nRating 10: Surprised at her father's sudden change of heart, Sumathi agrees and goes to her village where she is met with indirect hostility from everyone for eloping, but eventually they warm up to her.\n\nRating 3: On the night before the baby shower, everyone in the family  goes to the reception hall.\n\nRating 10: Suddenly, Sumathi falls sick.\n\nRating 5: When Janakiraman refuses to call the doctor, it is revealed that it was he who poisoned Sumathi's drinking water and is waiting for her and her unborn child to die.\n\nRating 3: Despite Sumathi and her mother's pleas for help, Janakiraman turns a deaf ear, locks her up and chastises her for marrying out of their caste and says that only her death would restore his family's pride and honor.\n\nRating 8: Sumathi begs for her life despite her deteriorating condition, and at one point she realizes that her unborn child is dead.\n\nRating 10: Too weak to continue, Sumathi finally succumbs and dies.\n\nRating 10: Janakiraman is beside himself with grief at the fate of his daughter, yet he thinks that this was the only solution to his problem.\n\nRating 8: Finally, it is shown that Hari learns about the tragedy that struck his family and presses murder charges against Janakiraman, who awaits his trial."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Action & Adventure"
    ],
    "id": 81444683,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81444683",
    "index": 91,
    "name": "Wild Dog",
    "maturity": "U/A 16+ ",
    "duration": "2h 6m",
    "synopsis": "A brash but brilliant Indian intelligence agent leads a covert operation to nab the mastermind behind a series of attacks threatening national security.",
    "year": "2020",
    "spoilers": "\n\nRating 6: On 13 February 2010 at John's Bakery in Pune, a bomb explosion claims many innocent lives.\n\nRating 10: Two weeks later, the Ministry of Home Affairs hands over the case to the National Investigation Agency and its top officer Vijay Varma, also known as Wild Dog, is reenlisted by his senior friend DGP Hemanth.\n\nRating 10: Through a series of investigations, Vijay and his team come across the CCTV footage of a man entering the bakery with a bag and exiting without it.\n\nRating 10: Further, with the help of a survivor's testimony, they are able to create a sketch of the culprit.\n\nRating 7: On the other hand, Hemanth explains to Vijay about a two-week older incident involving killings of two cops inside a truck at the Andhra–Tamil Nadu border, three days before which he had received a tip-off from the Intelligence Bureau about 50 kilograms of RDX being transported at the border.\n\nRating 5: As the culprit's sketch is circulated everywhere, a shop owner quickly recognizes the suspect and explains to the cops that he let the suspect live in his house on the recommendation of a man named Mirza Baig.\n\nRating 8: Vijay and his team manage to nab Baig and torture him into revealing the culprit's name: Khalid, who bombed the bakery, and his accomplice, Khatil who was supposed to blow up the Dagdusheth Temple but could not, given the tight security at the temple due to a VIP's visit.\n\nRating 7: Vijay orders a search for Khalid, and sends his teammate Ali Reza undercover in prison where one of Khalid's allies, Mohammed Peerbuoy, who instructs Ali to visit a library named Darul-ul-Islam in Darbhanga, Bihar under his recommendation.\n\nRating 6: Through further investigating, Vijay reveals the culprit to be Khalid Bhatkal, a member of the Indian Mujahideen.\n\nRating 4: On the other hand, Khalid targets Indian Premier League and enlists Khatil for the job.\n\nRating 3: However, Khatil is nabbed by Vijay's team in Bihar while visiting his ailing son and provides them with Indian Mujahideen's details in exchange for his son's treatment.\n\nRating 3: With his help, police nab several suspects.\n\nRating 8: Asadullah, the librarian, enlists Ali to meet with a special person at Mumbai, and learning of this, Vijay believes him to be Khalid himself.\n\nRating 3: In Mumbai, Khalid instructs Ali through a phone call while watching him.\n\nRating 8: Vijay also keeps an eye on the movements and is about to nab Khalid as the latter prepares to meet Ali inside a taxi, but the mission is foiled by the Mumbai ATS who were following Ali due to a tip-off from the Bihar intelligence.\n\nRating 10: Enraged, Vijay slaps one of the cops and is suspended from the mission.\n\nRating 3: However, he continues working unofficially and through Arya, a source in Nepal, learns Khalid is hiding there.\n\nRating 8: He asks for Hemanth's help, but the ministry turns them down.\n\nRating 7: Vijay finally flees to Nepal along with his team to execute the covert \"Operation Wild Dog\".\n\nRating 10: At the rendezvous point, they are attacked by armed men, before Arya arrives and helps them fight off the attackers.\n\nRating 10: Hemanth is suspected for blowing their cover, since he was the only one aware of the mission.\n\nRating 7: Laxman, a senior inspector at Nepal Intelligence, reveals they were attacked by the henchmen of a don named Bomzan, who is ambushed and reveals he was ordered to kill them by Abdullah, an MP working for the ISI.\n\nRating 8: Vijay executes Bomzan before ordering him to lie to Abdullah about killing them.\n\nRating 7: Vijay and his team fail to capture Khalid at the wedding of Abdullah's son, but later succeed following a shootout with the Maoists guarding him.\n\nRating 3: Laxman betrays them by revealing to Abdullah about their escape in an ambulance, but Vijay improvises the route.\n\nRating 8: Khalid awakens and attacks Vijay who overpowers him as the ambulance reaches the border.\n\nRating 7: Two of Vijay's teammates disguised as Indian Embassy officials request the ambulance's entry for a \"VIP's operation\".\n\nRating 3: Vijay's defibrillation experiment involving Khalid works and seeing his life in danger, the ambulance is allowed to pass through the borders.\n\nRating 3: It is further revealed Vijay secretly texted Hemanth about a traitor in the agency and it was discovered to be Hemanth's friend Vinod, who was assisting with the operation.\n\nRating 10: Vijay hands over Khalid to Hemanth, and salutes the tricolor along with his team....."
},{
    "genre": "Drama",
    "related-genre": [
        "Dramas"
    ],
    "id": 81671561,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81671561",
    "index": 92,
    "name": "Vaathi",
    "maturity": "U/A 13+ ",
    "duration": "2h 14m",
    "synopsis": "When a private school teacher is assigned to a neglected public school, he must overcome personal and political strife in his fight for education.",
    "year": "2023",
    "spoilers": "\n\nRating 4: Abhiram is a student in Thirupathi /Tripathi  Educational Institutes run by Srinivas Thirupathi/Srinivas Tripathi, preparing for EAMCET along with his friends finds an old box full of tape records while cleaning his grandfather's video shop which is going to sale for his Engineering seat that shop is well known as well as oldest video shop and first video shop in olden days.\n\nRating 8: Abhi and his friends plays the tape to check its contents , where they find a person teaching mathematics in a very clean and efficient manner, where the friends find the maths taught by him found maths easy and checks the box again.\n\nRating 8: They find a receipt on which a name is written A. M. Kumar  / A. S. Murthy  and dates back to 4 May 2000.\n\nRating 9: They also notice the place written, Sozhavaram  / Siripuram .\n\nRating 5: The trio decide to travel to that place to find the man named A. M. Kumar/A. S. Murthy .\n\nRating 3: After inquiring many people, they meet the Village Government college peon Subbaya who tells them that A. M. Kumar/A. S. Murthy is not a lecturer, but was once a student and now the DC of Kadapa.\n\nRating 3: The trio reaches Kadapa and ask A. M. Kumar/A. S Murthy about the man in the video, where he tells them about the man named Balamurugan 'Bala'  / Bala Gangadhar Tilak 'Balu' .\n\n1993:\n\nRating 8: During the time of privatization of the economy, education has become a necessity for people to grow big and professional courses like MBBS and engineering saw a huge demand.\n\nRating 8: Noticing this sudden spike in education, many investors have turned education into business.\n\nRating 7: In the name of quality education, they started cashing hefty money from parents to get their children admitted into their private colleges.\n\nRating 10: At the same time, the government had a hard time running their colleges and couldn't even pay the lecturers salaries.\n\nRating 7: The private colleges even hired top class and experienced government college lecturers to teach in their own colleges.\n\nRating 8: 1998:\n\nRating 10: Many government colleges had to shut down due to shortage of lecturers.\n\nRating 10: For the poor who couldn't afford private institutions, education had become inaccessible.\n\nRating 3: Srinivas Thirupathi/Srinivas Tripathi, the president of private junior colleges association hatches a master plan to adopt all the government junior colleges and send third-grade junior lecturers to those colleges, thus supporting the ruling government to stop the regularization of fee scheme by the government.\n\nRating 7: Bala/Balu is one of those lecturers, who is sent to a government junior college to teach Mathematics along with Karthik, a chemistry lecturer, and Prakash Reddy / Bulli Reddy , a physics lecturer.\n\nRating 8: Thirupathi/Tripathi promises that any lecturer who performs well in their field will be promoted to senior lecturer upon being asked by Bala/Balu.\n\nRating 3: The next day, the three lecturers are taken to Government Junior College, Sozhavaram  / Government Junior College, Siripuram .\n\nRating 10: They are received warmly by the village's President Muthu Pandian  / Patthi Papa Rao , where Bala/Balu sees Meenakshi, a biology lecturer, and falls for her.\n\nRating 10: The next day, none of the students show up to the college.\n\nRating 8: Bala/Balu learns from the Telugu lecturer Thanigachalam  / Deekshitulu  that all the warm welcome was just for publicity and students arrives for sweets and hots at the college.\n\nRating 8: Meenakshi tells him that before the shutdown of government colleges, this was the only government college in the district, and many students from the neighboring districts used to arrive, but they were unable to trust them even after opening, thinking that they might close the government colleges sooner or later.\n\nRating 10: Bala/Balu made a promise to Meenakshi that he will get all the students to the class within 3 days.\n\nRating 3: He asked the president to organize a meeting with all the villagers and their children.\n\nRating 10: Bala/Balu gave a speech about the necessity of education, thus making the children and parents realize its importance.\n\nRating 7: The students then started coming to the classes.\n\nRating 5: Bala/Balu also brought back an ex-student, Muthu  / Satti , who discontinued his education after his parents committed suicide and got addicted to alcohol and smoking.\n\nRating 3: Bala/Balu offers him a job 30 rupees per day as his daily wage and assures him to study as his work.\n\nRating 8: He also reformed many students like Kumar/Murthy and his gang, who were not interested in their studies.\n\nRating 10: Meanwhile, Karthik gets ill and leaves the college, as does Prakash Reddy/Bulli Reddy.\n\nRating 7: With their departure, Bala/Balu takes over the responsibility of teaching both Physics and Chemistry classes as well, for both MPC and BiPC students.\n\nRating 8: Bala/Balu noticed that due to caste differences some students ill treating other students.\n\nRating 8: He eliminated this barrier within the class and from their minds, by explaining that necessity had no caste thus making them united and effectionate on each other.\n\nRating 10: Meenakshi was impressed by this act and fell for him.\n\nRating 8: The board exams took place and all the students passed with first class.\n\nRating 8: With the 100% pass percentage achieved by Bala/Balu, Thirupathi/Tripathi confronted him and told him that the pass percentage of his own private college is just 75% and people wanted to join the government colleges, owing to the quality of education.\n\nRating 10: He tried to lure him with a senior lecturer promotion and salary hike in one of his private college, but Bala/Balu did not fall for it and in-fact, stopped working for him.\n\nRating 10: He even challenged Thirupathi/Tripathi that he will make all the students pass with distinction the next time and also get them a good rank in the TNPCEE/EAMCET examination.\n\nRating 9: With this, Thirupathi/Tripathi bribed the opposition party leader to create a strike on unemployment and also the ruling party's education minister to take back the positions offered to lecturers at Government junior colleges and recruit new ones.\n\nRating 10: This caused Balu/Bala to lose his job and his father, Narayanan  / Narayana , his job as a driver.\n\nRating 8: Nevertheless, Bala/Balu took classes in an open field, in the village.\n\nRating 7: Thirupathi/Tripathi asked Muthu Pandian/Patthi Papa Rao to arrest him and drive him away from the village.\n\nRating 5: Bala/Balu fights back, but the cops arrest him and take him into custody.\n\nRating 4: They gave him third degree treatment.\n\nRating 10: He was dropped back into the village soon afterward, where the villagers were asked not to help him gather his things, denoting that he misused government school funds.\n\nRating 8: However, seeing Bala/Balu barely able to walk, that too, under the scorching sun, all the students gathered and helped get onto a bus safely, to be taken back to city, with a heavy heart.\n\nRating 10: After Bala/Balu recovered, he took up tuitoring at his home, after many failed job interviews at the private junior colleges.\n\nRating 8: Meenakshi arrived and made it clear that she wants to stay with him only, having decided to marry him.\n\nRating 10: They saw a young boy willing to study, but was unable to, due to poverty.\n\nRating 8: His father constantly kept pressurizing him to earn money.\n\nRating 4: Bala/Balu took him to his teacher's, Mohammed Ansari's house, for tuition, free of cost.\n\nRating 3: Meenakshi asked Bala/Balu to return back to the village to teach the children.\n\nRating 7: As he was banished from the village, Bala/Balu got the idea of recording his lectures, using cassette tapes, and send them to Bittu Bhupathi  / Boothu Bhushanam  , a highly demanded photographer in Siripuram who runs a video shop in Anakapalli and local theater in Siripuram which famous for running Blue films.\n\nRating 8: He asked Bhupathi/Bhushanam to run special shows for the intermediate students from 6:00PM to 9:00PM, everyday, where only Bala/Balu's lectures would be played.\n\nRating 8: The whole village would think of it as another film.\n\nRating 7: In this way, Bala/Balu took classes for the students and also told them that, they have to pass with distinction, and also crack the TNPCEE/EAMCET examination.\n\nRating 3: To clear the students questions and clarifications regarding the subjects, Bala/Balu constantly visited the village, under the guise of a drama artist, each Sunday.\n\nRating 10: Thirupathi/Tripathi learnt about this and tried to order Muthu Pandian/Patthi Papa Rao to finish him off, to which he did not agree, stating that he was just using him.\n\nRating 10: Muthu Pandian/Patthi Papa Rao knew about Bala/Balu's toil to teach the students and had a change of heart after seeing his daughter perform really well.\n\nRating 3: He permitted all students of the village to go to junior college.\n\nRating 10: On the day of the TNPCEE/EAMCET examination, while the students were on their way to the exam center, Thirupathi/Tripathi sent goons to stop them.\n\nRating 3: Bala/Balu fought them off and sent the students to write the exam.\n\nRating 10: The students performed extremely well and cleared the TNPCEE/EAMCET examination in the top 100 ranks to their surprise Satti announces his full name as A. M. Kumar/A.S.Murthy scoring State first rank in EAMCET.\n\nRating 10: Thirupathi/Tripathi offered money to all the 46 students, promising them sponsorship for their further studies and also a good life to their families, just for them to tell everyone that they have scored such good rankings, because of Thirupathi/Tripathi Educational Institutions and not because of Bala/Balu.\n\nRating 10: Bala/Balu asked them to agree to it, because that is what he always wanted for them, everybody to respect them.\n\nRating 8: He asked the students to use Thirupathi/Tripathi's ego, to climb the social-economical ladder to become successful and give back to those in the future, who would not be able to afford education.\n\nRating 3: The students signed the contracts, but Bala/Balu and Meenakshi were never seen after that.\n\nRating 8: Present:  A. M. Kumar/A.S.Murthy continues his story to the trio that the theater where they studied is now an EAMCET/IIT coaching center for the underprivileged, developed by the 46 students, who take turns and teach the students each year by mentioning that it is their guru dakshina  to Bala/Balu sir.\n\nRating 10: When asked about the current whereabouts of Bala/Balu, A. M. Kumar/A. S. Murthy replies that he does not know about his location, or even if he is alive.\n\nRating 3: But he is sure that wherever Bala/Balu went after Sozhavaram/Siripuram, he would have made education accessible to everyone.\n\nRating 8: Meanwhile in Ooty, it is shown that a still alive Bala/Balu and Meenakshi now married have opened a school, Ansari School of Knowledge, named after Mohammed Ansari, to provide free education for the underprivileged as his Guru dakshina for inspiring him to become a good teacher as per his last wish.\n\nRating 9: In a deleted scene Abhi who became as JEE All India First Rank Holder his friend's also become toppers in the exam by the guidance of Kumar/Murthy.\n\nRating 10: In Tripati achievement ceremony Abhi reveals study videos of Bala/Balu and gives whole credit to Bala/balu sir in front of Thirupathi/Tripathi finally film ends up ruining his reputation."
},{
    "genre": "Comedies",
    "related-genre": [
        "Romantic Comedies",
        "Comedies",
        "Romantic Movies"
    ],
    "id": 81597047,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81597047",
    "index": 93,
    "name": "Varalaru Mukkiyam",
    "maturity": "U/A 13+ ",
    "duration": "2h 25m",
    "synopsis": "A wayward young man's life is turned on its head when he begins to doggedly pursue the daughter of the new family in his neighborhood.",
    "year": "2022",
    "spoilers": "\n\nRating 3: A wayward young man's life is turned on its head when he begins to doggedly pursue the daughters of the new family in his neighborhood."
},{
    "genre": "Comedies",
    "related-genre": [
        "Sports Movies",
        "Dramas",
        "Comedies"
    ],
    "id": 81615045,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81615045",
    "index": 94,
    "name": "Gatta Kusthi",
    "maturity": "U/A 13+ ",
    "duration": "2h 23m",
    "synopsis": "When wrestling champ Keerthi enters an arranged marriage with a chauvinistic Veera, she scrambles to be a traditional wife while hiding her true self.",
    "year": "2022",
    "spoilers": "\n\nRating 5: Veera who is bought up as a male chauvinist by his uncle Ratnam, is seeking a bride with his own preconceived set of conditions.\n\nRating 8: Examples include a bride who is less educated than him , have long hair, silent and obedient and does not plan to have a career as she has to devout her life to her husband.\n\nRating 3: However, he unexpectedly ends up marrying Keerthi who is the polar opposite to his expectations.\n\nRating 3: Keerthi is a wrestler who has anger issues, short hair and a University graduate.\n\nRating 8: She refuses to marry because she wants to focus on her career as a wrestling champion, however her father had a heart attack and wants her to get married.\n\nRating 8: Her uncle Ganesan arranges her marriage to him and convinces her to lie about herself and pretend to adjust to Veera's type.\n\nRating 8: Hence she has to wear hair extensions and control her anger.\n\nRating 3: She accepted Veera's marriage proposal only because he refuses dowry.\n\nRating 10: Within a few months, she had to deal with Veera and his misogyny, however when Veera was going to get killed by Dass over a political disagreement, Keerthi shows her true colors and saves his life.\n\nRating 8: This makes Veera scared of her because he is worried that she will beat him up.\n\nRating 8: This also gets everyone making fun of him that his wife is much stronger and 'manlier' than him.\n\nRating 10: Sattam, the family lawyer, shows Veera the real truth about Keerthi.\n\nRating 10: This makes Veera fearfully respect Keerthi.\n\nRating 10: With this incident, Keerthi rises to popularity.\n\nRating 10: When Ratnam returns from prison, he disrespects Keerthi because he thinks she is inferior to him, which results in Keerthi slapping him.\n\nRating 7: Veera comes to know about this and slaps her and kicks her out of the house.\n\nRating 3: Keerthi leaves the house and vows to come back only when Veera realizes his mistake and accepts that men and women are equal.\n\nRating 8: Keerthi returns home and her father enrolls her for a wrestling competition intentionally, which she refuses to apply.\n\nRating 10: To make matters worse, Ratnam and Sattam decide to file a divorce under Veera's name  through a letter.\n\nRating 8: This makes Keerthi take up wrestling.\n\nRating 10: When Veera realizes that she has signed up for wrestling, Veera decides to end his life as he lost respect .\n\nRating 3: They provoke him to fight against her to gain his masculinity.\n\nRating 5: His uncle convinces the association to have a separate wrestling match between Veera and Keerthi.\n\nRating 8: Lokesh, Keerthi's new coach who lusts after her, makes this happen for business purposes.\n\nRating 8: Veera gets trained by Kodangi, who is a traditional wrestler.\n\nRating 8: He refuses to train him initially because he wanted to be prepared for the match in 15 days, but Veera lies saying he is doing for this for his wife- which Kodangi agrees to help because he is a widower.\n\nRating 8: He trains hard and understands the pain wrestlers go through.\n\nRating 10: The day before the match, he goes to meet Ratnam but instead meets his aunt  who says that he has already lost a match against his wife and that he is not a good husband.\n\nRating 10: She reveals that Keerthi likes him and also she dreams of becoming a wrestler.\n\nRating 10: His aunt admits that she is also a University graduate but she unfortunately chose the life of marriage for the sake of family.\n\nRating 8: She says that Keerthi and many other women sacrifice their careers for the sake of family and marriage.\n\nRating 7: Veera realizes he is not a good husband and finds that Keerthi has won a lot of medals.\n\nRating 8: That night, he goes to visit Keerthi which is interrupted by Lokesh.\n\nRating 10: Lokesh lies saying that Keerthi does not want to see Veera.\n\nRating 10: Upset by this, he leaves.\n\nRating 10: On the day of the match, Lokesh tries to assault her on the pretext of comforting her.\n\nRating 8: The doctor reveals that Keerthi is pregnant, after checking her blood test  which she does not know about.\n\nRating 10: The doctor advises that Keerthi should not wrestle, which Lokesh refuses because he wants the money from the attention for the spouses fighting each other.\n\nRating 8: When the match begins, Keerthi faints and is taken to the hospital.\n\nRating 3: Veera who wants to see her is refused to by Lokesh and asks him to fight the other wrestlers, which he refuses to.\n\nRating 8: Veera then challenges Lokesh for the fight.\n\nRating 8: During the fight, Lokesh who is winning ends up telling him that Keerthi is pregnant and he was going to continue on with the wrestling between the spouses and put him up for damages for being a bad husband for a miscarriage.\n\nRating 10: Hearing this, Veera gets angry and overpowers him and wins.\n\nRating 10: He gives a speech saying that he was bought up wrong and Keerthi proved him wrong.\n\nRating 10: He tells that men and women are equal and how many women should not sacrifice their ambitions for marriage and men.\n\nRating 6: He goes to visit Keerthi and apologizes to her.\n\nRating 9: He also tells her that the divorce was his uncle's idea and the couple reconcile.\n\nRating 10: A year and half time, Veera and their daughter watch Keerthi's wrestling match which she wins."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "Thriller Movies"
    ],
    "id": 81640341,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81640341",
    "index": 95,
    "name": "Poochandi",
    "maturity": "U/A 13+ ",
    "duration": "1h 56m",
    "synopsis": "A journalist hunting for paranormal stories in Malaysia gets pulled into one himself when he interviews a man about a chilling encounter with a spirit.",
    "year": "2022",
    "spoilers": "\n\nRating 8: An image of a scarecrow is what we get in the initial frames after which we are introduced to Murugan , a Tamil journalist from Madurai, who writes paranormal stories for a magazine in Malaysia.\n\nRating 10: On his journey, he meets Shankar , who narrates a paranormal incident that happened to him and his friends Anbu  and Guru .\n\nRating 3: Anbu has paralysis and he collects coins as a hobby.\n\nRating 9: One day, they use one of the oldest coins in his collection to play Ouija and call out to a spirit for fun.\n\nRating 8: Little do they realise that they are inviting a soul that's dangerous and mysterious in many ways.\n\nRating 10: As the film progresses, the soul begins to entice them into accomplishing its own desires.\n\nRating 5: Once they start unraveling the spirit's past, they stumble upon a historic connection that dates back to many centuries.\n\nRating 3: These friends come across a chilling twist at the interval point, and post that, the film turns into an investigative thriller that tries to decode the origin of the lost soul."
},{
    "genre": "Thrillers",
    "related-genre": [
        "Dramas",
        "Action & Adventure"
    ],
    "id": 81412248,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81412248",
    "index": 96,
    "name": "Raangi",
    "maturity": "U/A 16+ ",
    "duration": "2h 1m",
    "synopsis": "When an online predator targets her niece, a bold journalist springs into action, but gets entangled with a rebel in a warring nation across the world.",
    "year": "2022",
    "spoilers": "\n\nRating 10: Thaiyal Nayagi is a fearless investigative journalist who works for an online news portal and is committed to promoting equality, democracy, and justice.\n\nRating 5: She finds herself arrested by a special police task force for the murder of Police Inspector Krishnamurthy, but is rescued by a team of FBI and CBI agents.\n\nRating 8: The story starts a few weeks earlier, where Thaiyal encounters Inspector Krishnamurthy during a routine police check and records him making inappropriate comments, which she later posts online.\n\nRating 10: The inspector retaliates by sending goons after her, but Thaiyal stands her ground.\n\nRating 10: Thaiyal's niece, Sushmitha, is supportive of her aunt and aspires to be like her.\n\nRating 8: However, she is unaware that she is being blackmailed by a college boy who threatens to release private videos of her.\n\nRating 8: Thaiyal discovers the situation and confronts the boy, discovering that a fake Facebook account was created in Sushmitha's name to talk to boys.\n\nRating 8: Thaiyal gains access to the fake account and finds that the girl behind it was being messaged by middle-aged men.\n\nRating 10: Thaiyal lures these men to a hotel room under the guise of Sushmitha and beats them up, warning them against continuing this behavior.\n\nRating 10: Thaiyal discovers one of the men who messaged Sushmitha, Aalim, did not attend their meeting.\n\nRating 8: Aalim is revealed to be a terrorist from Libya and his organization is wanted by the US authorities.\n\nRating 8: Thaiyal discovers this after connecting a photo Aalim sent with a news footage.\n\nRating 8: To find Aalim's location, Thaiyal asks for a photo and receives one of Minister Kumaravel Rajan conducting illegal deals with terrorists.\n\nRating 10: Thaiyal uploads the photo online, leading to the minister's death by Indian authorities.\n\nRating 10: Aalim's superior, Abu Farooq, finds out about the photo and forces Aalim to reveal Sushmitha's location.\n\nRating 8: Thaiyal responds that she is from India, causing Abu to send attackers after Sushmitha, but they are arrested by FBI agents.\n\nRating 10: Abu prepares to execute Aalim but is caught in a military ambush.\n\nRating 8: Aalim saves Abu's life and the latter spares him temporarily.\n\nRating 3: Aalim requests Sushmitha  to create another ID to text him and later, admits his romantic feelings to her.\n\nRating 4: One day, Thaiyal is arrested by the hate-filled Krishnamurthy, and texts Aalim about it.\n\nRating 7: Aalim, without Thaiyal's knowledge, sends assassins to kill Krishnamurthy.\n\nRating 8: Thaiyal continues to chat with Aalim and learns about his past as a Libyan terrorist.\n\nRating 10: Thaiyal begins to sympathize with Aalim and sends him pictures of her daily life.\n\nRating 10: Aalim travels to Chennai to meet Sushmitha, but Thaiyal rushes to prevent the meeting and is arrested by the special task force.\n\nRating 3: The FBI forces Thaiyal to convince Aalim to agree to a meeting in Libya.\n\nRating 8: Thaiyal and Sushmitha embark on a journey to Libya with the agents.\n\nRating 10: A local taxi driver relays the news of Sushmitha's arrival in Libya to Aalim, filling him with exhilaration.\n\nRating 3: Unbeknownst to Aalim, Abu and his associates have devised a plan for revenge and plan to eliminate Sushmitha, Thaiyal, and the accompanying agents.\n\nRating 3: However, Thaiyal fiercely fights back.\n\nRating 7: Aalim arrives and kills Abu's men to protect Sushmitha, who is unaware of his identity.\n\nRating 10: Thaiyal tries to help Aalim escape, but he cannot understand her language.\n\nRating 8: Abu finds Thaiyal, but is shot dead by the FBI agents.\n\nRating 7: The head of the agents orders his men to kill Sushmitha to draw out Aalim, who sacrifices himself to protect her.\n\nRating 10: As Aalim draws his last breaths, he professes his love for Sushmitha and presents her with a talisman she had previously gifted to a taxi driver.\n\nRating 5: Thaiyal is devastated by Aalim's passing and mourns deeply.\n\nRating 10: Afterwards, she and Sushmitha return home to India safely where she writes a book that details the story of Aalim's life."
},{
    "genre": "Drama",
    "related-genre": [
        "Dramas",
        "Romantic Movies"
    ],
    "id": 81638585,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81638585",
    "index": 97,
    "name": "Nitham Oru Vaanam",
    "maturity": "U/A 13+ ",
    "duration": "2h 25m",
    "synopsis": "Hope, romance and new beginnings suffuse stories spotlighting Tamil cinema star Ashok Selvan in three different roles.",
    "year": "2022",
    "spoilers": "\n\nRating 8: The film revolves around Arjun, a young man with OCD.\n\nRating 10: This results in him being rather closed off and seemingly rude to most of the people and happenings around him, alongside a strong dislike for trying anything new that he’s not comfortable with.\n\nRating 8: But he had a habit of imagining himself as the protagonist in any story that he is reading.\n\nRating 8: After a long time, he meets Janani, a woman who he thought understands him and starts to develop feelings for her.\n\nRating 8: Arjun-Janani's marriage preparation goes really well until due to some circumstances, Janani reconciles with her ex-boyfriend, resulting in the calling off of their wedding, which  causes depression in Arjun.\n\nRating 10: To help him overcome this hurdle, Arjun’s doctor treats him, advising him to read the short stories that she had written about two couples—Veera-Meenakshi and Mathi-Prabha.\n\nRating 10: This results in three distinct story arcs.\n\nRating 8: Veerappan alias Veera and Meenakshi is a love marriage couple where Veera is a civil engineer and Meenakshi is a mechanical engineer who plays basketball for passion.\n\nRating 10: They both share a wonderful life with each other and love their counterpart a lot.\n\nRating 10: During a rainy day, a pregnant Meenakshi is left alone in her home, while Veera goes out regarding his building, but  there, he encounters a tragic accident and then the story abruptly ends.\n\nRating 10: As usual, Arjun who imagined himself in place of Veera is left clueless and angry as to what happened to Veera.\n\nRating 3: He asks the doctor about the remaining story and she asks him to read the other diary for knowing the answers.\n\nRating 3: When he started reading, he finds that diary has story of Mathi-Prabha.\n\nRating 10: Mathivathani alias Mathi, a care free girl who wishes for a love marriage, runs away the night before marriage.\n\nRating 8: On the way, she meets Prabhakaran alias Prabha  with whom she travels in a car but later comes to know that he consumed poison because of love failure.\n\nRating 6: She admits him in hospital while Mathi's father comes to hospital looking for her.\n\nRating 4: He asks Prabha to tie wedding thread around Mathi's neck.\n\nRating 10: When Prabha is about to do so, Mathi falls unconscious with her nose bleeding.\n\nRating 10: Then, the story abruptly ends.\n\nRating 3: Arjun desperate to find answers, goes to the doctor's house to confront her.\n\nRating 10: But she says that these both the stories are real life stories and gives address of real Meenakshi-Veera who are in Kolkata and Mathi-Prabha who are in Himachal Pradesh.\n\nRating 10: Arjun decides to meet them in real to know what happened next in their lives.\n\nRating 10: While Arjun is in his journey, Subhadra alias Subha accompanies him.\n\nRating 10: First they go to Kolkata to meet Meenakshi to learn the truth, it is there that they meet Meenakshi and she narrates the rest of the story that Veera died in the building crash.\n\nRating 8: But instead of feeling sad and hopeless she feels motivated and takes her newborn baby to Kolkata to pursue her basketball career.\n\nRating 3: Now she is a basketball coach.\n\nRating 8: Arjun who feels disappointed, decides to call off but Subha forces to meet Mathi-Prabha and then decide for himself.\n\nRating 10: So they continue their journey.\n\nRating 8: There, we come to know Subha's backstory too.\n\nRating 5: For some time, we get to know about  who was in a relationship for two years.\n\nRating 10: But he dumped her for another girl.\n\nRating 8: Later he marries that girl and buys a house.\n\nRating 10: Subha is desperate to confront him and ask him the proper and logical reason for breaking up with her but never gets the guts to do so.\n\nRating 9: Later they go to Himachal Pradesh to meet the second pair.\n\nRating 10: There are accompanied by Prabha's colleague who tells that Prabha alias Prabhakaran is the Deputy Commissioner of Coimbatore and very jovial to everybody.\n\nRating 7: In a daily routine round the city, he stumbles across Mathi and feels instantly smitten by her.\n\nRating 3: Later asks Mathi's hand of marriage to her father, Senniappan, with whom he plots a plan to make her agree along with his consent.\n\nRating 10: Later when the plan goes successful so far, Mathi falls unconscious and later comes to know that she has cancer.\n\nRating 10: Then he continues to tell that even though Mathi got cancer and Prabha knew it, they both were still happy and together with each other.\n\nRating 10: Later when the duo meet Mathi and Prabha, they talk to each other, Prabha tells Arjun that we have to accept some things in life and move on.\n\nRating 10: Arjun, who changes completely because of both the stories transforms into a different person, starting to admire small things and staying happy always.\n\nRating 10: Later Arjun takes Subha to her ex boyfriend's house and makes her confront him, to which Subha slaps him and breaks his car.\n\nRating 9: In the chase from Subha's ex, Arjun confesses his feelings for Subha and Subha reciprocates.\n\nRating 7: The movie ends there as they both run from her boyfriend."
},{
    "genre": "Thrillers",
    "related-genre": [
        "Action & Adventure"
    ],
    "id": 81597751,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81597751",
    "index": 98,
    "name": "Kalagathalaivan",
    "maturity": "A ",
    "duration": "2h 19m",
    "synopsis": "A brilliant corporate whistleblower's plan to bring down a shady company turns perilous when a cold-blooded hitman is hired to hunt him down.",
    "year": "2022",
    "spoilers": "\n\nRating 3: In Chennai, Thirumaaran works as a financial analyst for Vahjra Motors, a company which manufactures heavy vehicles.\n\nRating 10: Vahjra launches one of the world's highest mileage giving trucks.\n\nRating 10: Due to this, the stocks rise high, and the company receives profits in the share market.\n\nRating 7: However, Vahjra's CEO Ved Tiwari, who is operating in Mumbai, learns that the vehicles actually emit high amounts of pollutants and decides to keep it confidential, unbeknownst to the 18 board members and 20,000 employees.\n\nRating 10: However, the truth comes into the limelight, which enrages Tiwari and shocks the entire company.\n\nRating 3: Tiwari hires Arjun, an ex-commando-turned-private investigator to track down the whistleblower behind the leaking of the matter.\n\nRating 3: Arjun investigates using violent ways and unearths a network of employees working against the company.\n\nRating 10: Arjun suspects JP from Vahjra's Chennai regional headquarters to be the whistleblower and finally catches him.\n\nRating 8: JP tells that he does not know about the whistleblower, but reveals about Vahjra's involvement in corporate funding by buying government factories which resulted in people losing jobs, and also reveals about the whistleblowers involved in exposing various international corporates.\n\nRating 10: Checking the CCTV footage, Arjun captures Thiru's friend Karthik and kills him, where he also finds that his identity documents are bogus.\n\nRating 3: Arjun finds a surgerical scar in Karthik's body and enquires the hospital about the treatment.\n\nRating 10: He learns that the man posing as Karthik is Gandhi and learns about Thiru, where he also learns that Thiru and Gandhi were best friends who were working as financial analysts in international companies situated in Hong Kong and USA.\n\nRating 10: After learning that Thiru is the whistleblower, Arjun learns about Thiru's guardian Bharathi and tries to use her to trace Thiru, but Bharathi commits suicide.\n\nRating 6: Arjun finds about Thiru's ex-girlfriend Maithili and manages to trace Thiru and brings him to an abandoned chemical factory in order to kill him.\n\nRating 3: However, Thiru manages to finish Arjun's accomplices and fights with Arjun, where Thiru manages to kill him.\n\nRating 3: Later, it is revealed that Thiru's parents, Gandhi's father, and Bharathi's husband were working as chemists in the same abandoned chemical factory, which was purchased by Vahjra Factory.\n\nRating 10: Thiru's parents and Gandhi's father learnt about the chemical pollutants that were leaked by Vahjra and filed a complaint against them, but they were killed by Tiwari and the corporates.\n\nRating 5: Upon learning this, Thiru and Gandhi became whistleblowers in order to expose Vahjra's illegal activities.\n\nRating 10: The next day, Tiwari dies of a stroke after learning that their deal with TVG, a startup company in Germany, has actually been sold to a Russian mafia company.\n\nRating 10: Due to association with TVG, Vahjra's business is shut down by the government.\n\nRating 3: It is revealed that the TVG startup's chairman is actually Thiru's friend Velmurugan and their plan was to attract Vahjra in order to shut down the company.\n\nRating 3: Six months later, Thiru joins another company to expose their illegal activities as a whistleblower."
},{
    "genre": "Comedies",
    "related-genre": [
        "Romantic Comedies",
        "Comedies",
        "Romantic Movies"
    ],
    "id": 81582584,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81582584",
    "index": 100,
    "name": "Hey Sinamika",
    "maturity": "U/A 13+ ",
    "duration": "2h 27m",
    "synopsis": "An unhappy Mouna plots to divorce her talkative husband Yaazhan, and asks therapist Malarvizhi to woo him — but faces a dilemma when love blooms.",
    "year": "2022",
    "spoilers": "\n\nRating 10: Yaazhan and Mouna fall head over heels in love with each other and get married.\n\nRating 10: After two years of marital life, Mouna becomes annoyed by Yaazhan's overly affectionate and talkative nature.\n\nRating 5: She decides to separate from him to live a life of her own and on her own terms.\n\nRating 7: One day, Yaazhan meets a psychiatrist named Dr. Kajal Malarvizhi.\n\nRating 8: Mouna devises a scheme with Malarvizhi to make him fall in love with her so that she can use it as an excuse to get divorced.\n\nRating 10: However, Malar strikes a good rapport with him and the two form a close bond.\n\nRating 10: Malar begins to fall in love with Yaazhan, and although he is unaware, he blossoms with his newfound career as an RJ and with his friends.\n\nRating 3: Meanwhile, Mouna realizes she is losing Yaazhan and schemes to separate them, setting Malar up to be discovered by Yaazhan.\n\nRating 3: Malar professes her love to Yaazhan, who is confused and troubled.\n\nRating 6: Mouna tells Yaazhan the truth about their scheme and that Malar's love is not real.\n\nRating 10: Yaazhan is devastated and leaves after telling Mouna that she gave up on him and doesn't deserve his love anymore.\n\nRating 8: He starts divorce proceedings, leaving Mouna heartbroken.\n\nRating 10: Malar is happy at first, as she thinks Yaazhan reciprocates her love.\n\nRating 9: However, Yaazhan tells her that though he can't be with his wife, he does not see anyone else in her place.\n\nRating 3: Yaazhan tells Malar that he believed she was truthful in her time with him and leaves a heartbroken Malarvizhi.\n\nRating 5: Mouna learns about Yaazhan's conversation and realizes how much she had hurt Malar, and apologizes to her for involving her in the scheme and causing her heartbreak.\n\nRating 10: Six months later, Mouna and Yaazhan meet at family court, where he ignores her.\n\nRating 6: Mouna asks Yaazhan about why he smiled the day he saw Malar sitting opposite him at the shop.\n\nRating 3: Yaazhan tells her that he was thinking about Mouna the day he met her for the first time in similar cafè, and didn't even realize it was Malar who was sitting across from him because he was thinking of Mouna.\n\nRating 10: As Yaazhan starts walking away, Mouna realizes how much he had loved her and she had tested him.\n\nRating 10: She runs after him and begs for forgiveness, telling him how much she loves him, where the two reunite.\n\nRating 8: Malar takes up Yaazhan's RJ job and decides to spend the rest of her life fixing troubled marriages through her new job."
},{
    "genre": "Romance",
    "related-genre": [
        "Dramas",
        "Romantic Movies"
    ],
    "id": 81464602,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81464602",
    "index": 101,
    "name": "O Kadhal Kanmani",
    "maturity": "U/A 13+ ",
    "duration": "2h 13m",
    "synopsis": "It's love at first sight for a young couple repelled by the concept of marriage, but their view shifts when they meet their older-couple neighbors.",
    "year": "2015",
    "spoilers": "\n\nRating 3: Aditya Varadarajan  is a video game developer who accidentally meets Tara Kalingarayar  at his colleague's wedding.\n\nRating 3: He later finds out that she is planning to pursue her studies in Paris.\n\nRating 10: They soon begin to call each other often, go out together, and start to fall in love during a holiday that they take together.\n\nRating 3: They agree that marriage is not for them and decide to have a live-in relationship instead, and Tara moves into Adi's place, rented from Ganapathy.\n\nRating 10: They wish to spend their time with each other before they go their separate ways for their respective careers.\n\nRating 10: Tara and Adi live happily, being playful with each other.\n\nRating 8: One midnight, Tara has a conversation with Ganapathy .\n\nRating 10: She tells him that she might get her visa approved for going to Paris, and that it is hard for her to leave Adi and go far away.\n\nRating 10: The next day, Tara goes to Jaipur for her business, and Adi starts to miss her terribly.\n\nRating 10: Upon seeing the love and patience that Ganapathy has for his wife Bhavani, an Alzheimer's patient, who one day even forgets the way to her own house, they begin to understand the importance of each other's presence in their life.\n\nRating 10: Soon, Adi is selected to develop his skills in video games and to go to US.\n\nRating 9: He tells his colleague that it is hard for him to leave Tara.\n\nRating 10: The next day, both of them make an agreement to enjoy themselves to the maximum for the 10 days left before they separate.\n\nRating 8: Nearing the last day, they begin to have little fights and arguments, which do not last long.\n\nRating 10: One day, Bhavani goes missing again, as she did when she forgot her house address.\n\nRating 3: While looking for her, they continue arguing about their relationship.\n\nRating 10: Finally, Adi proposes to Tara, and they decide to get married.\n\nRating 10: Post marriage, both of them continue to accomplish their own dreams, one in Paris, another in the US.\n\nRating 8: In the post credits, it is shown that Adi has finished his project in US and has moved to Paris where they reunite and have a baby and arrive in India."
},{
    "genre": "Drama",
    "related-genre": [
        "Romantic Comedies",
        "Crime Movies",
        "Dramas",
        "Comedies",
        "Romantic Movies"
    ],
    "id": 81176205,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81176205",
    "index": 102,
    "name": "Kannum Kannum Kollaiyadithaal",
    "maturity": "U/A 13+ ",
    "duration": "2h 40m",
    "synopsis": "Two wily online scammers mend their fraudulent ways after meeting the girls of their dreams — until a deceitful discovery throws their world for a loop.",
    "year": "2020",
    "spoilers": "\n\nRating 3: Siddharth and Kaliswaran Moorthy are two youngsters in Chennai who apparently have no family and are living alone.\n\nRating 8: They are shown as freelance techies working from home.\n\nRating 3: Siddharth falls for a door-to-door beautician, Meera.\n\nRating 10: He proposes to her and she accepts.\n\nRating 8: Kallis has a crush on Meera's friend, Shreya, a chef.\n\nRating 3: Meera is revealed to be an orphan brought up in an orphanage and Shreya is revealed to be sent away to fend for herself as her family faces trouble from loan sharks back in her hometown.\n\nRating 10: The guys spend their money and soon realise they are running low.\n\nRating 8: This is when it is shown that they are con artists, who use online shopping scams to earn money.\n\nRating 6: DCP Pratap Chakravarthy begins to investigate their scam when his daughter's laptop explodes.\n\nRating 10: He realizes that the scammers use the addresses of abandoned houses and public Wi-Fi to order electronic products on online platforms and return or re-sell them online after replacing original internal parts with old and duplicate ones.\n\nRating 10: As DCP Pratap tries to track down the culprits, Siddharth changes their plan and now the boys loot expensive items from luxury cars by developing a device that hacks into the locking systems of such cars.\n\nRating 8: Pratap almost closes down on them when the boys steal his friend's laptop from his car and try to sell it, but the boys escape successfully.\n\nRating 3: Meera calls Siddharth and informs him that her handbag was snatched.\n\nRating 10: She cries that though only ₹3,000  was stolen, it had been hard-earned money.\n\nRating 3: Siddharth feels guilty and the friends decide to mend their ways.\n\nRating 3: They decide to settle in Goa by starting a restaurant with the remaining money from their scams and move to Goa with Meera and Shreya.\n\nRating 10: Pratap tracks down the boys' address only to find the house vacated.\n\nRating 10: He soon follows them to Goa.\n\nRating 8: It is then shown that, though Pratap was investigating the online electronic products scam and the car thefts.\n\nRating 8: He had actually begun tracking Meera and Shreya, who are even bigger con artists than Siddharth and Kallis.\n\nRating 8: He informs them that the girls' motive is to make men fall for them, then loot their money.\n\nRating 3: He had initially identified Meera as one of the con artistes using a distinctive necklace that had been in the handbag snatched from her, then identified her connection to the guys, following which he had gone to Siddharth and Kallis's former home in Chennai and had eventually traced them to Goa.\n\nRating 10: Siddharth and Kallis find their bag of money missing and are heartbroken to discover that the girls they had truly loved had cheated them.\n\nRating 3: They hitchhike to Chennai with empty pockets and slowly use their criminal minds to find the girls.\n\nRating 8: They figure out that the girls are at Delhi, with Meera in the identity of Ishita, a freelance room arrangement consultant and confront them.\n\nRating 5: Shocked, the girls return the bag of money and ask them to leave, but Siddharth proposes that they team up and share the amount they steal in the next venture.\n\nRating 10: If the girls fall for them in the process, they will remain together.\n\nRating 8: Otherwise, they plan to share the loot and part ways.\n\nRating 5: It is also revealed that Meera's real name is Madhumitha and Shreya's real name is Varsha, and that both of them were orphans in the same orphanage, who had taken to con artists after being fed up of the deceit in society, especially its men.\n\nRating 10: Madhu and Varsha agree to Siddharth's deal.\n\nRating 8: They decide to target a rich, old businessman named Sooraj Mehta, who is in love with Madhu  in meditation class.\n\nRating 6: Varsha also befriends Sooraj's wife in gym.\n\nUsing their technological brain,  the gang slowly break down the security features in Sooraj's car and house.\n\nRating 8: Using a spycam in Madhu's phone and a voice recorder designed as a bracelet.\n\nRating 8: However, they realize that  Suraj is a drug baron, who has US$1 million in his house, which is equivalent to ₹ 71 crore.\n\nRating 5: When the others decide to play safe by dropping the plan, Siddharth convinces them to stay on, and flee overseas after the heist to avoid Sooraj's wrath.\n\nRating 10: They plan to enter the garage in Sooraj's house by using his Rolls-Royce and get his fingerprint to enter the locker room using a 3D printer.\n\nRating 3: As per Siddharth's plan, Varsha is to spend the day shopping with Sooraj's wife and Madhu is to spend time with Sooraj, while the guys loot the money using Sooraj's car.\n\nRating 3: They plan to hijack Sooraj's car while it is parked at the Hyatt Hotel car park, and use it to enter Sooraj's compound, knowing that they will not be seen as the car's windshield and windows are tinted.\n\nRating 10: However, their plan changes when Sooraj drives to his private guesthouse instead of the Hyatt Hotel, to the surprise of Madhu and the others.\n\nRating 3: Shocked, the guys follow the car to a suburban area.\n\nRating 7: Madhu is inside with Sooraj and the guys have only one hour to complete the heist, instead of the two that they had planned for.\n\nRating 3: Siddharth tells Kallis that Sooraj's car is advanced and can be hacked to do many things.\n\nRating 3: He opens an app he had devised and has the car drive itself out of the guesthouse, with some help from Kallis.\n\nRating 5: They then drive to Sooraj's house and safely enter the garage but finds out that to enter through the second security door in the garage, a pattern is required.\n\nRating 10: Siddharth asks Madhu to find out Sooraj's phone pattern and the guys successfully enter the garage.\n\nRating 3: With the 3D printed thumbprint, they enter the locker room, open the locker and steal the money.\n\nRating 8: Madhu fakes a fainting and a nosebleed and the guys return the car to the guesthouse, just in time for Sooraj to rush an 'unconscious' Madhu to the hospital.\n\nRating 8: When Sooraj goes in to bring out the doctors, Madhu escapes.\n\nRating 7: Since it would be impossible to take the cash out of the country through an airport without raising suspicion, Siddharth tells that they are going to Thailand by road and the pairs set off on their bikes.\n\nRating 3: However, they encounter Pratap doing vehicle checks at their hotel gate and Siddharth devises a plan quickly.\n\nRating 8: Before the guys leave to confuse Pratap, the girls reveal that they have fallen in love with them.\n\nRating 10: Happily, the guys rush off and tell Pratap that the girls are escaping in a white car.\n\nRating 7: Following a car that the guys point out, Pratap assumes that they are going to the airport.\n\nRating 10: He then assaults a security guard at the airport and breaches the airport security to apprehend the girls, and the guys escape.\n\nRating 10: Siddharth and Kallis call Madhu and tell the girls that they have all the money and that the bags in the bikes are empty.\n\nRating 6: They say that it is their plan of vengeance and that the cops will reach their location in a few minutes.\n\nRating 3: The girls are left shocked and devastated, and tell themselves that they deserve this for cheating Siddharth and Kallis in the first place.\n\nRating 10: However, when the police vehicle enters the hideout, Siddarth and Kallis get out of the car and say that they were just messing around and that the money really had been in the bags that the girls had.\n\nRating 3: They say that because the girls didn't try to run away but stayed on feeling they deserved this for cheating Siddharth and Kallis, they think the girls have really started loving them and both couples reconcile and decide to settle down.\n\nRating 10: In Chennai, Pratap is being questioned by the CBI for breaching airport security and for abandoning a high-profile match-fixing case that he had been working in Delhi  to go after two girls who are small-scale cheaters.\n\nRating 3: It is revealed that Pratap was also a victim of Madhu's scams.\n\nRating 8: In a scene mimicking a scene from Gautham Vasudev Menon's romantic film Vinnaithaandi Varuvaayaa, he had gifted her a rare, expensive necklace to Madhu — the same one that he had used to track her down when her handbag was stolen in the first place.\n\nRating 10: Ashamed to declare that he was also a victim, Pratap hangs his head low\n\nRating 10: and it is indicated that he might face a suspension for abandoning his match-fixing case.\n\nRating 8: Back at Sooraj's house, Sooraj watches a CCTV footage of Siddharth and Kallis stealing the money but their face is hidden.\n\nRating 6: The guys have used infrared flashlights on their caps, which have deceived the camera.\n\nRating 8: Sooraj cannot complain to the cops as it is illegal money.\n\nRating 8: As they are camping on their way to Thailand, Madhumita sees her name tattooed on Siddarth's forearm and she guiltily tells that it is not her real name, only to get deceived as Siddarth, who rubs the ink off and Varsha reveals herself as Thenmozhi and Madhumita asks Siddharth to guess her name and all four of them squabble on."
},{
    "genre": "Drama",
    "related-genre": [
        "Dramas"
    ],
    "id": 81244361,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81244361",
    "index": 103,
    "name": "Laabam",
    "maturity": "U/A 13+ ",
    "duration": "2h 21m",
    "synopsis": "A nomadic farmer returns to his village to revive its agricultural practices, but discovers that a wealthy industrialist wants to usurp the farmlands.",
    "year": "2021",
    "spoilers": "\n\nRating 10: Pakkiri returns to his native place after an exile and straight away takes on the village head Vanagamudi.\n\nRating 10: With the support of the locals, he becomes the president of the village and decides to give agriculture a new touch with his techniques.\n\nRating 10: The rest of the story is about how Pakkiri manages the local goons with the help of Clara and comes out victorious."
},{
    "genre": "Drama",
    "related-genre": [
        "Romantic Comedies",
        "Dramas",
        "Comedies",
        "Independent Movies",
        "Romantic Movies"
    ],
    "id": 81218363,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81218363",
    "index": 104,
    "name": "Sillu Karuppatti",
    "maturity": "U/A 13+ ",
    "duration": "2h 13m",
    "synopsis": "From first crushes to post-marriage relationships, love and connection are at the heart of the four interwoven stories in this anthology film.",
    "year": "2019",
    "spoilers": "\n\nRating 8: Maanja , the teenaged ragpicker, begins to crush on Mity , a girl from a wealthy household, after stumbling upon her photo in the garbage from her home.\n\nRating 8: Soon, he begins to collect knickknacks from her garbage everyday – a seemingly broken Walkman that has a recording of her song  and a ring that holds emotional value.\n\nRating 8: But given their class difference, can he muscle up courage to give these back to her?\n\nRating 10: And will she be able to see his ‘love’?\n\nRating 10: Madhu  and Mugilan  have a friendship that eventually blossoms into love.\n\nRating 10: Mugilan works for a company and creates memes.\n\nRating 10: Madhu is a fashion designer.\n\nRating 8: They both share a cab quite often.\n\nRating 10: Soon, Mugilan is diagnosed with scrotum cancer, and Madhu gives him love and hope.\n\nRating 10: A widower Navaneethan  spots Yashoda  playing at a park and is instantly smitten by her.\n\nRating 10: They get acquainted at the hospital – they are undergoing a master health checkup – and open up to each other about their respective lives over a turtle walk.\n\nRating 3: While they have no problem beginning a conversation, unlike youngsters who have fallen in love, the doubts that crop up are more or less similar – \"does he/she really love me?\".\n\nRating 10: A couple rediscovers passion after 12 years into their marriage when love has all but gotten lost in the mundanities of everyday life.\n\nRating 10: The husband, Dhanapal  has no time for his wife, Amudhini  and her needs, both physical and emotional – though he does seem to be a good father to his kids.\n\nRating 10: When Amudhini complains that he barely notices her – when other men compliment her on her new hairstyle – he shoots back that he is going bald\n\nRating 10: but she, too, has not been giving that any notice.\n\nRating 10: And when Amudhini reaches the end of her tether with Dhanapal's uncaring attitude, he tries to compensate by gifting her a virtual assistant – hoping that she would leave him alone as she now has someone to speak to."
},{
    "genre": "Drama",
    "related-genre": [
        "Dramas"
    ],
    "id": 81471154,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81471154",
    "index": 106,
    "name": "Mughizh",
    "maturity": "U/A 13+ ",
    "duration": "59m",
    "synopsis": "To help his daughter with a fear of dogs, a father brings home a pup. But when tragedy strikes, the whole family must learn to overcome grief together.",
    "year": "2021",
    "spoilers": "\n\nRating 10: Mughizh \n\nKavya a 12-year-old girl embraces solitude and exists like an island within herself.\n\nRating 10: Her parents decide to make inroads into that island, wanting her to face her fears head on.\n\nRating 10: Being completely aware that the 'doggie zone' is a realm that is completely out of bounds for her, they still go ahead and bring a puppy home.\n\nRating 3: Well, what transpires when this darling monster steps into this household?\n\nRating 8: Does the wall within Kavya break, and when this decision of the parents backfires, do demons pile up adding on to the already existing fears within Kavya?\n\nRating 10: Or does this mammoth experience transform her, and does it propel her to blossom, exuding the first ever enriching fragrance of life.\n\nRating 3: Her parents are at the threshold of assessing their parental skills and decisions. \"\n\nRating 10: Mughizh\", is about a family 's life journey, where each member finds a new fragrance that would change the prism they view life through for posterity."
},{
    "genre": "Comedies",
    "related-genre": [
        "LGBTQ Movies",
        "Dramas",
        "Comedies",
        "Thriller Movies"
    ],
    "id": 81128584,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81128584",
    "index": 107,
    "name": "Super Deluxe",
    "maturity": "A ",
    "duration": "2h 55m",
    "synopsis": "Sex, stigma and spirituality merge in these eccentric stories of an angsty teenager, an unfaithful wife and a transgender woman returning to her past.",
    "year": "2019",
    "spoilers": "\n\nRating 3: Jyothi and her son Rasukutty are awaiting the return of Rasukutty's father, Manickam, who abandoned the family seven years ago.\n\nRating 10: To their shock, Manickam arrives from Mumbai as a trans woman, Shilpa.\n\nRating 10: Rasukutty wants to introduce Shilpa to his friends at school.\n\nRating 8: On the way, a bigoted cop detains Shilpa, and she is forced into fellating a corrupt police officer named Berlin.\n\nRating 10: Shilpa faces further harassment and humiliation from people at her son's school.\n\nRating 8: Distraught, Shilpa buys a ticket to return to Mumbai, where she lives as a hijra.\n\nRating 10: On the way home from school, Shilpa loses Rasukutty.\n\nRating 3: Now desperate to find her son, she goes to the police and meets Berlin, pleading with him to help her.\n\nRating 8: After refusing to entertain Berlin for any sexual favors, she grapples with Berlin and places a death curse on him before escaping.\n\nRating 8: Shilpa gets saddened and finally decides to go home and finds Rasukutty there.\n\nRating 3: Rasukutty reveals he discovered Shilpa's intention of abandoning them again after seeing the train ticket to Mumbai in her purse, leading to an emotional confrontation where Shilpa realizes that Rasukutty and Jyothi are ready to accept her as she is, and they all go on living together.\n\nRating 8: Five teens  skip school and gather to watch a porn movie at Thuyavan's home, only to find out that the porn star is Soori's mother, Leela.\n\nRating 10: Soori breaks the TV in a fit of rage and runs away, crying.\n\nRating 6: Thuyavan, afraid of his father finding out about the broken TV, enlists Gaaji and Vasanth into getting enough money for a new TV by the evening.\n\nRating 10: They accept a job from a local gangster but fail to complete their assigned task.\n\nRating 10: They then try to steal a North Indian pawnbroker's house, which fails too.\n\nRating 8: Attempting to steal from him again, they are confronted by a girl with magical powers at the home who reveals herself to be an alien.\n\nRating 3: She duplicates Gaaji, keeping one clone with herself for companionship.\n\nRating 8: The friends get money from her to buy a new TV.\n\nRating 10: They toss out the old broken TV through the broken roof of a disused building and set off to a cinema hall to finally watch a porn film.\n\nRating 8: Reaching home, an enraged Soori runs towards Leela with a screwdriver, intending to kill her after finding out she acted in a porn film.\n\nRating 10: He trips and falls on the staircase and inadvertently stabs himself in the abdomen.\n\nRating 8: A distraught Leela takes him to the hospital, and his father Arputham  is informed about the accident.\n\nRating 10: Arputham is a survivor from the 2004 Indian Ocean tsunami who believes that God saved him in the form of a Jesus statue which he held onto when the tsunami struck.\n\nRating 10: He converted to Christianity after this experience, but is currently having a crisis of faith.\n\nRating 3: Arputham forcibly takes Soori from Leela and subjects Soori to faith healing at his chapel while locking her out.\n\nRating 10: Leela then gets her son admitted to a hospital with the help of a local counselor after she unsuccessfully pleads with her husband, but she now struggles to arrange for medical expenses.\n\nRating 6: It is then revealed that Arputham's crisis of faith was triggered by a conversation with Shilpa earlier, when Shilpa, having lost Rasukutty, confesses her guilt to him over unknowingly escorting and delivering two children to a criminal gang, where the children were mutilated to make them more effective beggars, fearing that her karma has caught up with her and that her son might end up with a similar fate.\n\nRating 10: Arputham states there can be no forgiveness for a person like her and tells her that she would be better off dead.\n\nRating 5: Before leaving him, Shilpa tells Arputham that she tried to drown herself during the 2004 tsunami but survived by holding onto a rock, but didn't attribute any divinity to it, unlike Arputham.\n\nRating 7: Arputham breaks the Jesus statue out of rage and desperation and finds long-forgotten diamonds inside it, which he uses to pay for Soori's medical expenses.\n\nRating 10: Leela asks him whether he still have faith if he had been saved by clinging onto a teddy bear instead of Jesus.\n\nRating 10: He reflects on that question while Soori reconciles with Leela.\n\nRating 10: Vaembu, an unhappily married woman forced into an arranged marriage, has sex with her ex-boyfriend while her husband Mugil is away, but her ex-boyfriend suddenly dies in the act.\n\nRating 6: Mugil returns home to find the corpse.\n\nRating 8: While devastated to discover that his wife had been cheating on him, he decides to dispose of the body as he didn't want this incident to be exposed, fearful of the stigma attached to having an unfaithful wife.\n\nRating 10: Eventually, Vaembu and Mugil manage to smuggle the corpse out of town and attempt to plant the corpse in a car on the railway track to stage the death as an accident.\n\nRating 3: But they are caught by Berlin , who blackmails the couple in return for sexual favours from Vaembu.\n\nRating 10: As he advances towards the unwilling and distraught Vaembu, intending to have sex with her, but the old TV thrown by the boys  falls on his head and kills him.\n\nRating 10: The couple gets rid of both the corpses and reconciles with each other.\n\nRating 5: The friends from the TV story are finally watching a porn film at the theatre, where they starts with a doctor speaking philosophically about the mysteries of life and patterns through the universe, with everything being interconnected in ways as yet unknown to us.\n\nRating 10: He then says he will reveal some of those secrets and winks.\n\nRating 9: The nurse nearby blinks and starts to take her clothes off, as the porn film title shows its name Vaazhvin Ragasiyam ."
},{
    "genre": "Drama",
    "related-genre": [
        "Crime Movies",
        "Dramas",
        "Action & Adventure"
    ],
    "id": 81337210,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81337210",
    "index": 108,
    "name": "Doctor",
    "maturity": "U/A 16+ ",
    "duration": "2h 29m",
    "synopsis": "When his fiancée’s niece is kidnapped, a stoic army doctor and his motley team launch a rescue operation in which they need both wit and their wits.",
    "year": "2021",
    "spoilers": "\n\nRating 10: Varun, a military doctor working in the Indian Army Medical Corps is a strict and practical person.\n\nRating 7: While returning home from an operation, he receives a voicemail from his fiancée, Padmini,  who urges him to call off their upcoming wedding.\n\nRating 8: While enquiring about her sudden change-of-decision with her family.\n\nRating 10: Padmini belittles him for being emotionally distant and apathetic.\n\nRating 8: While leaving, Varun and Padmini's family learns that Chinnu, Padmini's niece, has gone missing.\n\nRating 7: The family lodges a complaint with the police – which in turn appoints Bhagat, a low-ranking police officer, to monitor the family's communications.\n\nRating 10: Disillusioned with the police's sluggish progress, Varun plots to kidnap the ACP's daughter, believing that the resulting investigation would be more competent.\n\nRating 10: His plan works, and the police nab almost every major criminal related to child-kidnapping.\n\nRating 3: Varun singles out three criminals , noticing that they were present around Chinnu's school at the time of her disappearance.\n\nRating 3: Varun sedates them, and interrogates them by blackmailing them with their kidneys that he had apparently removed.\n\nRating 3: Kamala Kannan confesses to kidnapping Chinnu and handing her over to a child-trafficking network.\n\nRating 10: Varun recruits Pratap and two other gangsters, Mahaali and Killi, to assist in his investigation.\n\nRating 3: Varun's search leads him to twins Alvin and Melvin, both of whom are responsible for child-trafficking and prostitution.\n\nRating 7: Varun and Padmini's family confront the duo inside a Chennai Metro train, and succeed in separating the duo and abducting Alvin.\n\nRating 3: Desperate to save Alvin, Melvin concedes to release only one girl from his group of kidnapped girls.\n\nRating 8: Although Chinnu is among them, Varun demands Melvin to release all the girls, despite Padmini's objections.\n\nRating 7: Melvin refuses, but hints that the girls are being taken to Goa.\n\nRating 8: Varun, Pratap, Mahaali, Killi and Padmini's family follow Melvin to Goa, where they discover that the true mastermind behind the recent kidnappings is Terry, the owner of a high-end resort.\n\nRating 3: Varun orchestrates a drama, in which he has Mahaali, Killi Padmini act as if the duo were kidnapping her and simultaneously has Padmini's family urge Terry to find her.\n\nRating 3: As per his plan, Terry traces Padmini's kidnapping down to Varun, who poses as a child-trafficker masquerading as the owner of an ice-cream parlour.\n\nRating 8: Varun demands Terry to give a girl to him, as compensation for saving Padmini.\n\nRating 3: Unbeknownst to Terry, Varun had arranged for his friend, Colonel James Anderson and his team of commandos to apprehend Terry.\n\nRating 10: Terry escorts Varun to his base of operations, located on a remote island.\n\nRating 3: Varun discovers than Terry's victims are primarily underage girls.\n\nRating 8: Realising that any action would endanger the kidnapped victims' and Chinnu's lives, Varun calls off the operation despite James' protests.\n\nRating 10: Determined to save the girls' lives, Varun initiates his backup plan.\n\nRating 3: He negotiates a deal with Terry and Terry's father to ship a consignment of 40 girls to Don Pablo El-Fino– a fictitious Brazilian child-trafficking's boss .\n\nRating 10: Concurrently, Terry organises a meeting with his associates to discuss the upcoming deal; Melvin is among those in attendance.\n\nRating 10: Varun discreetly orders Melvin to kill Terry; the latter's attempt to do so is surprisingly thwarted by Varun himself .\n\nRating 3: Terry interrogates Melvin, learning about Alvin's abduction and that Melvin's actions were purely out of desperation.\n\nRating 10: Unwilling to reveal the identity of Alvin's abductor, Melvin is killed by Terry.\n\nRating 8: Later, while going through the family profiles of the twins's latest kidnaps, Terry discovers Padmini's family is among them and deduces Varun's plan.\n\nRating 6: Terry later has Varun and the family apprehended and takes them to his island, intending to kill them.\n\nRating 5: However, Alvin appears, seeking revenge for Melvin's death.\n\nRating 8: Alvin reveals he had abducted Terry's father and agrees to spare him, in return for letting Varun and the family along with all the other girls leave.\n\nRating 8: After they leave, Alvin kills Terry's father to avenge Melvin's death, where Terry kills him in retribution.\n\nRating 9: Elsewhere, Varun realises that he had left a girl behind and returns to the island alone.\n\nRating 8: Terry apprehends Varun and plans to kill the lone girl in front of him, but is thwarted by James's team and Bhagat, who had infiltrated his base.\n\nRating 8: Varun escorts the girl to safety while James's team kill Terry and his henchmen.\n\nRating 10: 3 months later, Padmini reconciles with Varun and they get married in presence of their family and friends."
},{
    "genre": "Comedies",
    "related-genre": [
        "Romantic Comedies",
        "Comedies",
        "Romantic Movies"
    ],
    "id": 20088906,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/20088906",
    "index": 109,
    "name": "Jeans",
    "maturity": "U/A 13+ ",
    "duration": "2h 45m",
    "synopsis": "When the father of the man she loves insists that his twin sons marry twin sisters, a woman creates an alter ego that might be a bit too convincing.",
    "year": "1998",
    "spoilers": "\n\nRating 10: Nachiappan is a wealthy and successful Indian American restaurateur based in Los Angeles.\n\nRating 8: He has two sons – Viswanathan \"Visu\" and Ramamoorthy \"Ramu\" – who are identical twins.\n\nRating 7: They both are medical students and spend their evenings helping out their father alongside the restaurant's chief cook, Juno.\n\nRating 8: One evening, when Visu & Ramu go to the airport to do their lunch supply, Visu sees an Indian Tamil family from Chennai – Madhumitha \"Madhu\", her younger brother Madhesh, and their grandmother Krishnaveny – having some problems with the immigration authorities.\n\nRating 6: Visu pitches in to help and learns that they just flew in from India so that Krishnaveny can undergo a surgery to remove her brain tumour.\n\nRating 8: After many confusions, the trio meets with Ramu also.\n\nRating 10: The twins arrange for the three to reach their host.\n\nRating 3: Krishnaveny is admitted in the hospital where Visu works as a resident doctor and the surgery is performed.\n\nRating 8: Visu soon realises that Krishnaveny is paralysed as she was operated on the wrong side of her brain due to a mix-up with another patient.\n\nRating 10: He appeals aggressively to the doctors and has the error corrected by another surgery, then spearheads an angry fight for compensation.\n\nRating 8: The hospital compensates US$2 million to avoid a court case.\n\nRating 10: Due to these actions, Madhu soon falls in love with Visu.\n\nRating 10: Krishnaveny soon realises that Madhu and Visu are in love and extends the family's stay in the US.\n\nRating 3: However, Nachiappan objects to the romance as he wants his sons to marry identical twin girls.\n\nRating 7: In a flashback, it is shown that Nachiappan had an identical twin brother Pechiappan, who lives in Karaikudi and is a simpleton.\n\nRating 10: They both married for love in their youth, but Pechiappan's wife Sundarambal tortured and abused Nachiappan's pregnant wife Meiyaththa so badly that the latter died after giving birth to Visu and Ramu.\n\nRating 8: Nachiappan eventually left the house along with Visu and Ramu to prevent Pechiappan and Sundarambal from separating over Meiyaththa's death.\n\nRating 3: Krishnaveny decides to solve the problem by lying to Nachiappan that Madhu does have an identical twin named Vaishnavi, who was raised separately in an orthodox Brahmin household.\n\nRating 10: The reason for their separation is claimed that \"having twins would bring bad luck on their family\".\n\nRating 3: Nachiappan falls for the lie and leaves for India along with Visu, Ramu, Juno, Krishnaveny, Madhu and Madhesh in order to \"meet\" Vaishnavi and fix the marriages of Visu and Ramu with Madhu and Vaishnavi respectively.\n\nRating 3: Krishnaveny has Madhu pose as Vaishnavi, who contrary to Madhu, is very demure and traditional in nature.\n\nRating 8: Ramu immediately falls in love with Vaishnavi, unaware that she is Madhu.\n\nRating 10: Meanwhile, Pechiappan, whose marriage with Sundarambal has worsened due to the latter's inability to have children, attempts suicide.\n\nRating 10: Nachiappan rescues him and hatches a plan to unite both the families through Visu's and Ramu's marriage plan.\n\nRating 10: Nachiappan impersonates Pechiappan and leaves for Karaikudi, where with his business sense and practical nature, he rescues Pechiappan's failing restaurant business and eventually reforms Sundarambal as well.\n\nRating 10: Pechiappan takes Nachiappan's place and stays with Visu and Ramu.\n\nRating 10: Eventually, Madhu, realising that Ramu is madly in love with her alter-ego, decides to stop acting as Vaishnavi as she feels she is hurting Ramu's as well as Visu's feelings through her act.\n\nRating 10: Visu too finds out in parallel that Vaishnavi does not exist.\n\nRating 8: Enraged, Visu and his family immediately leave Madhu's house, but Ramu tells him that Madhu had lied due to her love for him and convinces him to reconcile with her.\n\nRating 8: Ramu further manages to convince his father, unaware that he is his uncle Pechiappan, to get Visu and Madhu married.\n\nRating 8: When Nachiappan realises the truth and finds out that Visu and Madhu are getting married, he immediately rushes to Chennai with Sundarambal and stops the wedding.\n\nRating 3: At this point, it is revealed that both Nachiappan and Pechiappan had impersonated each other in order to reunite both the families.\n\nRating 8: Sundarambal manages to convince Nachiappan to get Visu and Madhu married since Madhu, by posing as Vaishnavi, had done the same thing that Nachiappan and Pechiappan did.\n\nRating 10: Visu and Madhu get married.\n\nRating 10: Later, at their reception, Madhesh entertains the couple and guests with computer-generated special effects."
},{
    "genre": "Comedies",
    "related-genre": [
        "Comedies"
    ],
    "id": 81147278,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81147278",
    "index": 110,
    "name": "90 ML",
    "maturity": "U/A 16+ ",
    "duration": "2h 2m",
    "synopsis": "Four friends shake up their lives when they meet a new woman in their apartment complex who encourages them to embrace their wild sides.",
    "year": "2019",
    "spoilers": "\n\nRating 10: Thamarai  and her husband Sathish  visit a drug rehabilitation center for a counseling session with a psychologist named Dr. Priyadarshini , but Sathish, who is a rowdy, walks out with haste.\n\nRating 8: Thamarai then starts to narrate how Rita  moved to their apartment, where she mingles with the neighbors Kajal , Paru , Suganya , and Thamarai.\n\nRating 8: One day, Rita notices Thamarai crying and gets to know that it is her birthday and that her husband was not even aware of it, but she decides to throw a party at a terrace, where they all drink beer and open up their personal lives.\n\nRating 10: They go to Tasmac, where Sathish comes and picks them up.\n\nRating 10: Later, Thamarai and Sathish cozy up relationship and have sex,\n\nRating 8: but he warns her to never meet her drunkard friends.\n\nRating 3: Eventually after sometimes, they all meet in Rita's house as Suganya asked for a party where she goes mad, but she reveals that her lover Chris is getting married at Pondicherry.\n\nRating 10: They all go there, kidnap the couple, and bring them to Suganya — she runs and hugs the bride, leaving everyone in shock.\n\nRating 10: They end up in a police station, where they are sent off with a warning.\n\nRating 10: Rita's boyfriend and Sathish have a small scuffle.\n\nRating 3: Later, Rita's boyfriend Venky  agrees for marriage, which she declines, and they break up.\n\nRating 3: They all meet up with Suganya and her partner, where they decided to switch to cannabis from drinks.\n\nRating 10: They seek help of two single youths to get weed, but they are chased by cops.\n\nRating 10: They end up in a crossfire between Sathish and his rivalry gang, but he saves them.\n\nRating 6: Kajal then says that her husband has an affair.\n\nRating 10: They all go there and ridicule him, and Paru says that she has not consummated her marriage.\n\nRating 8: She confronts her husband, and he tells that he was in love with another girl and was forced into marriage, so they decide to divorce.\n\nRating 5: Finally, Thamarai cries out and seeks her friends' help to free Sathish from his bald boss.\n\nRating 10: They all go to his hideout, fight the henchmen, and hold the boss at gunpoint, while Sathish comes to save him.\n\nRating 8: Later, they all are partying , where a guy  says to his lover that he does not believe in marriage; he is not anyone's property, and they breakup.\n\nRating 3: They all watch him and suggest that he is more like Rita.\n\nRating 10: She walks to him gives him a lip lock."
},{
    "genre": "Drama",
    "related-genre": [
        "Dramas"
    ],
    "id": 81362863,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81362863",
    "index": 111,
    "name": "Navarasa",
    "maturity": "A ",
    "duration": "1 Season",
    "synopsis": "From amusement to awe, the nine human emotions of Indian aesthetic theory are explored in this anthology series.",
    "year": "2021",
    "spoilers": "\n\nRating 10: The film revolves around the story of a young girl Shweta taking her first steps towards adulthood.\n\nRating 10: Ready for the adventure, the thirteen-year-old is upbeat, however soon discovers that every night, her uncle Gautam  transforms himself into a woman to lead a completely different life.\n\nRating 3: When Shweta confronts Gautam on the matter, Gautam tells her he wishes to run away and marry Aravan at a local festival, the Koovagam Festival.\n\nRating 8: The festival is held annually where people of the third gender regularly meet to re-enact the story of Aravan, a character from the epic Mahabharata.\n\nRating 10: Shweta decides to find her uncle and bring him back home, and along the way, she makes new friends of the third gender, and discovers a whole new culture."
},{
    "genre": "Comedies",
    "related-genre": [
        "Comedies"
    ],
    "id": 60025906,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/60025906",
    "index": 112,
    "name": "Avvai Shanmughi",
    "maturity": "U/A 13+ ",
    "duration": "2h 41m",
    "synopsis": "Newly divorced and denied visitation rights with his daughter, a doting father disguises himself as a gray-haired nanny in order to spend time with her.",
    "year": "1996",
    "spoilers": "\n\nRating 6: Janaki, a married woman who lives separated from her husband Pandian, applies for divorce.\n\nRating 6: She offers various reasons for wanting a divorce.\n\nRating 10: She has married Pandian against the wishes of her rich father Vishwanathan Iyer.\n\nRating 10: But she is not able to come to terms with living in Pandian's small house without amenities.\n\nRating 8: Pandian is an assistant dance choreographer with a modest income and is not able to spend much time with the family.\n\nRating 8: All this accumulates and Janaki decides to apply for divorce, which is granted.\n\nRating 3: She has sole custody of their daughter Bharathi, who Pandian can meet only once a week, his only solace.\n\nRating 3: However, Bharathi loves him a lot and dislikes the arrangement.\n\nRating 3: Basha, Pandian's Muslim friend, advises him to steal his daughter from Janaki.\n\nRating 8: Pandian assents, but in doing so, he is discovered; now he cannot meet her at all.\n\nRating 3: Pandian later learns that Vishwanathan has advertised for a woman to look after his granddaughter.\n\nRating 7: In conversation with Joseph, a makeup artist, Pandian gets the idea of playing an old woman, so that he can be with Bharathi and Janaki without them knowing.\n\nRating 10: Joseph agrees to this plan and the transformation is done from Pandian to \"Avvai Shanmugi\", a dignified, elderly Iyer woman.\n\nRating 10: Shanmugi applies for the job, but is rejected as another woman had been chosen.\n\nRating 3: But when Bharathi is hurt shooting fireworks and catches fire, Shanmugi throws her into the swimming pool against the wishes of the household, who believe that wrapping in woollens is the proper way to put out a fire.\n\nRating 4: When a doctor comes to take a look at Bharathi's wound, he praises Shanmugi for administering the right treatment, which causes Vishwanathan to reject the earlier hired nanny and hire Shanmugi.\n\nRating 10: Soon after that, all the family members start to become closer to Shanmugi, including Janaki and Barathi.\n\nRating 3: When Bharathi gets to properly meet Shanmugi, she recognises her father almost immediately, but agrees not to reveal his secret.\n\nRating 6: Rathna is a girl who is in love with Pandian, but is constantly rebuffed.\n\nRating 10: Basha takes up the role of a mute Iyer cook and is admitted into Vishwanathan's house on the recommendation of Shanmugi.\n\nRating 10: However, Basha is caught later while doing his namaz, thereby blowing his cover.\n\nRating 10: Hilarious circumstances follow and slowly Shanmugi manages to convince the household of her sincerity.\n\nRating 10: So much so that Vishwanathan begins to develop a liking for Shanmugi and in fact proposes to her too.\n\nRating 8: Around the same time, Mudaliyar, the house-owner of the place where Pandian lives, happens to bump into Shanmugi and sympathises with her for being a widow.\n\nRating 8: Eventually, Mudaliyar too begins to develop a liking for her.\n\nRating 10: Meanwhile, Pandian slowly begins to realise that Janaki has not totally forgotten him.\n\nRating 10: Shanmugi rebuffs Vishwanathan's proposals by saying that her husband is alive.\n\nRating 8: Adding to the chaos, she tells Vishwanathan that Joseph is her husband; while Pandian tells Sethuramar, Vishwanathan's secretary, that Mudaliyar is Shanmugi's husband.\n\nRating 8: There is much confusion after this, but it is resolved at last.\n\nRating 10: Shanmugi convinces Vishwanathan that Janaki's right place is by her husband.\n\nRating 10: While Viswanathan goes off to talk to his estranged son-in-law, Shanmugi reveals her true self as Pandian to Basha by removing her blouse.\n\nRating 3: This is seen by Janaki, who misunderstands the scene and believes Shanmugi to be a seductress.\n\nRating 10: Janaki goes to Pandian's house to reclaim him, but upon seeing Rathna waiting there, and Shanmugi's clothes lying around, thinks that her husband, too, is promiscuous.\n\nRating 8: Janaki leaves and attempts suicide by jumping into a river, but Shanmugi stops her.\n\nRating 10: Shanmugi reveals her identity as Pandian.\n\nRating 8: Janaki and Pandian reconcile, while Pandian \"kills off\" Shanmugi by attributing her \"death\" to drowning while attempting to save Janaki from committing suicide."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Dramas",
        "Comedies",
        "Action & Adventure"
    ],
    "id": 81508243,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81508243",
    "index": 113,
    "name": "DSP",
    "maturity": "U/A 13+ ",
    "duration": "2h 23m",
    "synopsis": "Forced into exile after an encounter with a ruthless don, a young man returns as a police officer to exact revenge on his nemesis.",
    "year": "2022",
    "spoilers": "\n\nRating 8: At Kasimedu harbour, 'Kasimedu' Jaga hides inside a boat with his henchmen.\n\nRating 3: He hears a bang.\n\nRating 6: Vascodagama smashes the wall with a hammer and subsequently arrests Jaga.\n\nRating 7: He gets posted as a Deputy Superintendent of Police  in the Dindugal District.\n\nRating 8: Vascodagama is travelling in a coach and tells his flashback to his neighbouring passenger.\n\nRating 3: Past: He lives in Dindigul.\n\nRating 8: His father, Murugapandi, owns a flower business and is the leader of the Flower business association.\n\nRating 10: He also lives with his mother, his cousin brother Poovali and his younger sister Sumathi.\n\nRating 10: He also has a friend Chandru.\n\nRating 10: Chandru has a caring father.\n\nRating 7: Living in the same village was a dangerous rowdy 'Muttai' Ravi and his brother Raja.\n\nRating 10: At a young age, a ruffian threatened his grandfather's eggs shop.\n\nRating 10: So Ravi killed the ruffian by throwing acid eggs on his face, earning the name 'Muttai' Ravi.\n\nRating 6: Ravi's father tells him not to revolt against injustice and to get a government job after he sees Ravi threaten people at the flower market.\n\nRating 8: Annapoorni lives with her father, Shanmugam, and her two sisters, Kannapoorni and Vannapoorni.\n\nRating 4: Their family have a sweets shop where they work.\n\nRating 10: One day, she attends an exam but forgets her hall ticket.\n\nRating 8: Vascodagama helps her reach home to get the hall ticket.\n\nRating 10: Vascodagama insults her after she fails to give him his employment file.\n\nRating 10: Vascodagama and his father meet Ravi to get a government job, but a friend of Vascodagama persuades them not to meet them, and they leave their place.\n\nRating 6: Vascodagama and his sister always bet money on every alliance his sister has.\n\nRating 10: Soon Vascodagama falls in love with Annapoorni.\n\nRating 10: One day, Vascodagama takes Chandru's father to his fields.\n\nRating 3: He tells him that they wish Sumathi to be their daughter-in-law.\n\nRating 10: Later, Ravi's goons stab him, and 'Muttai' Ravi hacks him to death.\n\nRating 10: The police insult Vascodagama.\n\nRating 8: He replies that 'Muttai' Ravi is the murderer.\n\nRating 10: Ravi explains to the MLA that Chandru's father refused to sign the documents, so he killed him.\n\nRating 7: A few days later, Chandru's family come asking for Sumathi's hand in marriage.\n\nRating 10: Sumathi and Murugapandi accept the alliance, and Vascodagama hugs Chandru emotionally.\n\nRating 8: Sumathi and Chandru have their engagement, and Vascodagama settles his alliance bets with jewellery.\n\nRating 10: When Vascodagama's friends arrive at the bus stand, they argue with a lorry driver.\n\nRating 3: The driver's owner calls 'Muttai' Ravi and beats up Vascodagama's friends, but Vascodagama arrives and beats up Ravi; this humiliates Ravi.\n\nRating 10: Murugapandi tries to resolve the problem with Ravi, but Ravi slaps him.\n\nRating 3: Murugapandi sends his son away from his daughter's wedding to protect him.\n\nRating 10: Present: At a motel near Trichy, Vascodagama gets stabbed and attacked by the neighbouring passenger and a goon organised by Ravi.\n\nRating 3: Later, Vascodagama gets on a train at Dindigul Railway Station.\n\nRating 8: Vascodagama goes to sleep and then narrates what happened after the motel incident.\n\nRating 3: Past: He recovered from the incident.\n\nRating 3: 'Muttai' Ravi worked as an assistant for MLA Aalamarathan.\n\nRating 10: Aalamarathan suddenly dies of a heart attack, and Ravi collects the dues.\n\nRating 7: He gives the money to the CM and becomes MLA.\n\nRating 8: Vascodagama beats up Ravi's henchmen but spares Ravi.\n\nRating 10: Ravi warns that he will murder someone in 10 days.\n\nRating 10: Vascodagama confiscates a drone that fell from a tree.\n\nRating 10: He visits his police station and meets his team.\n\nRating 3: Annapoorni informs that 'Mapillai' Vinayagam is her boyfriend.\n\nRating 6: A few days, an unidentified body appears.\n\nRating 3: Vascodagama's senior officer tells him to kill a criminal called Kalakkad Ramesh.\n\nRating 10: Vascodagama trains his team and successfully kills Ramesh.\n\nRating 3: 'Mapillai' Vinayagam plans a drama with the registrar to get Vascodagama and Annapoorni married.\n\nRating 3: After viewing the drone footage, he sees Ravi's men committing the murder.\n\nRating 10: He catches and beats up Pandi and his men.\n\nRating 6: Eventually, the murder was ordered by Raja, according to Pandi's confession.\n\nRating 8: Vascodagama then murders Raja.\n\nRating 7: In retribution, Ravi orchestrates a nail bomb blast at Batlagundu market.\n\nRating 8: Present: Vascodagama wakes up on the train.\n\nRating 6: In Kerala, he follows a train passenger where 'Muttai' Ravi is hiding.\n\nRating 8: In a brief flashback, the explosion killed Chandru and injured Sumathi, and Ravi got fired as MLA.\n\nRating 10: Vascodagama fights with Ravi and throws him into the fire, along with a petrol can, avenging Chandru's death, and Vascodagama leaves."
},{
    "genre": "Action",
    "related-genre": [
        "Dramas",
        "Comedies",
        "Action & Adventure"
    ],
    "id": 81091423,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81091423",
    "index": 114,
    "name": "Petta",
    "maturity": "U/A 16+ ",
    "duration": "2h 49m",
    "synopsis": "An affable, newly appointed college warden proves to be no ordinary man when an old enemy resurfaces and exposes his complicated, violent past.",
    "year": "2019",
    "spoilers": "\n\nRating 8: Kaali is a mysterious and deceivingly elderly man, who takes up the job of a boys' hostel warden at a college in Ooty.\n\nRating 8: He notices that the hostel is dominated by a group of unruly final-year students, who are led by Michael, the spoiled son of a local leader named Gnanam.\n\nRating 6: Kaali puts a stop to Michael's antics, which leads to enmity between the two.\n\nRating 8: Kaali also forms a close bond with a NRI hostelite named Anwar, who is in a relationship with Anu, the daughter of Mangalam, a pranic healer.\n\nRating 10: Kaali convinces Mangalam to accept her daughter's relationship with Anwar, and they end up falling in love.\n\nRating 8: Michael, who lusts for Anu, is angered on hearing of her relationship with Anwar, and attempts to harass them, only to be stopped by Kaali.\n\nRating 10: Michael and his friends are suspended, where Anwar records and shares the humiliation of Michael and his gang.\n\nRating 4: The video is noticed in Uttar Pradesh by a local goon named Jithu, the son of a powerful politician called Singaaram aka Singaar Singh.\n\nRating 10: Singaar, on seeing Anwar in the video as well as in a photo with his mother on Facebook, sends his men to Ooty to kill Anwar, for unknown reasons.\n\nRating 10: At the same time, Michael, humiliated at his suspension, sends his men to beat up  Kaali.\n\nRating 6: Michael's plan backfires as he and his men are caught in the fight between Kaali and Singaar's men.\n\nRating 10: Kaali subdues Singaar's men, earning Michael's and Gnanam's respect, following which Anwar meets Kaali's friend, who narrates about his past.\n\nRating 10: Anwar is the son of Maalik, who was Kaali's best friend.\n\nRating 10: It is also revealed that Kaali's real name is Petta Velan, who is a well-respected man in his village in Madurai.\n\nRating 7: Past: Maalik learns that Devaram and Singaar were involved in illegal sand mafia, which leads to Devaram getting arrested by Maalik and Petta.\n\nRating 8: Petta learns that Maalik was in love with Devaram and Singaar's sister Poongodi, who conceived with him out of wedlock.\n\nRating 3: Though relucant, Petta finally agrees, where he and his wife Saraswathy \"Saro\" managed to convince Poongodi's father Rajapandi to get Poongodi married to Maalik, but Devaram and Singaar vehemently opposed the alliance as well as the transfer of property to Poongodi.\n\nRating 9: After Maalik and Poongodi's marriage, Devaram and Singaar kill Rajapandi.\n\nRating 3: On hearing about Rajapandi's murder, Petta kills Devaram during Rajapandi's funeral and chased Singaar out of the village.\n\nRating 8: Enraged about Devaram's death and his forced exile, Singaar orchestrates a bomb blast during Poongodi's seemantham, killing Maalik, Saro and Petta's son Chinna.\n\nRating 8: After finding that Poongodi is still alive, Petta took her to safety.\n\nRating 5: Poongodi later gave birth to a boy, who is revealed to be Anwar and both of them left for Australia as refugees to escape from Singaar.\n\nPresent: On learning his past, Anwar, along with Petta and Michael's henchmen leave for Uttar Pradesh to finish off Singaar once and for all.\n\nRating 3: Petta and Anwar confront Jithu, who is determined to kill them both after learning about them from his father.\n\nRating 7: The duo manages to escape Jithu.\n\nRating 10: Later, Petta meets Jithu privately and reveals to him that he is none other than his son Chinna, who did not die in the blast, but was adopted by Singaar after finding him still alive in the wreckage.\n\nRating 3: When Jithu confronts Singaar regarding his parentage, the latter sends his men to kill him, who is rescued by Petta.\n\nRating 8: Along with Anwar and Michael's henchmen, Petta and Jithu ambush Singaar's mansion where they decimate his guards and Petta confronts and guns Singaar down.\n\nRating 3: Following Singaar's death, Petta reveals that Jithu is not his son and that he really is Singaar's son.\n\nRating 10: Petta used him to lead to Singaar as part of a strategy to kill the latter.\n\nRating 6: He further adds that Chinna had died in the bomb blast.\n\nRating 8: After this shocking revelation, Petta holds Jithu at gunpoint and kills him."
},{
    "genre": "Thrillers",
    "related-genre": [
        "Dramas",
        "Thriller Movies",
        "Romantic Movies",
        "Mysteries"
    ],
    "id": 81151904,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81151904",
    "index": 115,
    "name": "Seven",
    "maturity": "U/A 16+ ",
    "duration": "1h 51m",
    "synopsis": "Multiple women report their husbands as missing but when it appears they are looking for the same man, a police officer traces their cryptic connection.",
    "year": "2019",
    "spoilers": "\n\nRating 10: While investigating an enigmatic man named Karthik, a police officer is bewildered by the conflicting statements about his identity.\n\nRating 3: Three young women seem to share a mysterious connection with him and claim Karthik as their husband who has gone missing a few days/months before.\n\nRating 8: An old man from an asylum claims that he knew Karthik as Krishnamurthy, who had died thirty years ago.\n\nRating 10: The next day the old man was found killed.\n\nRating 4: After the old man's death, another woman called Priya appears and claims Karthik as her husband, who has been missing since the previous day.\n\nRating 3: The police officers are in shock with her claim because they had arrested Karthik two days before as the suspect of the old man's murder.\n\nRating 10: During the investigation, Karthik fails to recognize the other three women who claimed him as their husband.\n\nRating 3: In the next scene the woman is brought to the imprisoned Karthik.\n\nRating 8: When she sees Karthik, they both smile at each other and suddenly the woman pulls a gun and shoots him.\n\nRating 10: The police officer stops her act and asks her intention for doing thus.\n\nRating 10: She reveals her love story and marriage with Karthik.\n\nRating 7: After her marriage, due to some misunderstanding Karthik leaves her, after a few months she reads news about Karthik and the affairs he had with other three women .\n\nRating 3: She was shocked with the news and assumed that Karthik is a playboy who had spoiled four women's lives\n\nRating 10: so, she decides that he is not fit to live.\n\nRating 3: Karthik escapes from the hospital and with the help of a journalist he goes in search of those girls to know their intention to cause such trouble in his life.\n\nRating 10: There he finds all the allegations given towards him are false as they have staged a drama against Karthik on the request of Saraswati, an old lady.\n\nRating 8: Sarswati, the woman behind the scene is the main culprit who saves those girls from getting raped which was staged by herself as she wanted the help of those girls to trouble Karthik for revenge.\n\nRating 3: This lady is shown to be Karthik's father's ex-wife who kills her father and stages a drama to marry Krishnamoorthy .\n\nRating 3: On their nuptial night, Krishnamurthy realizes that Saraswati has psychotic behavior and the murderer of her father and Krishnamoorthy's fiancée Bhanu's family.\n\nRating 3: He escapes and jumps into a river.\n\nRating 8: Saraswati is sent to an asylum and released after a few years.\n\nRating 10: She sees Krishnamoorthy living a happy life with Bhanu and two children.\n\nRating 8: She kills them on the same day except the son who turned out to be Karthik.\n\nRating 3: At present, she still hallucinates Karthik for Krishnamoorthi and wants to kill him as a revenge for rejecting her.\n\nRating 10: She kidnaps Priya the wife of Karthik and threatens him at gunpoint telling him to kill himself.\n\nRating 10: In an attempt to save Karthik, ACP Vijay Prakash gets injured.\n\nRating 8: The police shoot her in her leg and she finally shoots herself without letting them know the hideout of Priya.\n\nRating 10: Finally Karthik and the police find Priya at the basement and she apologises for misunderstanding Karthik and they reunite."
},{
    "genre": "Romance",
    "related-genre": [
        "Dramas",
        "Romantic Movies"
    ],
    "id": 322409,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/322409",
    "index": 116,
    "name": "Bombay",
    "maturity": "U/A 13+ ",
    "duration": "2h 14m",
    "synopsis": "Years after they elope against their family’s wishes, a couple and their sons become caught in the throes of conflict in their city.",
    "year": "1995",
    "spoilers": "\n\nRating 10: Shekhar is the son of an orthodox Hindu Narayana Pillai living in a coastal village in Tamil Nadu.\n\nRating 10: A journalism student studying in Bombay, Shekhar visits home to be with his family.\n\nRating 10: On one of his return trips, he notices Shaila Banu, a Muslim schoolgirl in the village and falls in love with her.\n\nRating 8: Initially shy, Shaila seeks to distance herself from Shekhar, but after frequent run-ins, and days of pursuit, Shaila begins to like Shekhar.\n\nRating 10: Eventually, they both fall in love.\n\nRating 10: Shekhar meets Shaila's father Basheer and says he wants to marry Shaila.\n\nRating 3: Basheer refuses, citing difference in religions.\n\nRating 3: Shekhar reveals his interest to his father, who becomes angry, meets Basheer and gets into an abusive argument with him.\n\nRating 5: Upset with rejection from both families, Shekhar returns to Bombay.\n\nRating 8: Through a friend of hers, he sends Shaila a letter and a ticket for her to travel to Bombay.\n\nRating 3: However, she is undecided; Basheer learns of her regular letters from Shekhar and plans to marry her off to stop this relation growing further.\n\nRating 8: Left with no choice, Shaila leaves the village with the ticket and reaches Bombay.\n\nRating 10: Shekhar and Shaila marry and lead a happy life.\n\nRating 10: In a year, Shaila conceives and delivers twin boys who are named Kabir Narayan and Kamal Basheer.\n\nRating 8: The twins are raised in both religions.\n\nRating 10: Shekhar continues to work as a journalist, while Shaila takes care of home and children.\n\nRating 10: In six years, Shekhar and Shaila firmly settle down in their life and begin the process of re-establishing a relationship with their respective families.\n\nRating 3: When the Babri Masjid is demolished on 6 December 1992, riots break out in Bombay.\n\nRating 10: Kabir and Kamal, who had gone to buy groceries, get caught in the riots; eventually, Shekhar and Shaila save them and reach home safely.\n\nRating 10: Narayana Pillai, who receives the news of the riots, rushes to Bombay to meet his son and his family.\n\nRating 10: He reconciles with his son and everyone is happy with his arrival, and he stays with them.\n\nRating 10: Soon, Basheer also comes with his wife and all of them live together happily for a few days.\n\nRating 10: Both Pillai and Basheer are happy with their grandchildren, try to get both to their religion and wish to be with them.\n\nRating 3: On 8 January 1993, when two murders are propagated as communal killings, another riot breaks out in Bombay, raising tensions between religious communities.\n\nRating 10: Hindus and Muslims clash in the streets, resulting in hundreds of deaths on both sides.\n\nRating 8: During the conflict, arsonists set fire to the apartment where Shekhar lives with his family.\n\nRating 10: Shekhar tries to evacuate everyone, but Narayana Pillai, Basheer and his wife fail to escape in time and are killed when the building explodes.\n\nRating 8: In the confusion of the panicking crowds, Kamal and Kabir are separated from their parents.\n\nRating 3: Kamal is saved by a transgender woman who cares for him and protects him, while Kabir searches aimlessly for his brother.\n\nRating 6: Shekhar and Shaila begin to search for them and they go through several tense moments, as they check the morgues and hospitals for their children.\n\nRating 10: Shekhar grows emotional and participates in the movement to stop the riots with other moderate religious leaders, ultimately succeeding.\n\nRating 10: When the riots end, Shaila and Shekhar are reunited with their children tearfully as the people on the streets join hands, regardless of age or religion."
},{
    "genre": "Comedies",
    "related-genre": [
        "Comedies"
    ],
    "id": 81186757,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81186757",
    "index": 118,
    "name": "Oh! Baby",
    "maturity": "U/A 13+ ",
    "duration": "2h 25m",
    "synopsis": "A surly septuagenarian gets another chance at her 20s after having her photo snapped at a studio that magically takes 50 years off her life.",
    "year": "2019",
    "spoilers": "\n\nRating 10: Lecturer Shekhar / Nani explains the behavior of old people and talks about his mother Baby.\n\nRating 8: She works in a canteen of her own in the same college which is co-owned by her childhood friend Pasupuleti Kanakaraj / Chanti.\n\nRating 10: At a young age, she dreams to become a great singer, which does not come true.\n\nRating 10: Right now, she aspires her grandson Rocky to fulfill her goal.\n\nRating 10: However, her relationship with her daughter-in-law Madhavi does not run on good terms.\n\nRating 10: Things get worse when Madhavi gets a heart attack and does not want to live with Baby.\n\nRating 4: Even the doctors suggest the same.\n\nRating 8: Being cognizant of it, heartbroken, Baby quits the house and accuses God of her fate.\n\nRating 10: On the way, Rocky calls her for his first music performance at an exhibition where God appears in the form of a saint, presents her with a statue of Lord Ganesha, and says it will change her fate.\n\nRating 10: Nevertheless, she finds a photo studio and enters with the hope of getting a good photograph as she would like to print a beautiful photo of hers after her death in the newspaper.\n\nRating 7: The same person appears as the photographer and promises to get back her beauty, after taking the picture.\n\nRating 10: Astoundingly, she turns into a 24-year-old herself.\n\nRating 10: Looking at it, she becomes bewildered when God appears, while praising Lord Shiva and tells her that this new life is given to fill her with joy and enlightenment.\n\nRating 10: Thereafter, she accommodates herself in Chanti's house changing as Swathi, starts a new life, and also teams up with her grandson Rocky and becomes a part of the band.\n\nRating 10: Meanwhile, Chanti realizes that Swathi herself is Baby and supports her at every step.\n\nRating 10: Soon, Vikram, the head of the music company, likes Baby / Swathi's voice and gives her band an opportunity.\n\nRating 10: Swathi supports Rocky throughout and encourages him to be better.\n\nRating 3: Vikram and Swathi begin spending a lot of time together, and she too starts taking an interest in him.\n\nRating 8: After a lot of romantic comedy, Vikram proposes to Swathi when she is completely under dichotomy.\n\nRating 4: At the same time, Chanti learns that if Baby loses her blood, she again turns into an old lady.\n\nRating 10: At last, in the D-day finale of the competition, Rocky, unfortunately, meets with an accident, yet Baby participates and acquires the triumph.\n\nRating 10: Immediately, Baby / Swathi rushes to the hospital leaving a letter for Vikram, convincing her to remember her acquaintance as a sweet memory and always be smiling.\n\nRating 8: By this time Nani also realizes that she is his mother.\n\nRating 8: But after reaching the hospital she finds Rocky requires AB-type blood which Baby donates, even after the refusal of Chanti and Nani, by stating that she is first and foremost Nani's mother and would always be there for him and his children and transforms back into an old lady.\n\nRating 10: After she returns, her family also realizes her value and she in turn is also more friendly with them as they can be seen enjoying a performance by Rocky .\n\nRating 10: In the end, God transforms Chanti into a young man, who comes to pick up Baby."
},{
    "genre": "Comedies",
    "related-genre": [
        "Dramas",
        "Comedies"
    ],
    "id": 81272107,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81272107",
    "index": 119,
    "name": "Mandela",
    "maturity": "U/A 16+ ",
    "duration": "2h 20m",
    "synopsis": "Amid a local election with two rivals vying to win by any means necessary, a barber lands in a curiously powerful position as the single deciding vote.",
    "year": "2021",
    "spoilers": "\n\nRating 3: In a small village named Soorangudi in Tamil Nadu, the population of around 1000 people are split into two caste-based factions, Northerners and Southerners.\n\nRating 8: When the long unopposed President of the Village becomes paralyzed months before election, his two sons decide to run for president.\n\nRating 7: The election is also divided along caste lines, as elder son's mother is a Northerner and others is a Southener.\n\nRating 10: Based on pre-polling it turns out the vote is split.\n\nRating 8: The tie breaker vote falls upon a local hairstylist named Smile alias Nelson Mandela  who recently joined the voter list.\n\nRating 3: The rest of the movie is about who gets Nelson Mandela's vote to win.\n\nRating 10: In the process, Mandela gets the two contenders to improve the village by laying a road, building a school etc. with their wealth.\n\nRating 3: The movie ends with a 'surprise' result to the election that is not disclosed but is inferred that the village of Soorangudi won."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Dramas",
        "Action & Adventure"
    ],
    "id": 81508242,
    "tag": "Tamil-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81508242",
    "index": 120,
    "name": "Etharkkum Thunindhavan",
    "maturity": "U/A 16+ ",
    "duration": "2h 28m",
    "synopsis": "When a lawyer uncovers a ruthless leader's criminal network that sexually exploits and threatens young women, he embarks on a bloody pursuit of justice.",
    "year": "2022",
    "spoilers": "\n\nRating 8: Kannabiran is a lawyer at the Madras High Court.\n\nRating 8: He lives with his family, consisting of his father, Aadhirayar, and mother, Kosalai, in Thennaadu.\n\nRating 3: Their neighbouring village is Vadanaadu.\n\nRating 10: Residents of both villages believe that the god and goddess Shiva and Shakti originated in these villages and hold a grand festival celebrating their togetherness.\n\nRating 8: Women in Thennaadu are married to men in Vadanaadu, and vice versa.\n\nRating 8: However, after a woman from Thennaadu, who gets married to a man from Vadanaadu, commits suicide by hanging herself, both villages engage in rivalry.\n\nRating 10: Kannabiran falls in love with Aadhini from Vadanaadu, and the two of them get married.\n\nRating 10: Aadhini's friend Yazhnila is in love with Nithin.\n\nRating 10: Nithin, who is Inba's henchman, cheats on her by asking her to sleep with a man .\n\nRating 10: Yazhnila strives to flee Nithin's clutches, but Inba's men chase her, and she gets badly beaten.\n\nRating 3: Kannabiran comes to her rescue in the nick of time and warns both Inba and his men.\n\nRating 10: Previously, Inba was responsible for killing his pregnant wife and a girl named Monika, who was killed and made it look like a car accident.\n\nRating 8: After Kannabiran and Aadhini's marriage, Yazhnila gets given shelter by Kannabiran, who also motivates her by standing beside her in the fight against the pornography racket run by Inba.\n\nRating 3: However, when Kannabiran and Aadhini get intimate, Inba secretly shoots a video of them.\n\nRating 3: In addition, he also shoots a video of Aadhini bathing.\n\nRating 3: When they receive the videos, they are both shocked and devastated.\n\nRating 8: Despite all the happenings, Kannabiran remains headstrong and requests Aadhini to stay strong and fight with him.\n\nRating 3: Soon, he gathers all the victims of Inba's racket and files a petition against Inba and his men.\n\nRating 10: However, Inba's advocate produces false evidence, showing that he is a philanthropist and educationalist.\n\nRating 10: As a result, the judge throws out the case and mandates Kannabiran and Aadhirayar's imprisonment.\n\nRating 5: After serving two months in jail, Aadhirayar inspires his son to become an executioner and to abandon his early faith in the rule of law to carry out justice.\n\nRating 10: Kannabiran readily accepts.\n\nRating 8: He kidnaps all the men working for Inba and locks them in a factory.\n\nRating 10: After a deadly and intense cat-and-mouse chase between Kannabiran and Inba, Kannabiran gets access to the systems that Inba and his men use for creating pornographic content and destroys them.\n\nRating 8: Kannabiran ruthlessly beats Inba's men and lectures their parents on men respecting women and their privacy.\n\nRating 10: Kannabiran is able to prove that Inba and his men have intimate recordings of 500 women belonging to their village and are committed to spoiling the lives of those women by not letting them get married and driving off their dignity in society.\n\nRating 10: Kannabiran also recollects his past.\n\nRating 10: When he was nine, his younger sister was taken by some people and brutally assaulted to death.\n\nRating 10: The relatives of Inba's henchmen are now ashamed of them and eventually kill them for their actions.\n\nRating 10: As for Inba, he is killed by his father-in-law after Inba murdered the latter's daughter and spread rumours about her death.\n\nRating 3: Kannabiran surrenders himself to the police and admits he committed all the murders.\n\nRating 3: Kosalai chastises him for becoming a ruthless murderer even after witnessing his family's struggles and public humiliation.\n\nRating 8: Kannabiran reminds her that he did not commit the murders but simply removed the weeds harmful to society.\n\nRating 6: He gets arrested for the judicial killings, but the village women demand his release, knowing he did the right thing."
}]