[{
    "genre": "Drama",
    "related-genre": [
        "Dramas",
        "Action & Adventure"
    ],
    "id": 81604816,
    "tag": "New Releases",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABWkdmhDwEM5kzr1q2bUf2KIw_IYtD8MhZsn0Sc5mX6Lu0-H6aU3CCmi6qfznXtIlj6D-jLXuGKlqSmHWKk88O2KTNM2g4pbCQsE.jpg?r=5dd",
    "source": "https://www.netflix.com/in/title/81604816",
    "index": 1,
    "name": "Dasara",
    "maturity": "A ",
    "duration": "2h 32m",
    "synopsis": "Amid the daily grind in a coal mining town, politics and power dynamics take a dangerous toll on a love triangle between three longtime friends.",
    "year": "2023",
    "spoilers": "\nRating 3: In 2009, Dharani is a young ruffian, who steals coal for a living and lives with his grandmother in Veerlapally.\nRating 3: The villagers always consume alcohol and get entangled with family problems.\nRating 5: He spends most of his time with his best friends Siddham \"Suri\" Suryam and Vennela.\nRating 10: Dharani loves Vennela since their childhood, but later learns that Vennela loves Suri.\nRating 10: As a result, he sacrifices his love for her and decides to get the duo married.\nRating 8: However, their relationship is objected by Vennela's mother, Ramanamma, due to Suri's involvement in stealing coal.\nRating 8: Dharani makes Suri win a local cricket match in order to receive a cashier job at the famous \"Silk\" bar, as announced by the village's candidate for the sarpanch, Thurpugutta Shivanna's son, Thurpugutta Chinna Nambi.\nRating 10: Dharani and Suri get into a fight with Chinna Nambi's supporters at the bar and damage it.\nRating 8: As a result, Chinna Nambi gets Dharani and his friends arrested.\nRating 10: Rajanna, Shivanna's kinder step-brother, bails them out and asks them to not worry about the village politics.\nRating 10: However, Suri asks him to contest in the sarpanch elections, to which Rajanna eventually agrees.\nRating 10: Rajanna wins the election after encouraging the womenfolk to vote for the first time and Dharani is made the Deputy Sarpanch under Rajanna.\nRating 9: Suri's marriage with Vennela is subsequently fixed as a result.\nRating 7: On the day of his marriage with Vennela, Suri comes to know of Dharani's sacrifice for him and is heartbroken.\nRating 6: As he is on his way to talk to Dharani and their friends at the bar, a mysterious gang attack and chase all of them.\nRating 10: Three of Dharani and Suri's friends are brutally killed, while another collapses from a heart attack.\nRating 10: Dharani is injured in the ensuing chase, and Suri tries to escape with him on a bicycle.\nRating 8: However, while escaping, Suri is beheaded.\nRating 6: Dharani, in a state of shock and fear, hides from the gang.\nRating 10: The entire village comes to know of the attack and is devastated.\nRating 8: Baying for vengeance, Dharani begins to investigate into the matter.\nRating 6: He learns that Chinna Nambi was the perpetrator and ordered Suri's death.\nRating 3: Chinna Nambi's wife tells him that Chinna Nambi lusts after Vennela and had Suri killed when he learnt about his relationship with her, not because he contested against him.\nRating 8: He also killed Vennela's friend, Radha's husband, for the same reason.\nRating 10: After learning about Chinna Nambi's true face, Dharani begins to protect Vennela from Chinna Nambi by marrying her.\nRating 7: At first, Vennela sees Dharani with hatred due to him forcefully marrying her, but over time she grows fond of him.\nRating 10: On the day of Dasara, Chinna Nambi reveals to Vennela about his involvement in Suri's death and Dharani's devotion to her, shocking Vennela, as she was not wary of Dharani's love for her since their childhood.\nRating 3: During the Ravana dahanam, the same gang that chased and killed Suri and Dharani's friends are waiting for him.\nRating 3: However, Dharani and his remaining group of friends manage to kill all of them, just as the police arrive to arrest them.\nRating 10: Dharani reveals to the entire village of Chinna Nambi's doings.\nRating 3: Before being taken away, he manages to escape from the police and decapitate Chinna Nambi in front of the entire village; Dharani and his friends are arrested as a result.\nRating 8: Seven years later, they come back to the village after finishing their sentence.\nRating 3: Dharani comes to know that the womenfolk are suffering as a result of the influence of alcohol on their husbands, and sets the bar on fire, finally realizing that alcohol will ruin everyone in the village.\nRating 10: Vennela and Dharani have an emotional reunion after seven years."
},{
    "genre": "Drama",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Dramas",
        "Romantic Movies"
    ],
    "id": 80147949,
    "tag": "New Releases",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABZ8YK3DAyxu8Z1_JJLFJf50fr0yhCmPcQJqR8bZXzPyZSpzjahMwL_GJ2SLsTlq_GIMDe3RM5gq-eDfOxeW3irhF9gXxN2T4LUs.jpg?r=0cb",
    "source": "https://www.netflix.com/in/title/80147949",
    "index": 3,
    "name": "Ae Dil Hai Mushkil",
    "maturity": "U/A 13+ ",
    "duration": "2h 35m",
    "synopsis": "After crossing paths as students in London, Ayan and Alizeh navigate a journey of friendship, love and heartbreak that turns their worlds upside down.",
    "year": "2016",
    "spoilers": "\nRating 10: The film begins with the interview of Ayan Sanger, a singer who has newly acquired fame with his non-filmy songs.\nRating 10: He tells the story of his experience of love in a flashback.\nRating 10: A few years ago, in London, a chance meeting in a disco between Ayan and Alizeh happens and they hook up with each other.\nRating 10: They get to know each other and become friends.\nRating 9: Later, when they discover their respective partners are cheating on them, they break up with their lovers: Ayan with Lisa D'Souza and Alizeh with \"Dr.\" Faisal Khan, and the two go to Paris to spend a week together.\nRating 8: Aayan falls in love with Alizeh but does not tell her because she considers him to be only a \"friend\".\nRating 8: One day, Alizeh stumbles upon DJ Ali, her ex-boyfriend/lover, who wants to reconcile.\nRating 10: Partially confused, but still in love with him, Alizeh decides to go with DJ Ali, and so unintentionally stops hanging out with Ayan and they cease communication.\nRating 10: A few days later, Alizeh calls and invites Ayan to her wedding with DJ Ali in Lucknow.\nRating 10: Ayan is shaken on hearing this but reluctantly agrees to the invitation.\nRating 10: At the wedding, he tells Alizeh he loves her\nRating 10: but she rejects his feelings causing Ayan to leave the ceremony heartbroken.\nRating 10: At the airport to board a flight to Dubai, he meets Saba Taliyar Khan, a poet, who is leaving for Vienna.\nRating 10: She consoles Ayan and gives him a book with her poetry and number on it.\nRating 10: Ayan reads that poetry and is moved by it.\nRating 8: He calls her after three months stating that he is in Vienna and wants to meet her.\nRating 10: They meet.\nRating 10: He learns that Saba is divorced and has no place for love in her heart.\nRating 8: They get into a relationship.\nRating 10: Later, at an art gallery, he meets Saba's ex-husband, Tahir Taliyar Khan, who tells him that one-sided love is not a weakness but rather empowering as it isn't shared as one doesn't even need the presence of the person one is in love with to keep loving them regardless.\nRating 8: Ayan, who had blocked Alizeh from contacting him in all ways, finally calls and reconnects with her on being inspired by these words.\nRating 8: Alizeh feels really happy and tells him that she missed their friendship.\nRating 7: He begins to send pictures of Saba to her to try and induce jealousy while Alizeh tells him about her happy life with Ali and assumes that he has moved on.\nRating 10: After a few days, Alizeh informs Ayan that she is coming to Vienna and wants to meet him.\nRating 3: Ayan invites her for dinner with Saba to provoke Alizeh and make her feel jealous which Saba notices.\nRating 3: Before she leaves, Ayan confronts her that she has no feelings and is heartless.\nRating 6: Alizeh says that she does love Ayan but not in a romantic way.\nRating 10: They have a verbal fight and then he walks away.\nRating 10: He goes to Saba, who hugs Ayan one last time and tells him that she really started loving him and that before it gets more intense, they should part ways.\nRating 6: She fears that she will get hurt realizing that she will never get the love she saw in Ayan's eyes for Alizeh.\nRating 10: Their relationship ends and Ayan leaves.\nRating 10: Ayan continues to harbor a love for Alizeh and becomes a famous singer with his channel.\nRating 8: He meets Ali one day and realizes that Ali and Alizeh are no longer together.\nRating 8: Ali tells Ayan that even though Alizeh loved him, she was not able to get the love she thought she deserved.\nRating 3: Ayan, concerned, goes to Alizeh's favorite spot and waits for two days there, hoping that she will arrive.\nRating 9: Alizeh meets him there and tells Ayan that she has been diagnosed with stage four cancer and will not live much longer.\nRating 4: Ayan is heartbroken\nRating 10: but they try to make the best of their time together.\nRating 8: Ayan tries to make Alizeh love him, to no avail.\nRating 7: This leads to a fight between the two, and Alizeh decides to leave Ayan as he cannot understand that she cannot fake her feelings for Ayan just to make him feel happy.\nRating 3: The next morning Ayan tries to search for Alizeh, apparently reaching the airport and thus fulfilling her last wish before death.\nRating 10: Eventually, Ayan makes peace with the fact that he and Alizeh can at least be friends and nothing more.\nRating 3: The screen blacks out and comes back to the present where Ayan, still a popular singer, is giving an interview based on the love of his life.\nRating 6: Ayan sings the song \"Channa Mereya\", which is inspired by his one-sided love story, and finishes the interview."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "Movies Based on Books",
        "US Movies"
    ],
    "id": 81286595,
    "tag": "New Releases",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABc4JyYJEQE23tWc8CMQYWfZgUfsT2S4qybj47XYRlzTuIJs3egPnUuFumH6rtXtOH4CIl_ALih0vYCclI-2eiOitag9521EEXDc.jpg?r=f17",
    "source": "https://www.netflix.com/in/title/81286595",
    "index": 4,
    "name": "Clifford the Big Red Dog",
    "maturity": "U/A 7+ ",
    "duration": "1h 37m",
    "synopsis": "After their tiny red puppy grows into a 25-foot giant, a young girl and her uncle must protect their lovable new pet from an evil genetics company.",
    "year": "2021",
    "spoilers": "\nRating 8: In New York City, Emily Elizabeth Howard, a 12-year-old middle school student who lives with her English accent mother, Maggie, is regularly bullied by a popular girl at school named Florence, but finds comfort in her only new friend Owen Yu.\nRating 8: Maggie leaves her in the care of her van-dwelling and irresponsible uncle Casey before going to Chicago for a business trip.\nRating 10: Mr. Bridwell, who runs an animal rescue tent at a park, introduces Emily to a small red puppy whose family had been taken by dogcatchers.\nRating 10: He tells her that the puppy will grow based on how much love he receives.\nRating 10: Casey rejects the adoption due to dogs not being allowed in the apartment building.\nRating 3: When Emily gets home from school, she finds the puppy in her backpack and names him Clifford.\nRating 8: Casey allows her to keep Clifford only for one night.\nRating 10: The next morning, Clifford has grown to giant proportions.\nRating 10: Emily and Casey attempt to hide him from the building's superintendent, Mr. Packard.\nRating 7: They try taking Clifford to a veterinarian, but he chases and plays with a man in an inflatable bubble.\nRating 3: Word of his existence quickly spreads online.\nRating 3: After learning from the vet's secretary of Bridwell's past miracles with animals and their owners, the Howards plan to get information on his whereabouts.\nRating 10: As Emily is getting lunch for Clifford from the cafeteria, Clifford escapes from Casey's truck and humiliates Florence, giving Emily the friends she always wanted.\nRating 3: Zac Tieran, the owner of biotechnology company Lyfegro, discovers Clifford on social media.\nRating 8: He lies to the police that Clifford is his dog and has them search for him.\nRating 4: After being evicted from their apartment and chased by the police and Lyfegro guards, Emily and Casey take shelter in Owen's lavish apartment.\nRating 3: Casey tells Emily she can keep Clifford if they find Bridwell and take his advice.\nRating 10: If he cannot help, Clifford must be sent to China, where Owen's father has a sanctuary.\nRating 10: They race to the hospital, only to find Bridwell's empty bed and a patient who tells them Bridwell has died.\nRating 10: Clifford is thus sent away by a boat arranged by Mr. Yu as Emily tearfully says goodbye.\nRating 6: The next day, Clifford is captured on the ship by Lyfegro personnel and sent to Lyfegro.\nRating 5: Emily soon learns Bridwell did not die, so she and Casey try to save Clifford from being operated on at Lyfegro, aided by friends from their neighborhood.\nRating 8: They break into Lyfegro's headquarters and rescue Clifford, who then flees through the city with Emily riding on him.\nRating 10: At Manhattan Bridge Park, a large crowd gathers as Emily desperately asks Bridwell to help, and he tells her that she must stand up for herself and for Clifford and that being different is a gift.\nRating 10: Emily explains to everyone the importance of love, regardless of differences.\nRating 10: However, Tieran, who arrived right after Emily finished her monologue, orders the police chief to see who Clifford's owner is by checking an ID chip he had implanted.\nRating 10: When the chip identifies Emily as Clifford's rightful owner, the police arrest Tieran and inform him that he will be fined for lying to them.\nRating 10: Emily, Casey, and Maggie are welcomed back into their apartment.\nRating 3: Casey gets a job at Scholastic Corporation and moves out of his van."
},{
    "genre": "Romance",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Dramas",
        "Romantic Movies"
    ],
    "id": 80170125,
    "tag": "New Releases",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABcTZ9iNMhAh-Bl-Boaflp40NPC8oXem5RKdt4d0TDCfWzBlcq_rwud_KnCu6XboYgltcdImujmP-H1BcFqrXyWoze-FYmmlfghA.jpg?r=0cb",
    "source": "https://www.netflix.com/in/title/80170125",
    "index": 5,
    "name": "OK Jaanu",
    "maturity": "U/A 16+ ",
    "duration": "2h 14m",
    "synopsis": "A marriage-averse duo decides to cohabitate until their careers send them to different countries. The plan seems logical — until real love develops.",
    "year": "2017",
    "spoilers": "\nRating 8: Aditya \"Adi\" Gunjal  comes to Mumbai to work for a gaming company owned by his boss , aspiring to make it big in the United States as a video game developer.\nRating 3: At Mumbai railway station, he spots a girl  on the adjacent platform trying to jump in front of an approaching train.\nRating 8: A horrified Adi gives her a shout.\nRating 10: The girl then disappears.\nRating 10: Adi moves into Gopi Srivastava's house , his elder brother's senior, a strict, retired High Court judge living with his wife Charu .\nRating 7: Charu is a renowned Hindustani classical singer who suffers from stage two Alzheimer's disease.\nRating 7: On his first day at work, Adi is encouraged by his friend Bantee to pitch the idea of his game \"Mumbai 2.0\" to his boss.\nRating 6: Adi impresses his boss and gets a deadline of five months to prepare a prototype for Los Angeles for a competition.\nRating 10: Later, while at his friend Jenny's wedding, Adi spots the girl from the station.\nRating 10: The girl introduces herself as Tara Agnihotri.\nRating 10: Adi learns that Tara is planning to pursue architectural studies in Paris, and he says that he dreams of becoming a big shot like Mark Zuckerberg.\nRating 8: Adi and Tara strike a chord over their mutual presumptions on the dysfunctionality of the institution of marriage.\nRating 3: Tara also reveals that her antic at the railway station was a ploy to get rid of her ex-boyfriend, who desired to marry her.\nRating 10: Subsequently, they hang out, exploring the city.\nRating 8: The next day, Adi pursues Tara to Ahmedabad on her work trip.\nRating 8: Tara takes Adi to Sabarmati Ashram, which she used to visit with her father as a kid.\nRating 6: She discloses that her decision never to marry was incited by her parents' broken marriage.\nRating 6: Adi and Tara decide to live with each other before they go their separate ways for their respective careers.\nRating 10: The two approach Gopi and Charu with their wish.\nRating 8: Gopi initially strongly disagrees with their desire but then decides to give in when Tara impresses Charu with her classical singing ability.\nRating 7: Adi's family plans to give Adi a surprise visit, and his sister-in-law finds out that he is living with Tara, which his brother would adamantly be opposed to.\nRating 7: She asks Tara to ponder their future when Tara, at some point, would have to pick between her love and her career.\nRating 10: Tara and Adi continue living happily, getting a thrill out of their endearing mutual camaraderie and growing affinity and attachment.\nRating 10: Tara's admission to the institute in Paris gets approved.\nRating 8: Tara informs Gopi of this and confides in him that it might now be hard for her to leave Adi and go so far away.\nRating 10: The next day, Tara goes to Jaipur for a work trip, and Adi starts to miss her profoundly.\nRating 7: Adi gets summoned to Kanpur by Tara's affluent mother, who wishes to know her daughter's intentions.\nRating 10: As a result, Tara finds Adi missing when she returns from Jaipur and searches for him miserably, realizing that living without him would make her sad.\nRating 10: Tara and Adi begin to understand the importance of each other's presence in their life, especially after seeing the love and patience Gopi has for his ailing wife.\nRating 10: One day, she goes missing as she bewilderingly forgets the way to her own house and is found by Tara and Adi sitting on a temple platform in heavy rain.\nRating 7: Tara's mother visits Adi's family to discuss marriage, infuriating Tara.\nRating 3: Later in the day, Adi's game, \"Mumbai 2.0,\" gets selected for the competition in Los Angeles, meaning that he has to leave for the United States soon.\nRating 7: He confides in Jenny that it'd be hard for him to go to Tara.\nRating 8: Tara, too, seems visibly vexed.\nRating 10: The next day, Adi and Tara make a pact to enjoy themselves to the fullest for the next ten days, after which they will eventually go their separate ways.\nRating 10: One day, Charu goes missing again.\nRating 6: While looking for her, they start bickering about their relationship.\nRating 8: However, after finding Charu and bringing her home back to her husband, Adi finally proposes marriage to Tara before leaving for their respective destinations.\nRating 10: They get married in Gopi's house among close friends and family.\nRating 10: Post marriage, both continue to accomplish their dreams, one in Paris and the other in Los Angeles, keeping in touch and waiting for the day to be together again.\nRating 8: { An end credits roll plays the rest of their story in animation, with them finally living together one day and starting a family."
},{
    "genre": "Romance",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Romantic Comedies",
        "Dramas",
        "Comedies",
        "Romantic Movies"
    ],
    "id": 80180043,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80180043",
    "index": 6,
    "name": "Badrinath Ki Dulhania",
    "maturity": "U/A 13+ ",
    "duration": "2h 18m",
    "synopsis": "The entitled son of a wealthy patriarch pursues a driven young woman, but is in for a powerful lesson when she challenges his assumptions about marriage.",
    "year": "2017",
    "spoilers": "\nRating 10: Badrinath \"Badri\" Bansal is the youngest son of a wealthy family in Jhansi.\nRating 4: In a flashback, it is shown that Badri's elder brother, Aloknath \"Alok\" Bansal was madly in love with a girl and was going to leave the family for her because their father disapproved, but decided against it after their father Ambarnath \"Ambar\" Bansal's first heart attack.\nRating 10: Now Alok is married to Urmila Shukla through an arranged marriage and she is not allowed to work despite being very intelligent and better professionally trained than Alok himself.\nRating 10: Alok is also depressed at having to leave his love and be forced into a marriage, so he spends a lot of his time drinking.\nRating 10: Badri fears the same fate for himself and so when he sees the beautiful and educated Vaidehi Trivedi at a wedding supposedly being looked after by her father Mayank, he falls for her immense beauty and charm.\nRating 10: He eventually becomes obsessed with her and makes it his mission to marry her with Ambar's approval.\nRating 10: Vaidehi is an intelligent young woman, much more educated than Badri.\nRating 8: She has completed her graduation and is secretly training to become a flight attendant while Badri has only passed the tenth grade.\nRating 10: She's initially uninterested in getting married and is offended by his marriage proposal because once she fell for a boy named Sagar and decided to marry and start a business with him, but he fooled her family and ran away with all her money.\nRating 3: Badri learns about this and questions Vaidehi why she always runs from marriage proposals.\nRating 8: Badri helps Vaidehi's elder sister, Kritika find a husband in local singer Bhushan Mishra and even resolves a dowry crisis with Bhushan's father Jitendra Mishra, after which Vaidehi agrees to marry him.\nRating 7: On their wedding day, however, Vaidehi does not show up is revealed to have run away to Mumbai.\nRating 3: Furious, Ambar commands a heartbroken Badri to find Vaidehi and bring her back so they can punish her.\nRating 3: Despite being afraid of Ambar's words, Badri goes to Mumbai to find Vaidehi, where he discovers that she's already moved to Singapore for a flight attendant training program.\nRating 3: Badri shows up on Vaidehi's doorstep in Singapore, and kidnaps her, pulling her into his car.\nRating 8: On the way, he pulls over and lets her out of the car trunk and they have an emotional yet heated argument.\nRating 10: Badri is furious at her for leaving him at the altar and she apologizes, trying to assure him that the reason she left was not because of him.\nRating 3: Badri grabs her by the throat while venting out all his frustration and anger on her, when a police car pulls up and is about to arrest Badri for violently approaching Vaidehi, and while she defends him, they both are doubted and Badri is taken to the police station anyway and Vaidehi comes along for testifying.\nRating 3: At the police station, Vaidehi covers up for Badri.\nRating 6: Over the next few days, Badri follows Vaidehi.\nRating 6: Alok calls and tells him that Ambar has started looking for other brides.\nRating 3: This terrifies Badri and he attempts entry into Vaidehi's workplace.\nRating 8: She stops him and tells him she'll marry him only if he can convince Ambar to let her work and live in Singapore.\nRating 10: Badri gets drunk that night and causes a scene outside Vaidehi's residential building and he is arrested by the police again, where this time Vaidehi has to pay $1500 to bail him out.\nRating 10: Badri moves into Vaidehi's apartment where she cares for him by cooking for him before leaving for work every day, which humbles him.\nRating 10: They spend time together with friends and tour Singapore together.\nRating 10: Over time, Badri begins to respect Vaidehi's independence and is impressed by her job and intelligence.\nRating 10: He also remembers Urmila and feels sorry that she doesn't get to work, telling Vaidehi that she would be proud of her.\nRating 10: Badri and Vaidehi begin to spend more time together which causes them to grow closer.\nRating 8: When Ambar calls, Badri lies and tells him that he hasn't found Vaidehi yet, and so Ambar tells Badri to return home.\nRating 10: When Badri receives his passport back, Vaidehi invites him to party with her and his newly made friends.\nRating 10: Later that night, Badri confides to Vaidehi that he feels she would be a lucky charm of a wife for her future husband.\nRating 10: The next day Badri leaves for Jhansi and Vaidehi starts to miss him, depressed by his absence.\nRating 10: Back in Jhansi, Urmila is pregnant and Ambar holds a mega-pooja to ensure that a boy is born.\nRating 7: Badri feels sorry for her and misses Vaidehi at the same time, finally understanding why she ran away.\nRating 8: Before the pooja, he gets heavily drunk and berates Ambar for being disrespectful towards women.\nRating 3: He blames Ambar for being the reason that he can't have Vaidehi when suddenly he sees Vaidehi from the corner of his eye.\nRating 10: She tells him that she loves him and wants to marry him.\nRating 10: Together they stand up to Ambar and tell him that they will get married and Vaidehi will work as she pleases regardless of whether he agrees or not.\nRating 8: In the epilogue, it is shown that Badri and Vaidehi maintain a long-distance relationship while she finishes her training program in Singapore before moving back to India and starting her own flight attendant training center.\nRating 4: Urmila gives birth to twins, one boy and girl, and it is shown that so far Ambar has been treating both of them equally.\nRating 3: She also starts working in the family's car showroom with Alok and even gets her own cabin.\nRating 7: Badri and Vaidehi promise not to collect any dowry for any of their children.\nRating 10: The film ends with Badri and Vaidehi driving off on his motorbike, happily reunited."
},{
    "genre": "Music Non-Fiction",
    "related-genre": [
        "Music"
    ],
    "id": 81678586,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81678586",
    "index": 10,
    "name": "4EVE The 1st Concert Friends & Family",
    "maturity": "U ",
    "duration": "2h 34m",
    "synopsis": "Girl group 4EVE takes the stage at a packed Queen Sirikit National Convention Center in Bangkok for their first concert in front of adoring fans.",
    "year": "2022",
    "spoilers": "\nRating 8: In the wake of using a car-sharing mobile app to cope with his economic problems, Julián, a divorced man, meets Lorena, whom he begins to travel with to Madrid on a regular basis in his Volvo XC60, falling romantically for her.\nRating 8: He is about to open up his feelings in one of those travels, but the situation takes an unexpected turn because of the selection of the rest of passengers."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "Movies Based on Books",
        "Spy Movies",
        "US Movies"
    ],
    "id": 80146758,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80146758",
    "index": 12,
    "name": "The Boss Baby",
    "maturity": "U/A 7+ ",
    "duration": "1h 37m",
    "synopsis": "A kid finds himself at the center of a sinister corporate plot when his parents bring home a baby who only talks business when they're not around.",
    "year": "2017",
    "spoilers": "\nRating 8: Tim Templeton, an imaginative 7-year-old boy, relishes his parents' attention and is horrified when a new baby brother arrives.\nRating 8: Boss Baby, whom he first saw arriving in a taxi, clad in suit and tie, and carrying a briefcase, behaves normally around the adults, crying for attention, food and diapers all day and night.\nRating 8: However, Tim, quickly growing jealous, sees Baby behaving and talking like an adult whenever his parents are not looking.\nRating 6: One day, Baby holds a staff meeting with other toddlers and infants, under the guise of a neighborhood play date.\nRating 9: Tim attempts to record them on a cassette tape, but he is spotted and chased by Baby and his cronies.\nRating 8: The parents see this as the children playing in the yard.\nRating 10: When Baby destroys Tim's stuffed lamb, the latter attempts to slingshot him out a window, but his parents stop him and he accidentally slingshots the tape into the street, on which a car smashes it.\nRating 6: Tim is grounded until he learns to get along with Baby.\nRating 3: Later, Baby makes Tim suck a special pacifier that allows them to see Baby Corp, where babies come from.\nRating 3: Most babies go to families, but those unresponsive to tickling are sent to management, where they are given a special baby formula that allows them to think and behave as adults while remaining young forever.\nRating 7: Baby also explains he's on a special mission to discover why the world's love of babies is being threatened lately by love of puppies, and came to the Templetons as Tim's parents work for\nRating 8: Once his mission is done, he will leave.\nRating 8: However, the boys overhear Baby's boss threatening to fire him if he fail.\nRating 8: As that would mean Baby would have to stay with the Templetons and grow up, Tim and Baby agree to work together to prevent this from happening.\nRating 3: On Take Your Kid to Work Day, the parents take Tim and Baby with them to Puppy Co., where the boys sneak away to investigate.\nRating 3: They are captured by Francis Francis, CEO of Puppy Co, who reveals he was previously the Boss of Baby Corp, but started to slowly grow up because he was partially intolerant to the formula.\nRating 10: He was fired and forced to live with a hillbilly family, but saved his magic pacifier.\nRating 3: He steals Baby's formula, intending to use it to make a \"Forever Puppy\" incapable of aging or dying, which will take all love from babies and give him his revenge on BabyCorp.\nRating 8: Francis whisks Tim's parents away to a conference in Las Vegas, and leaves his brother Eugene to watch the children in the guise of a female nanny.\nRating 10: Without the formula, Baby starts to periodically revert to normal infant behavior.\nRating 10: The boys, with help from the neighborhood toddlers, escape Eugene and head to Las Vegas, where they find Francis ready to send a rocket of Forever Puppies out into the world.\nRating 8: Tim's parents suspect something is wrong when they hear their children, but are locked up underneath the rocket to be burned.\nRating 7: Tim and Baby fight Francis on a raised walkway, pretending to be pirates; they knock him into the vat of augmented formula, where he turns back into a baby and is taken home by Eugene.\nRating 10: Tim saves his parents, but Baby goes completely infantile and is stranded on the rocket, which is about to launch.\nRating 10: Tim sings him a lullaby, and Baby jumps to him and is revived by the formula.\nRating 8: Baby is taken back to Baby Corp and promoted to CEO.\nRating 10: Some Baby Corp employees enter Tim's house, where they remove evidence of Baby, and make his parents forget about him while they are sleeping.\nRating 10: One of them asks Tim if he would like to forget too, but he declines.\nRating 10: Baby and Tim miss each other terribly, and Tim finally invites Baby back, saying if there is only love enough for one of them, Baby can have it all.\nRating 10: Realizing that love is something that grows, instead of being split, Baby returns, this time as a normal infant boy named Theodore \"Ted\" Templeton.\nRating 10: Years later, an adult Tim and Ted tell the story to Tim's eldest daughter, who is apprehensive about the arrival of her new baby sister.\nRating 10: After the adults leave, the newborn little girl reveals she is a Boss Baby, too, surprising the elder daughter."
},{
    "genre": "Action",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Dramas",
        "Comedies",
        "Action & Adventure"
    ],
    "id": 81595543,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81595543",
    "index": 13,
    "name": "Shehzada",
    "maturity": "U/A 13+ ",
    "duration": "2h 22m",
    "synopsis": "After realizing he was switched at birth by a conniving father, a rakish Bantu’s life is upended when he becomes the heir to a billionaire.",
    "year": "2023",
    "spoilers": "\nRating 8: Valmiki and Randeep start their career as clerks in the company of Aditya Jindal.\nRating 8: Randeep, who marries Jindal's daughter Yashoda \"Yashu\", becomes wealthy while Valmiki remains poor.\nRating 10: On the day of the birth of both their children, Randeep's son appears to be dead.\nRating 3: When nurse Sulochana informs Valmiki about this, he pities Randeep and offers to exchange his baby with the dead one since the Jindals have done so much for him.\nRating 8: After switching them, however, Randeep's child begins to cry, having not died after all.\nRating 10: Valmiki, sensing that his son would have a better life growing up in a rich family, prevents Sulochana from switching the babies back and accidentally pushes her off a ledge.\nRating 10: Sulochana goes into a coma, keeping Valmiki's secret from coming out.\nRating 10: 25 years later, Raj, raised at Jindal's house, is timid and innocent while Bantu, raised by Valmiki, is street-smart and outspoken.\nRating 10: Valmiki, who favours  his own son Raj, treats Bantu badly.\nRating 10: Bantu gets a job at a law firm headed by Samara, who is impressed by his knowledge and quick-wittedness.\nRating 8: Meanwhile, Raj returns from his studies abroad.\nRating 4: Jindal sends Raj to reject Sarang, a powerful man who offers to buy their company's shares but deals with drugs.\nRating 8: Randeep watches the deal from a restaurant where Samara has a meeting.\nRating 10: When the client misbehaves with Samara, Bantu interferes.\nRating 8: Randeep is disappointed by Raj's inability to say no to Sarang but beams at Bantu and Samara when they defend themselves against the rowdy client.\nRating 10: Following this, Raj becomes engaged to Samara\nRating 8: but she and Bantu have fallen in love.\nRating 8: Sarang attempts to kill Randeep for getting in his way.\nRating 8: Bantu saves Randeep; at the hospital, he meets Sulochana, who has come out of her coma.\nRating 10: She reveals Bantu's true parentage before dying.\nRating 5: Bantu denounces Valmiki as his father.\nRating 10: Aditya Jindal, Bantu's true grandfather, is fond of Bantu for saving Randeep and hires him.\nRating 3: Bantu begins to address the issues plaguing the house by patching up Randeep relationship with Yashu, which had been strained since Randeep's affair seven years ago.\nRating 10: He also settles the dispute with Sarang and reforms the corrupt family members.\nRating 7: He and Samara tell Raj about their relationship; Raj calls off his marriage with Samara and confronts his parents, telling them he should be allowed to make his own decisions rather than have everything handed to him.\nRating 10: Sarang kidnaps Yashu and threatens to kill her unless Randeep gives him money.\nRating 10: Bantu saves Yashu.\nRating 6: Jindal reveals that he knew all along who Bantu was, which is why he brought him home; he had overheard the conversation between Sulochana and Bantu right before her death.\nRating 10: Bantu unites with Randeep but asks him not to reveal the truth to Yashu, fearing she might be disheartened to know that Raj, who she dotes on so much, is not her real child.\nRating 8: Yashu remarks that Bantu is like her son, as he saved her and the family.\nRating 6: Yashu asks Valmiki to train Raj to be as competent as Bantu and become the CEO of their company.\nRating 10: Bantu forgives Valmiki and mends his relationship with him."
},{
    "genre": "Drama",
    "related-genre": [
        "Dramas"
    ],
    "id": 81671561,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81671561",
    "index": 15,
    "name": "Vaathi",
    "maturity": "U/A 13+ ",
    "duration": "2h 14m",
    "synopsis": "When a private school teacher is assigned to a neglected public school, he must overcome personal and political strife in his fight for education.",
    "year": "2023",
    "spoilers": "\nRating 4: Abhiram is a student in Thirupathi /Tripathi  Educational Institutes run by Srinivas Thirupathi/Srinivas Tripathi, preparing for EAMCET along with his friends finds an old box full of tape records while cleaning his grandfather's video shop which is going to sale for his Engineering seat that shop is well known as well as oldest video shop and first video shop in olden days.\nRating 8: Abhi and his friends plays the tape to check its contents , where they find a person teaching mathematics in a very clean and efficient manner, where the friends find the maths taught by him found maths easy and checks the box again.\nRating 8: They find a receipt on which a name is written A. M. Kumar  / A. S. Murthy  and dates back to 4 May 2000.\nRating 9: They also notice the place written, Sozhavaram  / Siripuram .\nRating 5: The trio decide to travel to that place to find the man named A. M. Kumar/A. S. Murthy .\nRating 3: After inquiring many people, they meet the Village Government college peon Subbaya who tells them that A. M. Kumar/A. S. Murthy is not a lecturer, but was once a student and now the DC of Kadapa.\nRating 3: The trio reaches Kadapa and ask A. M. Kumar/A. S Murthy about the man in the video, where he tells them about the man named Balamurugan 'Bala'  / Bala Gangadhar Tilak 'Balu' .\n1993:\nRating 8: During the time of privatization of the economy, education has become a necessity for people to grow big and professional courses like MBBS and engineering saw a huge demand.\nRating 8: Noticing this sudden spike in education, many investors have turned education into business.\nRating 7: In the name of quality education, they started cashing hefty money from parents to get their children admitted into their private colleges.\nRating 10: At the same time, the government had a hard time running their colleges and couldn't even pay the lecturers salaries.\nRating 7: The private colleges even hired top class and experienced government college lecturers to teach in their own colleges.\nRating 8: 1998:\nRating 10: Many government colleges had to shut down due to shortage of lecturers.\nRating 10: For the poor who couldn't afford private institutions, education had become inaccessible.\nRating 3: Srinivas Thirupathi/Srinivas Tripathi, the president of private junior colleges association hatches a master plan to adopt all the government junior colleges and send third-grade junior lecturers to those colleges, thus supporting the ruling government to stop the regularization of fee scheme by the government.\nRating 7: Bala/Balu is one of those lecturers, who is sent to a government junior college to teach Mathematics along with Karthik, a chemistry lecturer, and Prakash Reddy / Bulli Reddy , a physics lecturer.\nRating 8: Thirupathi/Tripathi promises that any lecturer who performs well in their field will be promoted to senior lecturer upon being asked by Bala/Balu.\nRating 3: The next day, the three lecturers are taken to Government Junior College, Sozhavaram  / Government Junior College, Siripuram .\nRating 10: They are received warmly by the village's President Muthu Pandian  / Patthi Papa Rao , where Bala/Balu sees Meenakshi, a biology lecturer, and falls for her.\nRating 10: The next day, none of the students show up to the college.\nRating 8: Bala/Balu learns from the Telugu lecturer Thanigachalam  / Deekshitulu  that all the warm welcome was just for publicity and students arrives for sweets and hots at the college.\nRating 8: Meenakshi tells him that before the shutdown of government colleges, this was the only government college in the district, and many students from the neighboring districts used to arrive, but they were unable to trust them even after opening, thinking that they might close the government colleges sooner or later.\nRating 10: Bala/Balu made a promise to Meenakshi that he will get all the students to the class within 3 days.\nRating 3: He asked the president to organize a meeting with all the villagers and their children.\nRating 10: Bala/Balu gave a speech about the necessity of education, thus making the children and parents realize its importance.\nRating 7: The students then started coming to the classes.\nRating 5: Bala/Balu also brought back an ex-student, Muthu  / Satti , who discontinued his education after his parents committed suicide and got addicted to alcohol and smoking.\nRating 3: Bala/Balu offers him a job 30 rupees per day as his daily wage and assures him to study as his work.\nRating 8: He also reformed many students like Kumar/Murthy and his gang, who were not interested in their studies.\nRating 10: Meanwhile, Karthik gets ill and leaves the college, as does Prakash Reddy/Bulli Reddy.\nRating 7: With their departure, Bala/Balu takes over the responsibility of teaching both Physics and Chemistry classes as well, for both MPC and BiPC students.\nRating 8: Bala/Balu noticed that due to caste differences some students ill treating other students.\nRating 8: He eliminated this barrier within the class and from their minds, by explaining that necessity had no caste thus making them united and effectionate on each other.\nRating 10: Meenakshi was impressed by this act and fell for him.\nRating 8: The board exams took place and all the students passed with first class.\nRating 8: With the 100% pass percentage achieved by Bala/Balu, Thirupathi/Tripathi confronted him and told him that the pass percentage of his own private college is just 75% and people wanted to join the government colleges, owing to the quality of education.\nRating 10: He tried to lure him with a senior lecturer promotion and salary hike in one of his private college, but Bala/Balu did not fall for it and in-fact, stopped working for him.\nRating 10: He even challenged Thirupathi/Tripathi that he will make all the students pass with distinction the next time and also get them a good rank in the TNPCEE/EAMCET examination.\nRating 9: With this, Thirupathi/Tripathi bribed the opposition party leader to create a strike on unemployment and also the ruling party's education minister to take back the positions offered to lecturers at Government junior colleges and recruit new ones.\nRating 10: This caused Balu/Bala to lose his job and his father, Narayanan  / Narayana , his job as a driver.\nRating 8: Nevertheless, Bala/Balu took classes in an open field, in the village.\nRating 7: Thirupathi/Tripathi asked Muthu Pandian/Patthi Papa Rao to arrest him and drive him away from the village.\nRating 5: Bala/Balu fights back, but the cops arrest him and take him into custody.\nRating 4: They gave him third degree treatment.\nRating 10: He was dropped back into the village soon afterward, where the villagers were asked not to help him gather his things, denoting that he misused government school funds.\nRating 8: However, seeing Bala/Balu barely able to walk, that too, under the scorching sun, all the students gathered and helped get onto a bus safely, to be taken back to city, with a heavy heart.\nRating 10: After Bala/Balu recovered, he took up tuitoring at his home, after many failed job interviews at the private junior colleges.\nRating 8: Meenakshi arrived and made it clear that she wants to stay with him only, having decided to marry him.\nRating 10: They saw a young boy willing to study, but was unable to, due to poverty.\nRating 8: His father constantly kept pressurizing him to earn money.\nRating 4: Bala/Balu took him to his teacher's, Mohammed Ansari's house, for tuition, free of cost.\nRating 3: Meenakshi asked Bala/Balu to return back to the village to teach the children.\nRating 7: As he was banished from the village, Bala/Balu got the idea of recording his lectures, using cassette tapes, and send them to Bittu Bhupathi  / Boothu Bhushanam  , a highly demanded photographer in Siripuram who runs a video shop in Anakapalli and local theater in Siripuram which famous for running Blue films.\nRating 8: He asked Bhupathi/Bhushanam to run special shows for the intermediate students from 6:00PM to 9:00PM, everyday, where only Bala/Balu's lectures would be played.\nRating 8: The whole village would think of it as another film.\nRating 7: In this way, Bala/Balu took classes for the students and also told them that, they have to pass with distinction, and also crack the TNPCEE/EAMCET examination.\nRating 3: To clear the students questions and clarifications regarding the subjects, Bala/Balu constantly visited the village, under the guise of a drama artist, each Sunday.\nRating 10: Thirupathi/Tripathi learnt about this and tried to order Muthu Pandian/Patthi Papa Rao to finish him off, to which he did not agree, stating that he was just using him.\nRating 10: Muthu Pandian/Patthi Papa Rao knew about Bala/Balu's toil to teach the students and had a change of heart after seeing his daughter perform really well.\nRating 3: He permitted all students of the village to go to junior college.\nRating 10: On the day of the TNPCEE/EAMCET examination, while the students were on their way to the exam center, Thirupathi/Tripathi sent goons to stop them.\nRating 3: Bala/Balu fought them off and sent the students to write the exam.\nRating 10: The students performed extremely well and cleared the TNPCEE/EAMCET examination in the top 100 ranks to their surprise Satti announces his full name as A. M. Kumar/A.S.Murthy scoring State first rank in EAMCET.\nRating 10: Thirupathi/Tripathi offered money to all the 46 students, promising them sponsorship for their further studies and also a good life to their families, just for them to tell everyone that they have scored such good rankings, because of Thirupathi/Tripathi Educational Institutions and not because of Bala/Balu.\nRating 10: Bala/Balu asked them to agree to it, because that is what he always wanted for them, everybody to respect them.\nRating 8: He asked the students to use Thirupathi/Tripathi's ego, to climb the social-economical ladder to become successful and give back to those in the future, who would not be able to afford education.\nRating 3: The students signed the contracts, but Bala/Balu and Meenakshi were never seen after that.\nRating 8: Present:  A. M. Kumar/A.S.Murthy continues his story to the trio that the theater where they studied is now an EAMCET/IIT coaching center for the underprivileged, developed by the 46 students, who take turns and teach the students each year by mentioning that it is their guru dakshina  to Bala/Balu sir.\nRating 10: When asked about the current whereabouts of Bala/Balu, A. M. Kumar/A. S. Murthy replies that he does not know about his location, or even if he is alive.\nRating 3: But he is sure that wherever Bala/Balu went after Sozhavaram/Siripuram, he would have made education accessible to everyone.\nRating 8: Meanwhile in Ooty, it is shown that a still alive Bala/Balu and Meenakshi now married have opened a school, Ansari School of Knowledge, named after Mohammed Ansari, to provide free education for the underprivileged as his Guru dakshina for inspiring him to become a good teacher as per his last wish.\nRating 9: In a deleted scene Abhi who became as JEE All India First Rank Holder his friend's also become toppers in the exam by the guidance of Kumar/Murthy.\nRating 10: In Tripati achievement ceremony Abhi reveals study videos of Bala/Balu and gives whole credit to Bala/balu sir in front of Thirupathi/Tripathi finally film ends up ruining his reputation."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "US Movies"
    ],
    "id": 80992263,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80992263",
    "index": 16,
    "name": "Chupa",
    "maturity": "U/A 7+ ",
    "duration": "1h 38m",
    "synopsis": "While visiting family in Mexico, a lonely boy befriends a mythical creature hiding on his grandfather's ranch and embarks on the adventure of a lifetime.",
    "year": "2023",
    "spoilers": "\nRating 3: In 1996, scientist Richard Quinn is hunting down the chupacabra, a supposedly mythical creature, in San Javier.\nRating 8: A government doctor, he believes that its healing powers will help revolutionize medicine.\nRating 9: Locating one with a cub in an old mine, he chases it.\nRating 10: Injured by a passing vehicle, she leaves her cub hidden to lure the pursuing scientists away.\nRating 10: Following the death of his father Beto from cancer, 13-year-old Alex flies to Mexico to meet his extended family for the first time, a trip his father had planned for them both.\nRating 10: Alex meets his grandfather Chava, a former lucha libre champion, energetic wrestling-obsessed cousin Memo, and fearless hip cousin Luna.\nRating 8: Just as Alex begins to get his bearings, on his first night he discovers a young chupacabra cub.\nRating 7: He wakes to find it licking a cut on his hand.\nRating 10: As Alex realizes they aren't positively regarded, he says nothing.\nRating 6: A short time later, Luna drives Memo and Alex into town to search for Chava.\nRating 3: She explains that he often wanders off .\nRating 9: In the market, Alex sees a miniature colorful figure, which the seller tells him is a chupacabra, which he says is not such a bad creature.\nRating 7: Back on the road, the kids find Chava walking with a billy goat.\nRating 10: He bought it, but can't explain why.\nRating 3: On their return to the ranch, they come across some men carefully searching an area where Quinn finds evidence of what he believes is the chupacabra.\nRating 3: At the ranch house, they watch yet another news report on the feared full-grown Chupacabra, fabled to feed on livestock.\nRating 10: Chava turns off the TV, saying it's nonsense and lies.\nRating 8: Once he goes out, Alex tells Luna that their grandfather is hiding something.\nRating 8: He shows her a small music box he found him playing in the barn.\nRating 10: She chalks it up to more evidence of his suspected Alzheimer's.\nRating 7: Alex plays the music box in the doorway of the barn later.\nRating 8: Hearing a mix of cooing and other sounds, he turns to see a strange creature: a small cat-like animal with bird-like wings and small but sharp fangs.\nRating 8: Alex gets it a plate of sausages from the house to see if it's hungry.\nRating 10: When a thunder storm rolls through, he promises to protect it.\nRating 3: Alex wakes to Memo looking for him.\nRating 8: He tries to usher him out of the barn, but the young Chupacabra presents himself as Alex befriended him.\nRating 8: He has just gotten Memo calmed down when Luna shows up.\nRating 8: Also initially screaming, they show her that he is friendly.\nRating 3: Luna thinks they should put him out, but Alex insists they must protect it as it's a cub.\nRating 10: Chava comes in, agreeing with Alex.\nRating 10: Chupa, as Alex has named it, approaches him.\nRating 8: Chava explains that he'd accidentally hit its parent with his car some nights ago and had found it hiding nearby.\nRating 4: He keeps it a secret as he knows people are looking to exploit it.\nRating 8: Returning to the house, Quinn introduces himself, explaining he's from an American government agency that seeks rare species for medical purposes.\nRating 3: Finding a license plate from the crash site, he has traced it to him.\nRating 3: Despite Quinn’s seemingly generous agenda, Chava refuses to let him snoop around, offering to demonstrate a lucha libre move if he does not leave.\nRating 8: After Alex promises Chupa he will find his family, Memo comes to teach it to fly.\nRating 10: Taking it to the barn roof, Memo fearlessly 'flies' into a haystack below.\nRating 3: Encouraging it to follow, Chupa gets the wings to work a bit before also falling into the hay.\nRating 3: In the house, Chava shows Alex a video of El Perico Verde doing his signature move suplex, which he had taught him himself.\nRating 3: He reveals that Beto was the fighter, but never became professional because he met Alex's mother and moved to the States.\nRating 8: Once Chava talks about Beto enough to sadden Alex, he pulls out his Game Boy.\nRating 10: He recognizes it is his way of avoiding his feelings.\nRating 7: Taking the video console, Chava tells Alex he must fight him for it.\nRating 10: Donning his Relampago Azul mask, and Alex his father's, he gets him to express himself.\nRating 9: Having learned that his new friend, Chupa, has a secret history with his family and is being hunted by the determined Quinn to try to harness his powers, Alex and his family set off on the adventure of a lifetime to protect Chupa from impending danger."
},{
    "genre": "Kids",
    "related-genre": [
        "Children & Family Movies",
        "Westerns",
        "US Movies"
    ],
    "id": 81594709,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81594709",
    "index": 17,
    "name": "Spirit Untamed",
    "maturity": "U/A 7+ ",
    "duration": "1h 27m",
    "synopsis": "After moving to a new town, a rebellious girl forms a bond with a wild mustang and finds a connection to her late mother’s legacy as a trick rider.",
    "year": "2021",
    "spoilers": "\nRating 10: In the early 1900s of the Wild West, Milagro Navarro-Prescott performs her trademark act in the circus until she falls from a horse during one of her performances and dies.\nRating 9: Years later, her young daughter, Fortuna Esperanza \"Lucky\" Navarro-Prescott, has been living with her aunt Cora and grandfather James in a city on the east coast.\nRating 3: However, after Lucky lets a squirrel in their house and ruins her grandfather's campaign party, she and Cora head to the western town of Miradero where they will stay with Lucky's father Jim, whom Lucky has not really known of after the incident with Milagro, for the summer.\nRating 10: On the train over, Lucky notices a kiger mustang running with his herd, and goes to the back of the train to meet him.\nRating 10: Upon arriving in Miradero, the pair meet local young riders Pru Granger , and Abigail Stone .\nRating 8: The next day, Lucky goes to a corral where she sees the same horse from before trying to be abusively manhandled by a man named Hendricks.\nRating 9: Lucky tells Jim and Cora about the horse, thinking he can be her new friend, but Jim does not want Lucky going near the horses after what happened to Milagro.\nRating 10: Nonetheless, Pru and Abigail help Lucky win over the trust of the horse, whom she names Spirit.\nRating 10: After a while, Spirit trusts Lucky enough to eat an apple she offers him, and allows her to pet him, sealing their bond.\nRating 4: Lucky attempts to ride Spirit but he escapes from the corral and runs away, while Lucky is saved by Pru and Abigail after almost falling off a cliff.\nRating 3: Jim finds and scolds Lucky for disobeying him.\nRating 8: They go home arguing, making Lucky think he has given up on her.\nRating 3: She sneaks out at night through the forest where she finds Spirit and his herd together, but are interrupted by Hendricks and his men, who capture all the horses but Spirit and take them in with a stolen train.\nRating 10: Knowing Hendricks and his men are wranglers, who are taking the horses to a boat to be auctioned and worked to death, Lucky agrees to help Spirit rescue his herd.\nRating 8: She enlists Pru and Abigail with their horses to embark on a journey to try and cut the wranglers off on their path by beating them to a water depot located beyond a summit called Heck Mountain.\nRating 10: During the trip, Lucky builds up her relationship with Spirit, and becomes good friends with Pru and Abigail as they travel.\nRating 3: The girls reach the water depot the night before the wranglers are set to arrive, but Lucky wakes up the next day realizing the wranglers made it earlier than expected.\nRating 10: Spirit desperately attempts to save his herd on his own, but gets taken in by the wranglers.\nRating 10: Determined to save Spirit, Lucky and her friends follow the train to the docks, where the wranglers are boarding the horses onto the boat.\nRating 10: The girls arrive too late to stop the boat from leaving, but they manage to save Spirit.\nRating 3: Lucky and Spirit get on board by leaping off the docks, and free the other horses and subdue the wranglers, with Spirit knocking Hendricks off the boat.\nRating 3: Jim, Cora, and Al  show up on a fast steam train, and arrest Hendricks and the other wranglers.\nRating 3: On their way back to Miradero, the girls travel to a field in the middle of the wilderness, and Lucky lets Spirit go, saying that he needs to stay with his herd.\nRating 4: When she returns home, Lucky and Cora initially plan to return to the city, but after Lucky bonds with Jim at a rodeo, she decides instead to stay in Miradero with him and her friends, as Spirit is seen riding through the fields with his herd."
},{
    "genre": "Action",
    "related-genre": [
        "Action & Adventure"
    ],
    "id": 81551307,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81551307",
    "index": 19,
    "name": "Waltair Veerayya",
    "maturity": "A ",
    "duration": "2h 37m",
    "synopsis": "Desperate to nab a wanted criminal on the run, a cop turns to the formidable Waltair Veerayya, a fisherman with a notorious streak, for help.",
    "year": "2023",
    "spoilers": "\nRating 10: Waltair Veerayya, a notorious fisherman-cum-smuggler from Vizag, needs money to fight a court case.\nRating 8: He is approached by CI Seethapathi, who tells him about Solomon Caesar, a notorious drug lord who escaped from RAW's custody after killing multiple police officers.\nRating 10: Seethapathi, who was responsible for Caesor's custody, gets suspended from service.\nRating 7: He asks Veerayya to extradite Caesar from Malaysia to India, in exchange for providing money.\nRating 10: Veerayya accepts the deal and travels to Malaysia with his friends and Seethapathi's brother-in-law.\nRating 3: They check in at a hotel owned by Caesar and devise a plot to kidnap him.\nRating 10: However, Veerayya misses the opportunity as he gets stunned by seeing Dr Nithya and her daughter, Vaishnavi, where Nithya angrily takes the kid away from Veerayya.\nRating 8: Seethapathi's brother-in-law gets impatient and prompts Seethapathi to follow Caesar on their own without Veerayya's knowledge, only to get caught by Caesar.\nRating 10: Veerayya arrives at the place and tricks Caesar into believing that they want to cut a drug deal with him, therefore saving the day.\nRating 3: Later, Veerayya gets invited by Caesar to his private party where a group of masked assassins attempt to nab Caesar, but their plans are foiled by Veerayya, who later realises that they are the hotel staff.\nRating 8: They reveal themselves as RAW agents, led by Athidhi.\nRating 6: Caesar expresses his admiration for Veerayya and offers to ask him anything in return for saving his life.\nRating 8: Veerayya asks him to come back to India and Caesar agrees, but soon finds out about their ploy and they get busted.\nRating 3: As Caesar assaults Athithi for information with his elder brother Michael Solomon on video conference, Veerayya retaliates and reveals that Michael was his ultimate target.\nRating 3: Veerayya kills Caeser at the public fair in the Batu Caves, where a helpless Michael witnesses everything.\nRating 3: Past: Four years ago, Michael, in disguise as a fisherman named Kaala, acts as Veerayya's friend and confidant.\nRating 10: Without Veerayya's knowledge, Michael supplies drugs from the former's ice factory.\nRating 6: The newly appointed ACP Vikram Sagar, who is also Veerayya's half-brother, arrives in Vizag and begins a crackdown on the drug syndicate.\nRating 5: During their childhood, Veerayya, who suffered from vertigo, accidentally let Sagar fall from a tree.\nRating 10: Ever since, the brothers grew up separately.\nRating 10: Though Sagar developed hatred towards Veerayya, Veerayya always loved him.\nRating 10: Sagar is also happily married to Dr. Nithya and they bear a daughter Vaishnavi.\nRating 8: Sagar tracks down the origin of drugs in Veerayya's locality, but Michael manages to keep his cover.\nRating 10: One day, the ice factory accidentally supplies cocaine, wrapped in ice to a school, which resulted in the deaths of 25 children.\nRating 8: Michael subsequently frames Veerayya and plans to escape to Malaysia.\nRating 7: Veerayya gets arrested by the police, who decides to kill him in an encounter to calm the public rage.\nRating 3: Sagar, who believes that Veerayya is innocent, loots the seized drugs to lure Michael.\nRating 3: He secretly arrives at the planned encounter shooting, in place of Veerayya to nab Michael.\nRating 8: However, the JCP, who is also Sagar's senior officer, is in cahoots with Michael, where he fatally stabs him, along with Michael's men.\nRating 10: Michael manages to escape as Veerayya arrives, not before he shows his true face to him.\nRating 7: Veerayya tries to take a heavily injured Sagar to the hospital, but he succumbed to his injuries on the way, revealing that he always had affection for him, but could not express it publicly due to his crackdown on the drug syndicate.\nRating 8: Veerayya is stopped by the police and taken away.\nRating 10: Sagar is deprived of state honours and labelled as a traitor by the police.\nRating 8: Heartbroken, Veerayya decides on extraditing Michael to India for his testimony in court, before Seethapati shows him the way.\nRating 8: Present: Veerayya sets up Michael against his drug partner by blowing up his base of operations.\nRating 5: The rival gang attempts to kill Michael, where he agrees to come to India with Veerayya and testify in court, in exchange for his life.\nRating 10: With the help of Athithi, Veerayya brings Michael back to India.\nRating 10: Following Michael's testimony, the court recognises Sagar's valour and grants him state honours, whilst also acquitting Veerayya of his charges.\nRating 10: To fulfil Sagar's last wish of avenging the children's deaths, Veerayya severs Michael's head in the courtroom and is sentenced to prison."
},{
    "genre": "Comedies",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Comedies"
    ],
    "id": 81387251,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81387251",
    "index": 20,
    "name": "Cirkus",
    "maturity": "U/A 7+ ",
    "duration": "2h 14m",
    "synopsis": "Chaos and comedy take the spotlight when a ringmaster and his band of acrobats set out to revive the fading culture of classic circus entertainment.",
    "year": "2022",
    "spoilers": "\nRating 10: In 1944, Dr. Roy Jamnadas , who is working on the theory of nature vs nurture, separates two sets of identical twins he finds at the doorstep of the orphanage he runs and gives them up for adoption to two different families, based in two different cities.\nRating 8: One pair is given to a couple in Ooty and the other pair to a couple in Bangalore, and both the couples name them Roy and Joy, after Dr. Roy and his own adoptive brother Joy.\nRating 10: Roy 1  and Joy 1 's father runs a circus and after his death, they both take up the responsibility of running the circus.\nRating 10: Roy 2 and Joy 2's father is a rich industrialist.\nRating 5: Roy 1 has a strange connection with electricity and electric currents do not affect him.\nRating 10: He uses this ability to show tricks at the circus and becomes famously known as 'Electric Man'.\nRating 3: Elsewhere, Roy 2 receives electric shocks whenever Roy 1 comes into contact with electricity.\nRating 7: The story then moves forward 30 years.\nRating 8: Roy 1's wife, Mala , cannot conceive and wishes to adopt a child from the Jamnadas Orphanage, but Roy 1 is against the idea.\nRating 8: Roy 2 is in love with Bindu but her father Rai Bahadur is sceptical about him as he had seen Roy 1 with Mala in Ooty and had mistaken him for Roy 2, thinking that he is cheating on Bindu.\nRating 9: Roy 2 and Joy 2 come to Ooty to buy a tea estate and there is a lot of confusion and misunderstanding as people mistake them for the other pair of twins.\nRating 5: Three robbers - Momo, Mango and Chikki are after them to rob their money.\nRating 3: They back off when Roy 2 gives them electric shocks and their boss, Polson Dada later comes to take revenge.\nRating 3: They also come across Nagmani, the shady cab driver and Bagheera, the dacoit turned hotel owner.\nRating 8: Roy 2 thinks they are all part of a huge criminal gang who want to rob them, and when they happen to come across Mala, they think that she is the leader of the gang.\nRating 10: Roy 1 decides to gift a diamond necklace to Mala but the jeweler mistakenly gives it to Roy 2, creating further confusion.\nRating 8: Moreover, Bindu's father is now convinced that Roy 2 is married to Mala.\nRating 8: On hearing this, Bindu threatens to end her relationship with him, not knowing that Mala is actually Roy 1's wife.\nRating 3: All the confusion is cleared when both the pairs of twins come face to face at the circus and Dr. Jamnadas reveals the truth to them and his real intention behind separating them.\nRating 10: They all reconcile and Roy 1 and Mala finally adopt a child from the orphanage and Roy 2 and Bindu plan to get married soon.\nRating 8: Later, five orphan boys - Gopal, Laxman 1, Madhav, Laxman 2 and Lucky come to stay at the orphanage, hinting the events before Golmaal Again."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Action & Adventure"
    ],
    "id": 81644302,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81644302",
    "index": 21,
    "name": "Thunivu",
    "maturity": "U/A 16+ ",
    "duration": "2h 22m",
    "synopsis": "A major bank heist takes an unnerving turn when a mysterious interloper known only as Dark Devil begins to hijack the operation.",
    "year": "2023",
    "spoilers": "\nRating 8: Radha, a dreaded gangster, and his men plan a heist at \"Your Bank\", one of the biggest privately-owned bank in Chennai, with the support of ACP Ramachandran.\nRating 8: They plan to rob ₹500 crore on 21 May, coinciding with the Governor's party event at his residence.\nRating 10: On the day of the heist, Radha and his men hijack the bank, only to discover that the bank is already hijacked by a mysterious man nicknamed Michael Jackson and his accomplice, Kanmani.\nRating 10: The commandos arrive inside the bank, but get defeated.\nRating 6: Jackson later makes a deal with Radha to help him rob ₹5000 crores, in exchange for a share of the money, for which Radha and his men reluctantly agree.\nRating 10: When Radha finds that the bank locker contains only ₹1,510 crores, they decide to kill Jackson, only to be defeated.\nRating 8: Jackson insists that Antony alias Anto, a police constable to be the negotiator, much to Ramachandran's ire.\nRating 8: He uses a voice changer of Michael Jackson, tricking the people and the media into referring him as Michael Jackson.\nRating 10: Ramachandran tries to kill Jackson with a sniper, only for him to make an explosion in a car parked nearby the bank using a bomb.\nRating 3: With the events being leaked to the media, city commissioner Dayalan is called in to handle the situation.\nRating 8: While inspecting the bank, Jackson finds explosives, disguised as fire extinguishers, and deduces that a third team has also entered the bank, without him knowing.\nRating 7: The police tracks a van where Kanmani is guiding Jackson, but Kanmani destroys the van, and escapes.\nRating 3: Ramachandran sends his men to trace Kanmani, but she kills them and exposes Ramachandran's involvement in the heist to Dayalan, who interrogates him, and he confesses that he along with his childhood friend Shyam, the Tamil Nadu Branch Head of Your Bank, planned the heist.\nRating 8: Ramachandran tried hiring Jackson, who goes by the name \"Dark Devil\", for the job, but he refused.\nRating 8: Ramachandran later hired Radha's gang for the job, without revealing that they will be killed after the heist.\nRating 3: Radha and his gang join and assist Dark Devil after hearing Ramachandran's confession through bugs planted on Dayalan's base.\nRating 3: Shyam flees from police after they learnt about his involvement, but is captured by Kanmani.\nRating 3: Meanwhile, Dayalan finds that Valavan was the one who wired and planted explosives in the drainage, and begins to search for him.\nRating 3: He also learns that Dark Devil and his team actually died a few months ago.\nRating 10: Ramachandran tries to prove that Dark Devil is alive by detonating a dummy bomb only to get killed when the bomb turns out to be a real one and explodes after the wire in it gets detached.\nRating 3: Dark Devil learns from Kanmani that there are ₹25,000 crores available in the bank.\nRating 4: Dark Devil tells Dayalan to arrange a meeting between him and chairman of Your Bank, Krish.\nRating 6: As Dark Devil deduced, the third team, revealed to be some of the bank's staff, attack Radha and his team in the locker, before assaulting Dark Devil and hold him captive.\nRating 5: Krish arrives and reveals that the third team were hired by him and tells them to destroy the bank's chest with explosives with hostage inside.\nRating 10: Krish also forces Dark Devil to reveal himself, where Dark Devil reveals that he and his teammates lived happily together like a family.\nRating 3: After having committed a heist in Bangkok, Dark Devil's members, Jijo and Achara planned to get married.\nRating 9: They all travelled to Araku Valley, Andhra Pradesh to arrange their marriage and celebrate, but they were ambushed by assailants sent by Krish and Shyam, who feared that they would reveal their heist plan to others.\nRating 8: Jijo and Achara got killed, but Dark Devil and Kanmani managed to escape and the killers faked their deaths for the rest of their deal money.\nRating 7: The duo reached the house of an old couple, who tends their wounds and revealed about his son Kavin, an honest bank official, who wanted to return the money to the people who invested in mutual funds.\nRating 10: However, Kavin was killed by Krish, and made it look like a mob did this during a strike.\nRating 10: Having learnt about this, Dark Devil and Kanmani decided to bring Krish and the bank officials to justice.\nRating 7: After the revelation, Dark Devil defeats Krish and his team, where he forces him on live to reveal about his financial scam of the ₹25,000 crore, which was invested in the mutual funds, and the atrocities committed against people by the bank officials.\nRating 8: Shyam, who was made to wear a bomb vest is sent to Dayalan, where he reveals everything about the heist and Krish's involvement in it, before he is killed by Kanmani's phone call.\nRating 3: Dark Devil also brings mutual funds chairman Harsha, who was abducted by Kanmani at gunpoint and Sunil Dutta, who was abducted from Mauritius by Dark Devil's men and was also responsible for stealing data from the NSE backup server of the Indian Stock Exchange.\nRating 8: Sunil confesses that he invested in 10 companies belonging to Krish and reveals that the ₹25,000 crore is in the bank's secret chest locker.\nRating 10: With the help of a mole in the media, Krish falsely frames Dark Devil and his team as terrorists, and cuts the live telecast.\nRating 10: Dayalan learns from Rajesh that everyone in the bank are going to be killed, except Krish, before commandos arrive and take control of the situation, and Dayalan is suspended.\nRating 10: In the bank, Dark Devil opens the secret locker with the help of Radha and his men, only to find that the money is counterfeit money.\nRating 8: Dark Devil locks Krish, Sunil and Harsha in the secret locker, before Krish reveals that the money is stacked in 25 of the 1500 containers of his ship, which he discreetly records as a video.\nRating 10: The commandos open fire, with the bank severely damaged.\nRating 8: Krish, Sunil and Harsha are killed in the secret locker by an explosive.\nRating 10: Kanmani arrives in a fire truck stuffed with RDX, and threatens to detonate them, unless the hostages are released, forcing the commandos to cease fire.\nRating 3: She along with Dark Devil, wearing masks, escape with the help of the public and reach a boat, planning to escape by sea, while Radha and his gang also escape in the ensuing chaos.\nRating 3: A chase ensues where Dark Devil, Kanmani, and the rest of their team shoot the commandos and coast guards, using an M2 Browning.\nRating 8: However, they get shot and fall into the sea.\nRating 8: Later, the media broadcasts the video which Dark Devil discreetly recorded, and Dayalan's suspension is revoked.\nRating 6: Meanwhile, Dark Devil and Kanmani fake their deaths and escape using sea scooters and reached their boat, settling in international waters.\nRating 3: Dayalan and his team board a helicopter to the ship, where they find the ₹25,000 crore."
},{
    "genre": "Action",
    "related-genre": [
        "Dramas",
        "Period Pieces",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 80218506,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80218506",
    "index": 22,
    "name": "The Woman King",
    "maturity": "U/A 16+ ",
    "duration": "2h 14m",
    "synopsis": "In the 1820s, a battle-tested general trains a new generation of female warriors to protect their kingdom from a powerful foe. Inspired by true events.",
    "year": "2022",
    "spoilers": "\nRating 8: In the West African kingdom of Dahomey in 1823, General Nanisca, leader of the all-female group of warriors, the Agojie, liberates Dahomean women who were abducted by slavers from the Oyo Empire.\nRating 10: This provokes King Ghezo of Dahomey to prepare for an all-out war with the Oyo.\nRating 9: Nanisca begins to train a new generation of warriors to join the Agojie to protect the kingdom.\nRating 8: Among these warriors is Nawi, a strong-willed girl who was offered by her father to the king after refusing to marry men who would beat her.\nRating 8: Nawi befriends Izogie, a veteran Agojie.\nRating 7: She also reveals to Nanisca that she is adopted and shows a scar on her left shoulder, shocking Nanisca.\nRating 3: Portuguese slave traders led by Santo Ferreira and accompanied by the half-Dahomean Malik arrive as part of an alliance with the Oyo, led by General Oba Ade.\nRating 10: Nawi encounters Malik while the latter is bathing, and the two become friends.\nRating 8: Shortly after graduating from training to become a full-fledged Agojie, Nawi sneaks off to speak with Malik and learns that the Oyo are planning to attack.\nRating 3: She reports this to Nanisca, who tells her off for her recklessness.\nRating 3: Nanisca reveals that in her youth, she was captured by Oba, raped, and impregnated.\nRating 3: After giving birth to a daughter, Nanisca embedded a shark tooth in her left shoulder before giving her away.\nRating 10: Nanisca helps Nawi extract the tooth, confirming that she is her biological daughter.\nRating 7: Nanisca leads the Agojie in an attack on the Oyo.\nRating 8: The attack is successful, but Oba escapes and Nawi, Fumbe and Izogie are captured.\nRating 8: With Nawi's advice, Fumbe escapes and reports the others' fate to Nanisca.\nRating 8: Ghezo prepares to bestow the title of Woman King, his partner and equal in ruling Dahomey, upon Nanisca, but refuses to authorize a rescue mission for the captive Agojie.\nRating 6: Meanwhile, Izogie is killed in an escape attempt and Malik buys Nawi to protect her.\nRating 10: Nanisca defies orders and sets out with a group of like-minded warriors to rescue the captives.\nRating 9: The chaos allows Nawi to escape and rejoin Nanisca.\nRating 5: Malik frees several other slaves who drown Ferreira, and Nanisca kills Oba in single combat.\nRating 7: The triumphant Agojie return to Dahomey, where Ghezo privately and briefly admonishes Nanisca for disobeying him, before crowning her the Woman King.\nRating 10: After the festivities, Nanisca and Nawi privately acknowledge their familial relationship."
},{
    "genre": "Comedies",
    "related-genre": [
        "Comedies",
        "Mysteries",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81212842,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81212842",
    "index": 24,
    "name": "Murder Mystery 2",
    "maturity": "U/A 13+ ",
    "duration": "1h 30m",
    "synopsis": "After starting their own detective agency, Nick and Audrey Spitz land a career-making case when their billionaire pal is kidnapped from his wedding.",
    "year": "2023",
    "spoilers": "\nRating 7: Four years after their escapade in Monte Carlo,  Nick and Audrey Spitz work as full-time private detectives.\nRating 4: Accepting an invitation from their friend, Vikram \"The Maharajah\" Govindan, to attend his wedding on his private island, they hope their association with him will lend their failing detective agency some professional credibility.\nRating 5: There, they meet Vik’s French fiancée, Claudette Joubert, his flirtatious business partner, Francisco Perez, his former fiancée, Countess Sekou, Sekou's lady-in-waiting, Imani, Vik's reticent sister, Saira, his ruthless bodyguard, Lou, and the couple's old friend, Colonel Ulenga, who is now missing his left arm after saving Vik from an assassination attempt in Mumbai.\nRating 3: At the wedding, Audrey notices a cloaked figure following Vik's elephant.\nRating 8: A dead body falls from the elephant and turns out to be Vik's bodyguard, Lou.\nRating 3: Nick suspects that it is a diversion and watches Vik's abduction by a mysterious figure.\nRating 6: Realizing that they are once again ensnared in a conspiracy, the couple determines that at least two perpetrators must have been involved: one to create the diversion and the other to kidnap Vik.\nRating 6: The next morning, the group is joined by a team of professional detectives, led by former MI6 hostage negotiator Connor Miller.\nRating 3: The kidnapper calls and tasks Nick to deliver a ransom of $70 million to the Arc de Triomphe in Paris in exchange for Vik.\nRating 10: Traveling to Paris, Miller takes Nick and Audrey to the exchange point.\nRating 10: The kidnappers force the couple into a van at gunpoint.\nRating 8: Inside, the couple fights them, ending with the kidnappers dead and the van crashing into Café Procope.\nRating 7: They realize they are being framed for Vik's abduction with footage of Nick running out of the tent brandishing a knife; Miller then arrives and clarifies that the footage is a Deepfake.\nRating 10: After taking the briefcase of money and asking them to meet him at the La Madeleine, Miller is seemingly killed when his car explodes.\nRating 10: A mysterious figure steals the briefcase, only to be robbed of it when hit by a truck.\nRating 3: With the assistance of Inspector Laurent Delacroix, Nick and Audrey trace the truck to a countryside château where they are ambushed by Sekou and Imani, who insist they are not the kidnappers and only want the money.\nRating 8: Sekou shoots Imani and attempts to kill the couple by knocking over a candle to ignite the room, but is shot dead by a dying Imani.\nRating 3: Nick and Audrey escape and call Delacroix and the others, requesting Vik be brought to the Le Jules Verne restaurant at the Eiffel Tower.\nRating 3: Vik appears at the rendezvous, strapped into a bomb vest.\nRating 8: Nick reasons that the killer would never jeopardize the ransom; as suspected, the bomb's countdown is suspended, and Miller, the mastermind of the abduction, appears; he had faked his death by hiding in a bomb-proof titanium chamber within the car moments before the explosion.\nRating 8: He attempts to kill the group, along with Susan, a lonesome widow who was looking for her long-lost lover Gary, but Audrey clings to his harness and is pulled to the top floor.\nRating 6: Nick pursues them, subdues Miller's men, and destroys the detonator.\nRating 8: Miller throws Audrey, who is still connected to his harness, off the tower.\nRating 3: The two men engage in hand-to-hand combat, culminating with Nick opening the briefcase and dispersing the money into the wind.\nRating 3: Meanwhile, the group helps disengage Vik's bomb, and Susan tends to Delacroix, who was shot by Miller.\nRating 10: Susan and Delacroix instantly fall in love after Delacroix shows her how to make circles with smoke.\nRating 8: Up on the top floor, Audrey reappears and helps Nick tie Miller's harness to the tower's elevator mechanism, throwing him into the rotor blades of his getaway helicopter, which explodes and crashes into the Seine.\nRating 10: Returning to the restaurant, Audrey mistakes Saira's darkened hand for blood, but Saira insists that her henna smeared during the commotion.\nRating 10: Audrey realizes that Saira was not present when Vik's elephant was ushered into the reception ceremony, and recalls that the clothes of the cloaked figure who killed Lou had a wet henna stain.\nRating 7: Saira ends up being the second conspirator; she was upset that Vik's parents gave him sole control over the business, and she had previously tried to kill Vik in Mumbai.\nRating 10: Exposed, Saira attempts to shoot Vik, but he is shielded by Ulenga, who loses his right arm; Claudette then knocks her out with the briefcase.\nRating 10: With the commotion concluded, Vik and Claudette give Nick and Audrey $10 million.\nRating 6: On a honeymoon in Greece, they are accosted at gunpoint by their supposedly European helicopter pilot who turns out to be American; he steals the millions and jumps out of the helicopter, leaving them scrambling for the controls."
},{
    "genre": "Kids",
    "related-genre": [
        "Family Features",
        "Children & Family Movies",
        "Comedies",
        "Movies Based on Books",
        "US Movies"
    ],
    "id": 81608495,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81608495",
    "index": 25,
    "name": "Lyle, Lyle, Crocodile",
    "maturity": "U/A 7+ ",
    "duration": "1h 46m",
    "synopsis": "Josh and his parents are shocked to find a singing crocodile in their attic but quickly learn to love him. If only their grumpy neighbor felt the same!",
    "year": "2022",
    "spoilers": "\nRating 8: In New York City, a charismatic magician named Hector P. Valenti wants to try out on a national talent show but is constantly rejected.\nRating 7: One day after a failed audition, he wanders into an exotic pet store, where he finds a singing baby crocodile and names him Lyle.\nRating 10: Seeing Lyle as an opportunity to become rich in the talent business, he places his three-story Victorian brownstone house as collateral for their performance, but Lyle experiences stage fright during the premiere and Hector loses the house.\nRating 10: Hector is forced to move out and reluctantly leaves Lyle to fend for himself while he tries to make more money.\nRating 10: Eighteen months later, Joseph and Katie Primm and their young son Josh move into the house.\nRating 10: Josh is initially terrified of moving into his new home and struggles to make friends at school.\nRating 10: One night, he discovers Lyle, now fully grown, living in the attic, and they become friends when Lyle saves Josh from a mugger and demonstrates his singing talent.\nRating 10: Katie and Joseph eventually find out about Lyle, and though initially terrified of him, bond with Lyle over their favorite hobbies.\nRating 8: One day, Hector returns to the house to visit Lyle, as an agreement states he can live in the house fifteen days a year.\nRating 10: He makes another attempt to get Lyle to perform on stage, but it fails as Lyle still has stage fright, apart from when performing for the Primms.\nRating 10: Meanwhile, Alistair Grumps, the Primms' unfriendly downstairs neighbor, becomes annoyed by the loud activity caused by Lyle, Hector, and the Primms.\nRating 3: Determined to put an end to it, he has cameras installed to discover what is happening but manages to achieve his goal by bribing Hector to sell out Lyle in exchange for money to pay his debts.\nRating 10: Lyle cannot convince the authorities of his benevolent nature because of his stage fright and is locked up at the zoo.\nRating 3: Feeling guilty for what he did to Lyle, Hector goes to break him out of the zoo with Josh's help, who was initially unwilling to help after learning Hector sold Lyle out.\nRating 3: On Josh's insistence, Hector and Lyle reconcile with each other before Lyle escapes with Josh to the talent show, while Hector distracts the authorities.\nRating 10: On stage, Lyle manages to overcome his stage fright with help from Josh, receiving acclaim from the audience and viewers for his singing talent.\nRating 8: One month later, a trial is held to determine whether or not Lyle may be free.\nRating 3: The judge ultimately decides to rule over Grumps in favor of Lyle when Hector reveals that the deed to his house was written out to his grandmother, that was hidden away under Grumps' bed, who built the house and founded the New York City Zoo where Lyle was previously kept, allowing her to keep exotic animals as pets.\nRating 10: After the trial, the Primms celebrate Lyle's freedom, and Grumps' implied eviction, by taking him on vacation, while Hector becomes acquainted with a new talented animal: a beatboxing rattlesnake named Malfoy, owned by Josh's friend, Trudy."
},{
    "genre": "Comedies",
    "related-genre": [
        "Dramas",
        "Comedies",
        "Movies Based on Books",
        "US Movies"
    ],
    "id": 81616256,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81616256",
    "index": 27,
    "name": "A Man Called Otto",
    "maturity": "U/A 16+ ",
    "duration": "2h 6m",
    "synopsis": "Enraged by the world and hardened by grief, a cranky retiree plots his own demise but is foiled when a lively young family bursts into his life.",
    "year": "2022",
    "spoilers": "\nRating 8: Otto Anderson, a 63-year-old widower, lives in suburban Pittsburgh, Pennsylvania.\nRating 8: Six months after losing his wife Sonya, a former schoolteacher, Otto has become cynical and curmudgeonly.\nRating 10: He makes preparations for suicide after retiring from his job at a steel company.\nRating 3: During a suicide attempt by hanging, Otto has flashbacks to his past; years previously he tried to enlist in the army but was rejected due to his hypertrophic cardiomyopathy.\nRating 6: He meets Sonya on a train after returning a book she dropped.\nRating 8: During the attempt he is interrupted by his new neighbors: Marisol, Tommy, and their two daughters, Abby and Luna.\nRating 8: They bring him some Mexican food and ask to borrow an Allen wrench.\nRating 10: He again attempts hanging himself but the noose fastening falls from the ceiling.\nRating 10: As he falls to the floor he spots a flower bouquet advertisement in the newspaper that he’d placed on the floor.\nRating 10: He later goes and gets the flowers and visits Sonya’s grave and tells her about the new neighbors.\nRating 10: Otto attempts suicide again, this time via carbon monoxide poisoning.\nRating 5: He experiences a flashback to a dinner with Sonya; he tells her he is passionate about cars and confesses to her that he is not enlisted in the army due to his heart condition and does not have a job, prompting Sonya to kiss him.\nRating 10: Marisol disrupts Otto's suicide attempt with a emergency, asking him to take her and her kids to the hospital after Tommy fell and broke his leg using a ladder Otto had lent to him.\nRating 10: Otto reluctantly agrees.\nRating 3: Otto has a flashback to his graduation with an engineering degree when he asked Sonya to marry him.\nRating 10: During a suicide attempt by train, an old man faints and falls forward onto the railroad tracks.\nRating 8: Otto saves the man and the incident goes viral and he is saved from an oncoming train by someone taking his hand.\nRating 4: Otto adopts a cat that had been lingering around the neighborhood.\nRating 3: Marisol asks Otto if he’d take her for a driving lesson and later they visit Sonya's favorite bakery, which the couple formerly frequented every weekend.\nRating 10: At the bakery,  he tells her about his friendship with a man named Reuben, the two having worked together to establish rules and order, with Otto as chairman of the neighborhood association board.\nRating 8: The two grew apart after Reuben's preference for Fords and Toyotas over Otto's Chevrolets and the \"coup\" of replacing Otto as chairman.\nRating 5: Reuben, who had a stroke, now uses a wheelchair and is cared for by his wife Anita and neighbors Jimmy.\nRating 3: A local transgender teen, Malcolm, recognizes Otto as Sonya's husband while delivering newspapers and circulars in the neighborhood.\nRating 4: Malcolm cuts through Otto's disgruntlement at receipt of the newspapers and recounts that Sonya was his teacher, and one of the few people who accepted him as he was.\nRating 10: A friendship forms between the pair and Otto fixes Malcolm's bicycle.\nRating 10: After dodging a social media journalist named Shari Kenzie who is attempting to interview him in relation to the earlier viral video, Otto gets angry at both Marisol and a Dye & Merika real estate agent, not wanting to come to terms with Sonya's death.\nRating 10: He attempts to commit suicide by shotgun, but is interrupted by Malcolm, who asks to spend the night after his father kicked him out.\nRating 5: Otto learns that Dye & Merika is planning to force Reuben into a nursing home and take their house, after illegally finding out that Anita was diagnosed with Parkinson's disease.\nRating 10: Otto agrees to help Anita and Reuben fight the company.\nRating 8: Marisol refuses to assist Otto until he tells her that he and Sonya went to Niagara Falls to celebrate Sonya's pregnancy.\nRating 10: On the bus back home, they were involved in a crash, and Sonya became paralyzed and had a miscarriage.\nRating 10: The neighborhood was not accessible to Sonya and Otto was voted out of the chairmanship after a heated confrontation with a Dye & Merika representative.\nRating 10: Otto wanted to put all of the real estate companies out of business but decided against it to care for Sonya.\nRating 10: With the help of the neighborhood and Shari Kenzie, Reuben and Anita are able to keep their home.\nRating 10: Otto collapses and is taken to the hospital, where he lists Marisol as his next of kin.\nRating 10: After being told by a cardiologist that Otto's heart is too big, she laughs, before going into labor and gives birth to a son.\nRating 3: Otto subsequently grows closer to his neighbors, particularly Marisol and her family, and gives his car to Malcolm before purchasing a new truck.\nRating 10: Several years later, Tommy notices that Otto did not shovel the snow on his walkway.\nRating 8: Marisol and Tommy enter Otto's house to find him dead, having succumbed to his enlarged heart.\nRating 3: A funeral is held, attended by his neighbors.\nRating 3: In a letter to Marisol, Otto says that his lawyer will give her his bank accounts, providing them with enough money to take care of her family, along with his new car and house."
},{
    "genre": "Drama",
    "related-genre": [
        "Dramas",
        "Thriller Movies",
        "Romantic Movies"
    ],
    "id": 81641429,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81641429",
    "index": 28,
    "name": "Butta Bomma",
    "maturity": "U/A 16+ ",
    "duration": "1h 52m",
    "synopsis": "After dialing the wrong number, a young woman befriends a rickshaw driver but their romance takes a sudden turn when a stranger enters the picture.",
    "year": "2023",
    "spoilers": "\nRating 10: Satya  wrong dials Murali ; over a period of time, their frequent conversations lead to the blossoming of love.\nRating 8: But when they decide to meet in Vizag, Ramakrishna \"RK\" , enters the scene.\nRating 8: What happens next takes the romantic story on a different tangent."
},{
    "genre": "Thrillers",
    "related-genre": [
        "Crime Movies",
        "Dramas",
        "Thriller Movies"
    ],
    "id": 81676929,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81676929",
    "index": 29,
    "name": "Iratta",
    "maturity": "U/A 16+ ",
    "duration": "1h 50m",
    "synopsis": "After a cop is found dead, a policeman's investigation sparks a chilling search for the truth connected to his estranged twin and their fraught past.",
    "year": "2023",
    "spoilers": "\nRating 3: The film begins with the murder of ASI Vinod, the twin brother of DySP Pramod.\nRating 3: There are three suspects in the murder: ASI John, CPO Bineesh, and SCPO Sandeep.\nRating 3: All three police officers worked with Vinod in the Vagamon police station and have developed animosity towards Vinod, due to different incidents.\nRating 8: It is revealed through the incidents, narrated by the trio, one-by-one, that Vinod was a drunkard and womaniser.\nRating 3: Bineesh narrates his incident where he caught Vinod raping a 17-year-old girl in a lodge, when they were out partying.\nRating 8: Pramod, who also used to be an alcoholic, is now sober but long separated from his wife, Sreeja, and daughter.\nRating 3: Unable to withstand his behaviour, Sreeja took their newborn daughter and moved to Mumbai 17 years ago, to be away from him.\nRating 10: Pramod recalls his and Vinod's childhood.\nRating 8: The two brothers grew up in the same household with an abusive and absent father, who also was incidentally a cop.\nRating 8: One day, their parents have a violent fight, owing to their father's infidelity.\nRating 8: This causes their parents' separation.\nRating 3: Pramod stays with their mother, while Vinod is forcibly taken away by their father.\nRating 7: This fuels Vinod's resentment towards Pramod and their mother, as he feels betrayed and left alone to face their father's abuse.\nRating 10: One day, a couple of their father's neighbours and villagers hack their father to death, after he tried to sleep with an underaged girl.\nRating 7: Years later, both the twins become policemen, but take different paths.\nRating 10: Pramod becomes a respected and honest Deputy Superintendent of Police , while Vinod becomes a violent and street-smart Assistant Sub-Inspector .\nRating 10: At present, DySP Satheesh, who has close ties with Vinod, leads the investigation.\nRating 3: He also doubts Pramod, as he is aware of the duo's past and hatred towards each other.\nRating 10: This is further fuelled by the statement of Vinod's lover, Malini, who recently came into his life and changed him for the better.\nRating 3: Hence, Pramod is kept away from the investigation initially, but he requests to take over the case.\nRating 3: He quickly proceeds with the investigation, and it turns out that all the three suspects have legitimate alibis.\nRating 8: He then finds camera footage from a media personnel recording, in which he sees two children playing cricket with their dog in the nearby field.\nRating 6: Upon contacting them, it is revealed that one of the kids saw the death of Vinod while picking up their cricket ball and that it was a suicide, not a murder as they initially thought.\nRating 8: Puzzled and shocked by the new discovery, Pramod starts to look into the motive for Vinod's suicide, especially since it seemed as though he was very happy after Malini had come into his life.\nRating 8: At this point, a few constables from Vinod's station receive the footage of the TV channel that Vinod was watching at the time of his suicide.\nRating 8: In the show are Sreeja and their now grown-up daughter, participating in a reality singing competition.\nRating 8: Pramod is shocked when Bineesh, who caught Vinod raping the minor girl, confirms that she was the one in the lodge with Vinod.\nRating 3: Pramod now gets the full picture; Vinod realised that he raped his own niece and, unable to bear the guilt, committed suicide.\nRating 7: The film ends with Sreeja trying to reconnect with Pramod, after hearing of Vinod's death.\nRating 3: However, he strictly instructs her not to tell their daughter about him or ever show her his face, as she has unknowingly \"seen\" her father's face on that unfortunate night at the lodge.\nRating 3: Pramod, unknowingly, has to now atone for the mistakes and sins of both Vinod and their father."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Action & Adventure"
    ],
    "id": 81672761,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81672761",
    "index": 30,
    "name": "Thunivu",
    "maturity": "U/A 16+ ",
    "duration": "2h 23m",
    "synopsis": "A major bank heist takes an unnerving turn when a mysterious interloper known only as Dark Devil begins to hijack the operation.",
    "year": "2023",
    "spoilers": "\nRating 8: Radha, a dreaded gangster, and his men plan a heist at \"Your Bank\", one of the biggest privately-owned bank in Chennai, with the support of ACP Ramachandran.\nRating 8: They plan to rob ₹500 crore on 21 May, coinciding with the Governor's party event at his residence.\nRating 10: On the day of the heist, Radha and his men hijack the bank, only to discover that the bank is already hijacked by a mysterious man nicknamed Michael Jackson and his accomplice, Kanmani.\nRating 10: The commandos arrive inside the bank, but get defeated.\nRating 6: Jackson later makes a deal with Radha to help him rob ₹5000 crores, in exchange for a share of the money, for which Radha and his men reluctantly agree.\nRating 10: When Radha finds that the bank locker contains only ₹1,510 crores, they decide to kill Jackson, only to be defeated.\nRating 8: Jackson insists that Antony alias Anto, a police constable to be the negotiator, much to Ramachandran's ire.\nRating 8: He uses a voice changer of Michael Jackson, tricking the people and the media into referring him as Michael Jackson.\nRating 10: Ramachandran tries to kill Jackson with a sniper, only for him to make an explosion in a car parked nearby the bank using a bomb.\nRating 3: With the events being leaked to the media, city commissioner Dayalan is called in to handle the situation.\nRating 8: While inspecting the bank, Jackson finds explosives, disguised as fire extinguishers, and deduces that a third team has also entered the bank, without him knowing.\nRating 7: The police tracks a van where Kanmani is guiding Jackson, but Kanmani destroys the van, and escapes.\nRating 3: Ramachandran sends his men to trace Kanmani, but she kills them and exposes Ramachandran's involvement in the heist to Dayalan, who interrogates him, and he confesses that he along with his childhood friend Shyam, the Tamil Nadu Branch Head of Your Bank, planned the heist.\nRating 8: Ramachandran tried hiring Jackson, who goes by the name \"Dark Devil\", for the job, but he refused.\nRating 8: Ramachandran later hired Radha's gang for the job, without revealing that they will be killed after the heist.\nRating 3: Radha and his gang join and assist Dark Devil after hearing Ramachandran's confession through bugs planted on Dayalan's base.\nRating 3: Shyam flees from police after they learnt about his involvement, but is captured by Kanmani.\nRating 3: Meanwhile, Dayalan finds that Valavan was the one who wired and planted explosives in the drainage, and begins to search for him.\nRating 3: He also learns that Dark Devil and his team actually died a few months ago.\nRating 10: Ramachandran tries to prove that Dark Devil is alive by detonating a dummy bomb only to get killed when the bomb turns out to be a real one and explodes after the wire in it gets detached.\nRating 3: Dark Devil learns from Kanmani that there are ₹25,000 crores available in the bank.\nRating 4: Dark Devil tells Dayalan to arrange a meeting between him and chairman of Your Bank, Krish.\nRating 6: As Dark Devil deduced, the third team, revealed to be some of the bank's staff, attack Radha and his team in the locker, before assaulting Dark Devil and hold him captive.\nRating 5: Krish arrives and reveals that the third team were hired by him and tells them to destroy the bank's chest with explosives with hostage inside.\nRating 10: Krish also forces Dark Devil to reveal himself, where Dark Devil reveals that he and his teammates lived happily together like a family.\nRating 3: After having committed a heist in Bangkok, Dark Devil's members, Jijo and Achara planned to get married.\nRating 9: They all travelled to Araku Valley, Andhra Pradesh to arrange their marriage and celebrate, but they were ambushed by assailants sent by Krish and Shyam, who feared that they would reveal their heist plan to others.\nRating 8: Jijo and Achara got killed, but Dark Devil and Kanmani managed to escape and the killers faked their deaths for the rest of their deal money.\nRating 7: The duo reached the house of an old couple, who tends their wounds and revealed about his son Kavin, an honest bank official, who wanted to return the money to the people who invested in mutual funds.\nRating 10: However, Kavin was killed by Krish, and made it look like a mob did this during a strike.\nRating 10: Having learnt about this, Dark Devil and Kanmani decided to bring Krish and the bank officials to justice.\nRating 7: After the revelation, Dark Devil defeats Krish and his team, where he forces him on live to reveal about his financial scam of the ₹25,000 crore, which was invested in the mutual funds, and the atrocities committed against people by the bank officials.\nRating 8: Shyam, who was made to wear a bomb vest is sent to Dayalan, where he reveals everything about the heist and Krish's involvement in it, before he is killed by Kanmani's phone call.\nRating 3: Dark Devil also brings mutual funds chairman Harsha, who was abducted by Kanmani at gunpoint and Sunil Dutta, who was abducted from Mauritius by Dark Devil's men and was also responsible for stealing data from the NSE backup server of the Indian Stock Exchange.\nRating 8: Sunil confesses that he invested in 10 companies belonging to Krish and reveals that the ₹25,000 crore is in the bank's secret chest locker.\nRating 10: With the help of a mole in the media, Krish falsely frames Dark Devil and his team as terrorists, and cuts the live telecast.\nRating 10: Dayalan learns from Rajesh that everyone in the bank are going to be killed, except Krish, before commandos arrive and take control of the situation, and Dayalan is suspended.\nRating 10: In the bank, Dark Devil opens the secret locker with the help of Radha and his men, only to find that the money is counterfeit money.\nRating 8: Dark Devil locks Krish, Sunil and Harsha in the secret locker, before Krish reveals that the money is stacked in 25 of the 1500 containers of his ship, which he discreetly records as a video.\nRating 10: The commandos open fire, with the bank severely damaged.\nRating 8: Krish, Sunil and Harsha are killed in the secret locker by an explosive.\nRating 10: Kanmani arrives in a fire truck stuffed with RDX, and threatens to detonate them, unless the hostages are released, forcing the commandos to cease fire.\nRating 3: She along with Dark Devil, wearing masks, escape with the help of the public and reach a boat, planning to escape by sea, while Radha and his gang also escape in the ensuing chaos.\nRating 3: A chase ensues where Dark Devil, Kanmani, and the rest of their team shoot the commandos and coast guards, using an M2 Browning.\nRating 8: However, they get shot and fall into the sea.\nRating 8: Later, the media broadcasts the video which Dark Devil discreetly recorded, and Dayalan's suspension is revoked.\nRating 6: Meanwhile, Dark Devil and Kanmani fake their deaths and escape using sea scooters and reached their boat, settling in international waters.\nRating 3: Dayalan and his team board a helicopter to the ship, where they find the ₹25,000 crore."
},{
    "genre": "Drama",
    "related-genre": [
        "Dramas",
        "Movies Based on Books",
        "Period Pieces",
        "Action & Adventure"
    ],
    "id": 81460361,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81460361",
    "index": 32,
    "name": "The Last Kingdom: Seven Kings Must Die",
    "maturity": "A ",
    "duration": "1h 51m",
    "synopsis": "In the wake of King Edward's death, Uhtred of Bebbanburg and his comrades adventure across a fractured kingdom in the hopes of uniting England at last.",
    "year": "2023",
    "spoilers": "\nRating 3: Anlaf, a Viking king from Irland, arrives with his army in Northumbria after learning that Edward, King of the Anglo-Saxons, has fallen gravely ill.\nRating 10: Edward soon dies, leaving behind three sons, none of whom were named as his aetheling.\nRating 3: Lady Eadgifu and the youngest son Edmund flee to Bebbanburg where Edward's former ally Uhtred resides.\nRating 8: Although retired from war, Uhtred is informed that Edward's eldest son Aethelstan will likely attack his younger brother Aelfweard and makes plans to stop him.\nRating 4: Before Uhtred leaves, Ingrith prophesizes that \"seven kings must die\" before England is to be united.\nRating 8: Uhtred reaches Aegelesburg, where Aelfweard prepares to defend against Aethelstan's impending attack.\nRating 8: Aethelstan and his advisor Ingilmundr soon arrive and thwart a trap set by Aelfweard.\nRating 10: Uhtred convinces Aelfweard to surrender peacefully, but Aethelstan swiftly kills him and massacres his men.\nRating 8: Aethelstan is crowned king of the Saxons and Ingilmundr, who is secretly Aethelstan's lover, urges him to fulfil his grandfather's dream of uniting England and all Christians.\nRating 4: In Eoferwic, Aethelstan has taken over following the death of the previous Northumbrian king Rǫgnvaldr and demands that all foreign kings pay him tribute or face conquest and forced baptism.\nRating 3: Uhtred arrives and witnesses the destruction of Pagan monuments before learning that King Hywel Dda has submitted to Aethelstan after his son is taken hostage.\nRating 3: Uhtred then discovers Aethelstan's relationship with Ingilmundr and believes he's being deceived.\nRating 8: Ingilmundr secretly plans to have Uhtred killed, but he's warned by Aldhelm and flees back to Bebbanburg.\nRating 8: Aldhelm is subsequently labelled a traitor by Aethelstan and hanged for his actions.\nRating 3: Ingilmundr arrives at Bebbanburg to take the castle, but unaware that Uhtred had escaped, he's quickly captured.\nRating 3: Ingilmundr later convinces a servant to lure Uhtred into a trap, where he is captured by Aethelstan's men, forcing Osbert to surrender Bebbanburg.\nRating 9: Osbert and Edmund are taken captive and sent to Thelwael while Aethelstan, unable to kill Uhtred, banishes him from England.\nRating 8: On the Isle of Man, Anlaf hosts a gathering of kings with Prince Domnal and the rulers of Strathclyde, Orkney, Shetland and Man, warning them of Aethelstan's impending conquest.\nRating 3: Although they initially decline the offer of allying with a Pagan, Aethelstan embarks upon an invasion of Scotland, forcing King Constantin and the other rulers to form an alliance.\nRating 3: A weakened Uhtred is found by the Danes and taken to Shetland, where he learns that Ingilmundr is a Danish spy and meets with Anlaf and the other kings who request that Uhtred assassinate Aethelstan to avoid war.\nRating 8: Uhtred travels to Wintanceaster and unsuccessfully convinces Aethelstan to stop his conquest.\nRating 8: Uhtred then returns to Bebbanburg, only to learn from Eadgifu that Anlaf had sacked the castle, and sealed Ingrith and the commonfolk in a cave to suffocate.\nRating 8: Ingilmundr massacres the Saxons at Thelwael, and Uhtred later arrives to discover that Osbert and Edmund had managed to stay hidden and survive.\nRating 7: A remorseful Aethelstan makes peace with Uhtred and plans to stop Anlaf's invasion, but refuses any help.\nRating 3: Knowing that Aethelstan will likely die, Uhtred and his allies head to face Anlaf, who has amassed his forces at Brunanburh.\nRating 7: At the Battle of Brunanburh, Uhtred and Aethelstan's forces are heavily outnumbered and make a tactical withdrawl allowing Saxon cavalry to flank from behind and in the chaos, Domnal and the heirs of the other kings are killed.\nRating 8: After witnessing Ingilmundr attack Aethelstan, Uhtred is gravely wounded whilst attempting to aid him.\nRating 7: In the aftermath of the battle, the other kings quickly abandon Anlaf and a captive Ingilmundr is executed.\nRating 6: Aethelstan helps return a mortally wounded Uhtred to Bebbanburg and Finan concludes that the deaths of Edward and the five heirs - five kings who will never be crowned - only partially fulfil the prophecy that \"seven kings must die\", while Uhtred speculates that he will be the seventh.\nRating 10: Uhtred agrees to swear Northumbria to Aethelstan in exchange for him agreeing to make Edmund his sole heir, making Aethelstan the first king of a united England, fulfilling the dream of his grandfather King Alfred.\nRating 3: Seemingly on the verge of death, Uhtred experiences a vision of Valhalla where he sees several of his deceased allies waiting for him."
},{
    "genre": "Sci-Fi",
    "related-genre": [
        "Sci-Fi Movies",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81023636,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81023636",
    "index": 33,
    "name": "Time Trap",
    "maturity": "U/A 13+ ",
    "duration": "1h 27m",
    "synopsis": "To find their missing professor, a group of students ventures into the cave where he disappeared and uncover a bizarre mystery that alters their reality.",
    "year": "2017",
    "spoilers": "\nRating 8: Hopper, an archaeology professor, is exploring a remote cave system on the trail of missing hippies from the 1970s.\nRating 10: After discovering what appears to be a cowboy paused in place in a tunnel, he returns to town and dismisses his graduate students, Taylor and Jackie, stating that their research is done.\nRating 8: Several days later, as Hopper has not returned, Taylor and Jackie go looking for him, with their friend Cara, who brings her sister, Veeves, and her friend Furby.\nRating 8: Following Hopper's trail to the campsite by a cave, they find an entrance with climbing ropes leading inside.\nRating 8: They decide to follow it, but Furby chooses to stay behind as backup for the base camp.\nRating 7: They lower themselves into the cave, hearing strange noises.\nRating 10: When Furby does not answer their radio calls, Jackie tries to climb back out, but the rope frays, and she falls, injuring herself and Taylor.\nRating 7: Calling for help, they receive a transmission from inside the cave and follow it.\nRating 10: At a different junction, they discover another opening to the cave and Furby, dead with a broken neck.\nRating 3: Watching his video recordings, they notice several days elapsed from his perspective, while only about an hour had lapsed in the cave.\nRating 3: He began researching the hippies' belongings, discovering they were Hopper's parents and that he is searching for his missing sister.\nRating 3: His parents were following legends of the Fountain of Youth and speculated that this cave system was the root of the story.\nRating 7: Furby found another cave opening.\nRating 10: After several days, he went into the cave to retrieve keys for a vehicle but fell when his rope severed.\nRating 10: Taylor deduces the cave is inside a time distortion where events move more slowly.\nRating 8: With few options, Cara free-climbs out of the cave to get a GPS signal.\nRating 10: Outside, the terrain has become barren, and there is no signal.\nRating 7: Returning to the cave, comparing video recordings, Cara has experienced 30 minutes on the surface while she had been gone only a few seconds from their viewpoint, confirming Taylor's theory.\nRating 8: Reviewing Furby's footage again, they learn he survived the fall but was murdered by a caveman.\nRating 8: Cara and Taylor deduce the time difference is much more drastic than they suspected and entire years are passing within seconds, meaning the few hours they have been in the cave is enough to span several hundred or thousand years outside.\nRating 7: Hearing more howling, Cara prepares to climb out again for help but is interrupted by a futuristic humanoid spaceman descending via a retractable ladder.\nRating 3: A caveman suddenly attacks, but is subdued non-lethally.\nRating 8: They flee just to find a whole tribe of cavemen inspecting the dead bodies of the cowboy and Hopper's parents.\nRating 8: Discovered, Taylor fights the cavemen and is killed.\nRating 10: The spaceman returns, protects the others from the cavemen, and then places Taylor into a healing pool of water.\nRating 8: More cavemen attack, and the spaceman is fatally wounded, but uses his dying breaths to show them several media clips about their disappearance and indicating that humans have become space-faring.\nRating 10: Taylor finds Hopper injured in front of another time dilation, containing his long-missing sister and a legion of conquistadors in battle with the cavemen over control of a waterfall, the source of the time distortion, at the center of the cave system.\nRating 10: Hopper explains the field is strongest here, making rescue of his sister impossible; he tells Taylor to go and save the others, as he is also dying.\nRating 10: Preparing to leave the cave with the spaceman's ladder, the students are attacked by cavemen before they can get through; Cara is pulled through the portal by future beings before she can help her friends.\nRating 8: From their perspective, she reappears through the portal, differently dressed and with rope-like mechanisms which pull her friends through.\nRating 10: A short time later, Furby awakens, along with Hopper and Hopper's family, all having been retrieved and resurrected with the healing waters.\nRating 10: The others arrive, happily explaining they are in a space station and have a lot to talk about."
},{
    "genre": "Horror",
    "related-genre": [
        "Horror Movies",
        "US Movies"
    ],
    "id": 81186806,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81186806",
    "index": 34,
    "name": "A Quiet Place Part II",
    "maturity": "U/A 16+ ",
    "duration": "1h 38m",
    "synopsis": "Forced to leave their home, the Abbotts must venture out into a world of deadly creatures drawn to sound — and other threats they never expected.",
    "year": "2021",
    "spoilers": "\nRating 3: During a Little League Baseball game, the Abbott family – wife Evelyn, husband Lee, deaf daughter Regan, and sons Marcus and Beau – and other spectators witness a strange meteor-like object hurtle towards the Earth.\nRating 8: Hostile extraterrestrial creatures emerge from the meteor, attack and begin slaughtering people.\nRating 10: The blind creatures possess armored skin, have extraordinary speed and strength, and track victims with hypersensitive hearing, attacking anything that makes noise.\nRating 7: Over a year later, the creatures have killed much of the Earth's population, including Lee and Beau.\nRating 10: Regan has discovered that high-frequency audio feedback makes them vulnerable, and she devises a makeshift method of transmitting the noise from her cochlear implant through a portable microphone.\nRating 10: With their home destroyed, the family searches for other survivors.\nRating 3: Entering a fenced-off area, Evelyn accidentally sets off a sound alarm, alerting the creatures.\nRating 6: As they flee, Marcus steps into a bear trap, attracting a creature with his screams.\nRating 10: Regan and Evelyn kill the creature, free Marcus, then run into an abandoned steel foundry.\nRating 8: An old friend, Emmett, appears and takes them to his soundproof underground hideout.\nRating 10: Emmett, who has recently lost his family and developed a cynical outlook on life, refuses to help further and says they cannot stay.\nRating 8: Marcus hears the song \"Beyond the Sea\" playing on the radio, and Emmett says the song has aired continuously for four months.\nRating 3: Regan determines it is a hint that survivors are on a nearby island a day's travel to the south east following railroad tracks.\nRating 10: She theorizes that if she can reach the island's radio tower the hearing aids high-frequency noise can be broadcast so other survivors can weaponize the signal.\nRating 3: She secretly ventures out alone to find the island; Evelyn begs Emmett to find her.\nRating 10: He does and saves her from a creature.\nRating 10: Regan persuades Emmett to help complete her mission.\nRating 8: Evelyn leaves Marcus and her newborn baby at the foundry to fetch medical supplies in town.\nRating 9: Marcus discovers the corpse of Emmett's wife.\nRating 8: Startled, he alerts a creature and accidentally locks himself and the baby inside an air-tight compartment.\nRating 3: Emmett and Regan arrive at a marina to board a boat to the island.\nRating 3: They are attacked by bandits, and Emmett deliberately creates noise and attracts creatures that slaughter the attackers.\nRating 10: When one creature drowns, he realizes that the creatures cannot swim.\nRating 3: The two row to the island where a small colony of survivors are living normally.\nRating 9: The colony leader reveals that when the U.S government discovered the creatures were unable to swim, the U.S. National Guard attempted to move as many people as possible to the islands.\nRating 3: However, the chaos from boarding created noise that attracted the creatures, leaving only two boats that made it to the island.\nRating 3: When Evelyn returns to the foundry, she frees the children before they suffocate.\nRating 3: The three hide inside the bunker as the creature prowls the foundry.\nRating 7: At the island the next day, a creature trapped on a boat from the marina misadventure has drifted to the island and attacks the colonists.\nRating 10: After the colony leader drives Emmett and Regan to the radio station, both to quickly transport them and to lure the creature away from the colonists, it kills him.\nRating 10: Regan transmits the high frequency via the station's signal and plays it over the station's speakers, incapacitating the creature, and impales its exposed head with a rod, killing it.\nRating 10: At the foundry, the creature discovers the family.\nRating 3: Marcus picks up Regan's transmission and plays the high-pitched frequency through his portable radio before shooting the creature.\nRating 10: Regan leaves the hearing aid connected to the radio station's microphone, allowing the broadcast signal to be weaponized by others."
},{
    "genre": "Action",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Crime Movies",
        "Dramas",
        "Comedies",
        "Action & Adventure"
    ],
    "id": 81508740,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81508740",
    "index": 35,
    "name": "Kuttey",
    "maturity": "U/A 16+ ",
    "duration": "1h 48m",
    "synopsis": "Crooked cops, an aging crime lord and cutthroat rebels collide when a plan to loot a high-security van transporting cash careens into chaos.",
    "year": "2023",
    "spoilers": "\nRating 8: One rainy night in the outskirts of Mumbai, three stray gangs unknowingly cross paths on the hunt for a van carrying crores of cash and it's every man for himself.\nRating 10: A complex maze of subplots with greed as the Common motive leads to a tense often hilarious chain of events."
},{
    "genre": "Thrillers",
    "related-genre": [
        "Crime Movies",
        "Dramas",
        "Mysteries",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81280035,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81280035",
    "index": 36,
    "name": "Luther: The Fallen Sun",
    "maturity": "A ",
    "duration": "2h 10m",
    "synopsis": "Haunted by an unsolved murder, brilliant but disgraced London police detective John Luther breaks out of prison to hunt down a sadistic serial killer.",
    "year": "2023",
    "spoilers": "\nRating 6: Wealthy trader and serial killer David Robey blackmails and kidnaps cleaner Callum Aldrich.\nRating 10: DCI John Luther is assigned to the case and promises Callum's mother, Corinne, he will find her son.\nRating 8: Concerned about his involvement, Robey digs up dirt on the various illegal acts Luther has committed as a police officer, resulting in him being fired, prosecuted and imprisoned.\nRating 8: Years later, Robey coaxes Corrine and the parents of other victims to a house where he burns their children's corpses.\nRating 6: She visits Luther in prison, admonishing him for not finding her son's killer.\nRating 8: Robey sends a recording of him murdering Callum to Luther in prison via a radio frequency.\nRating 8: Luther informs DCI Odette Raine, the new head of Serious and Serial Crime, of the broadcast.\nRating 3: He liaises with prison guards and former associate McCabe to break him out of prison.\nRating 10: Raine brings in retired DSU Martin Schenk as a consultant.\nRating 3: Luther traces Robey to Piccadilly Circus, where Raine deploys armed police SCO19.\nRating 8: The two confront him there, but some people he has blackmailed cause a distraction by killing themselves jumping from buildings and crashing cars.\nRating 6: Robey escapes into the London Underground after fighting Luther and murdering an armed policeman.\nRating 8: Robey kidnaps Raine's daughter, Anya.\nRating 8: Raine meets with Luther and reluctantly agrees to work with him.\nRating 10: They visit Robey's ex-wife Georgette, discovering he owns property abroad.\nRating 8: DS Archie Woodward, Raine's subordinate, is blackmailed by Robey into killing Georgette but is intercepted by Schenk .\nRating 10: Archie commits suicide.\nRating 3: Luther and Raine travel to Robey's mansion in rural Norway, where they discover he tortures kidnapped victims to death on a livestream called \"The Red Bunker\" for his followers.\nRating 8: The two are overpowered, and Robey tries to force them to hurt each other to save Anya.\nRating 10: Luther reveals Georgette told the police the location and they are en route.\nRating 8: After a brutal fight, the three are able to escape the bunker, and Luther chases Robey into a frozen lake, where Robey drowns.\nRating 3: Luther is rescued by police divers and Schenk.\nRating 4: Recovering from his injuries back in London he is approached by Cranfield, a senior official with MI5, who, it is implied, offers him a job in lieu of going back to prison."
},{
    "genre": "Drama",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Dramas",
        "Thriller Movies",
        "Movies Based on Books"
    ],
    "id": 81634639,
    "tag": "New Releases",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81634639",
    "index": 37,
    "name": "Faraaz",
    "maturity": "U/A 16+ ",
    "duration": "1h 51m",
    "synopsis": "A terrifying hostage crisis unfolds over one fateful night in 2016 when heavily armed militants attack a popular cafe in Dhaka. Based on true events.",
    "year": "2023",
    "spoilers": "\nRating 5: A Bangladeshi American student named Faraaz Ayaz Hussain finds himself amidst the 2016 Dhaka terrorist attack and tries to protect his friends."
}]