{
    "id": 81514144,
    "tag": "Psychological Thrillers",
    "image": "https://occ-0-1492-1722.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABZDUSZ-Lvx1PIcGmW21cIDKxsm2r3hzRu104vxVSehns_m238dHlFf0qEJobaY9RJM1v3ndPJOtUr3NHxn0is1r-dfyNqVEJ8Kg.jpg?r=4e9",
    "source": "https://www.netflix.com/in/title/81514144",
    "name": "Dhokha - Round D Corner",
    "genre": "Bollywood Movies",
    "maturity": "U/A 16+ ",
    "duration": "1h 48m",
    "synopsis": "A terrorist breaks into a married couple's home and takes the wife hostage, igniting a tense standoff that surfaces secrets and lies.",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Crime Movies",
        "Thriller Movies"
    ],
    "plot": "\n Plot Dhokha: Round D Corner  is a 2022 Indian Hindi-language psychological crime thriller film directed by Kookie Gulati and produced by Bhushan Kumar under T-Series. It stars R. Madhavan, Khushali Kumar, Aparshakti Khurana and Darshan Kumar. The film marks the acting debut of Khushalii Kumar.\n Cast Saanchi and Yathaarth are a married couple. However, their marriage is on the brink of collapse. Saanchi keeps pressuring Yathaarth to speak with his divorce lawyer, and plans to move to the United Kingdom. One day, Yathaarth sees the news, at work that Haq Riyaz Gul, a terrorist, has entered his apartment when Saanchi was alone. Baffled, he rushes to the apartment complex, only to find that the Mumbai Police is already present. ACP Harishchandra Malik tries to negotiate with Gul, but in vain. Meanwhile, the media, who are present outside the apartment complex, receive news about the hostage situation and try to sensationalize it. Yathaarth informs Malik that Saanchi was recently diagnosed with delusional disorder, and that as time goes on, she can become more dangerous than Gul, if she does not take her prescribed pills.\n Music Meanwhile, in the apartment, Saanchi calmly tells Gul that Yaatharth is trying to give her the wrong medication to make her lose her sanity. She also tells him that once Yaatharth succeeds with his plan, he can keep her wealth as a caretaker, whilst also continue his relationship with her psychiatrist, Vidya, whom she caught multiple times, when they were being sketchy around her. Furious and annoyed about the situation, Gul tells Saanchi to stay silent. When Malik contacts Gul, Yaatharth pleads with Gul, to give Saanchi her medication. Otherwise, she will soon have a relapse. Overhearing the conversation between Yaatharth and Gul, Saanchi asks Gul to not administer it, while flirting with him.\n Reception After having sex, Gul tells Sanchi that he did not know about the bomb he delivered to the boy's hostel, which eventually killed 13 people. He states that he was betrayed by his uncle from Kashmir in delivering the bomb instead of an actual courier, that killed 13 students. Since all the evidence pointed towards him, he was convicted. Later, Gul threatens Malik, of killing Saanchi, if his demands are not met. When Yaatharth insists on going to his apartment, alone, with Malik and the police, they both get into a heated argument regarding the next course of action.\n References In the apartment as Saanchi seduces Gul, they plan to make Saanchi a fake hostage, to escape from the police' clutches. As they act on their plan, Saanchi alerts the police on his gun's magazine being empty, betraying Gul's trust, in front of the police. However, Gul manages to bring Saanchi back to the apartment. Saanchi soon starts behaving differently, asking about Gul's identity and how he managed to get into the apartment. Vexed, Gul ties Saanchi to a chair in the living room. It is revealed that Gul actually gave Saanchi her pills through the chai she made earlier.\n External links"
}{
    "id": 81436989,
    "tag": "Psychological Thrillers",
    "image": "https://occ-0-1492-1722.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABSE3AtlM3h8LOvUTtBH0K9rUyJxqbzbKxh49KYW6PJdLQ2_1i8v_bRWACUAUMiWGbTJIQbs9nrpdnUUuOk1_OL9yQT1P5IY-Fyw.jpg?r=885",
    "source": "https://www.netflix.com/in/title/81436989",
    "name": "HIT: The First Case",
    "genre": "Bollywood Movies",
    "maturity": "A ",
    "duration": "2h 12m",
    "synopsis": "Burdened by old demons, a troubled but brilliant detective sets out to solve two confounding abduction cases — one involving his own girlfriend.",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Crime Movies",
        "Thriller Movies"
    ],
    "plot": "\n Plot HIT: The First Case is a 2022 Indian Hindi-language action suspense-thriller film written and directed by Sailesh Kolanu, being a remake of his 2020 Telugu film of the same name. The film is produced by Dil Raju Production and T-Series. It stars Rajkummar Rao and Sanya Malhotra. It was released on 15 July 2022.\n Cast Vikram Jaisingh aka Vicky is a cop who works in the Homicide Intervention Team HIT, and is sharp person, who solves crucial cases with his ability to capture even the smallest of details, thus earning the trust of his senior Ajit. He is in love with Neha Mehta, his colleague and a forensic official.\n Production Rohit is Vikram's close friend and his colleague, who accompanies him in most of his cases. Vikram is constantly in an argument with Akshay, another officer, who crosses lines with Vikram. Vikram occasionally suffers from PTSD due to his past experience and refuses to take pills as he believes it slows down his abilities.\n Soundtrack Meanwhile, a girl named Preeti is driving on the highway, and her car stops to the side because it suffers a malfunction. Officer Ibrahim Sheikh, stops to help her, and she calls her father since she forgot her phone at her home. When her father comes to pick her up, he sees that she has gone missing and Ibrahim says that she got into a blue car and he thought it was his car.\n Reception When Preeti's parents approach Ibrahim demandingly, he remains firm and insults them. Being a good friend of Preeti’ parents, Ajit decides to suspend Ibrahim because of how he acted and since he does not believe him. Vikram decides to take a six-month break to relieve his PTSD attacks. After two months, Vikram gets a call that Neha goes missing. He decides to go back to Ajit and ask for the case file for Neha going missing, but he says Akshay is dealing with the case, and he cannot give it to him.\n Box office Vikram decides to ask Saxena, who is Neha's colleague, about the cases Neha has dealt with the past two months. Vikram and Rohit connect Preeti's and Neha's missing case and deduce that the same person is involved in both cases. Vikram decides to investigate, and he asks Srinivas for Preethi's case, and he takes over the case.\n Critical response Meanwhile, Akshay has suspicions that Vikram was the one who kidnapped Neha. Vikram decides to go to Preeti's college, and he asks Ajay and Sandya about what happened the previous night, and they say the same response how they were at a pub. Vikram and Rohit ask both Preeti's parents, and they say that her parents died in a plane crash and she was living with them and Preeti's neighbor Sheela about her.\n Home media Vikram and Rohit start deducing the case, and they come to a conclusion that Sheela kidnapped Preeti after they see Sheela's blue car and a note forged by Sheela indicating the whereabouts of Preeti's corpse. Ibrahim then sees the car and says that Sheela was not the one who kidnapped Preeti. Vikram and his team dig up the body behind the house and find that it is unnoticeable and it has a few DNA samples on it.\n References Vikram suspects Ajay because he said that Preeti was his girlfriend. While searching for the evidences Vikram gets a call from a stranger named Eesha who is stalked by a man in a car telling her to stop so that he can talk, but she drives fast and reaches the outskirts and contacted Vikram. Vikram begins his investigation in the toll booth in the highway. Vikram using the toll gate security cameras he deduces that the man who kidnapped was Fahad. After Vikram, Akshay, and Ibrahim find Fahad, Ibrahim is shot dead by Fahad while Vikram and Akshay capture him. Fahad takes them to the house where he received the money to kidnap Preeti. Vikram finds out that it was Rohit's house, and before Rohit shoots him, he shoots him dead.\n External links"
}{
    "id": 70123922,
    "tag": "Psychological Thrillers",
    "image": "https://occ-0-1492-1722.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABUbF7HoN66cQsbMHEfnNklGtAQluc90lrE1xgUs7QUbzKy5rvFOYjWlMWLgjFCxUGnhmAsDoexSz0y_TcADST8pTzMRg10TOBUA.jpg?r=f98",
    "source": "https://www.netflix.com/in/title/70123922",
    "name": "The Roommate",
    "genre": "US Movies",
    "maturity": "U/A 16+ ",
    "duration": "1h 31m",
    "synopsis": "While acclimating to campus life, college freshman Sara begins to realize that her new roommate, Rebecca, is becoming obsessed with her.",
    "related-genre": [
        "US Movies",
        "Thriller Movies"
    ],
    "plot": "The Roommate is a 2011 American psychological thriller film directed by Christian E. Christiansen and written by Sonny Mallhi. The film stars Leighton Meester, Minka Kelly, Cam Gigandet, Danneel Harris, Matt Lanter, and Aly Michalka.\n Plot The Roommate was released in the United States on February 4, 2011.\n Cast Sara Matthews is starting her freshman year of college in Los Angeles. She meets party girl Tracy, frat boy Stephen—her love interest—and Rebecca, her shy college roommate who bears an uncanny resemblance to her. The girls begin to bond and Rebecca learns that Sara had an older sister, Emily, who died when Sara was nine, and an ex-boyfriend, Jason, who keeps calling her in attempts to reconcile.\n Production Over time, Rebecca's obsession with Sara grows, which causes her to drive away anyone who could come between them. Claiming that she is a bad influence, Rebecca attacks Tracy in the shower, pins her down, rips out her belly-button ring, and threatens to kill her unless she stays away from Sara. Tracy moves to another dorm, fearful of Rebecca. An old friend of Sara's named Irene invites Sara to move in with her when Sara's cat Cuddles is discovered by an RA. Rebecca kills Cuddles, lying to Sara that the cat ran away, and inflicts injuries upon herself and says she was assaulted by a thug. Feeling sympathetic, Sara decides to spend Thanksgiving with Rebecca. When Sara's fashion design professor, Roberts, kisses her, Rebecca plans to get the professor out of the picture by seducing him while recording their dialogue on a tape recorder to make it sound like he was trying to rape her.\n Reception During her Thanksgiving stay, Sara overhears a conversation between Rebecca and her father, hinting Rebecca has had trouble making friends in the past. After Rebecca's mother mentions that Rebecca is supposed to be taking medication, Sara and Stephen find a bottle of unused Zyprexa pills, used to treat schizophrenia or bipolar disorder. Sara decides to move in with Irene; however, that evening at a club, Rebecca seduces Irene and they go back to Irene's place. The following morning, Sara goes to Irene's apartment, but she is not there. Meanwhile, Rebecca gets Sara's sister's name tattooed in the same place on her breast as Sara. Alarmed, Sara finally realizes Rebecca is obsessed with her and removes her belongings from the dorm. Jason arrives at Sara's dorm and slips a note under her door, saying that he wants to see her. Rebecca intercepts the note, and disguises herself as Sara. She then goes to Jason's hotel room and stabs him to death.\n Critical response Sara receives a text message from Irene saying she needs to meet with her right away, and she calls Stephen so he can meet her there. She arrives and finds a gagged Irene handcuffed to the bed. Rebecca reveals herself and points a gun at Sara, proclaiming her love and loyalty, before tearfully revealing she was responsible for what happened to Tracy, Cuddles, Professor Roberts, Irene, and Jason, and that she did it all to win Sara's friendship. Rebecca moves to smother Irene, and Sara attempts to stop her. Sara tries to call for help, but the phone is dead. Bound and helpless, Irene pleads for Sara to save herself. Sara tries to get out the window to get help. Rebecca breaks back into the room and aims the gun at the cuffed and helpless Irene, only to be stopped by Stephen who briefly disarms her but is knocked unconscious. Climbing back into the room, Sara is strangled by an enraged Rebecca. While choking, Sara stabs Rebecca with a box cutter, killing her after saying the words \"You were never my friend\".\n Box office Sara moves back into her dorm and moves the extra bed out of her room with the help of Stephen, proclaiming that she does not want anyone as a roommate for a while.\n Accolades Sonny Mallhi first thought of shooting the film in New York City but it was eventually shot on location at the University of Southern California in Los Angeles and at Loyola Marymount University. Leighton Meester was originally set to play Sara but was replaced by Minka Kelly and Leighton played Rebecca. Billy Zane and Frances Fisher had both starred together in Titanic fourteen years earlier, though in this film they shared no scenes.\n Controversy On Rotten Tomatoes, the film holds an approval rating of 3% based on 86 reviews, with an average rating of 2.86/10. The website's critics consensus reads: \"Devoid of chills, thrills, or even cheap titillation, The Roommate isn't even bad enough to be good.\"  On Metacritic, it has a weighted average score of 23 out of 100, based on 16 critics, indicating \"generally unfavorable reviews.\" Audiences polled by CinemaScore gave the film an average grade of \"B−\" on an A+ to F scale.\n Home media Keith Staskiewicz of Entertainment Weekly gave the film a D, saying it \"is really just a far-below-par thriller that desperately wishes it were a different movie – a longing it shares with the audience,\" but praises Meester for bringing \"the slightest trace of something fascinating to her role. When she smiles, it's perfectly located between a sweet display of affection and a snarling warning.\" Peter Travers of Rolling Stone gave it a half star, stating that \"The Roommate – the umpteenth uncredited remake of 1992's Single White Female – sucks bad, real bad\" and that \"Danish director Christian E. Christiansen has no flair for suspense\". Meester's performance garnered praise from other top critics, including the Los Angeles Times, which states: \"Here, her performance often has the feeling of a sports car in neutral. When she punches it for quick changes of tone from manic to wounded or around the bend, she shows how much more she is capable of.\"\n References Opening in 2,534 theaters, the film grossed $15.6 million its opening weekend to take first place at the box office. Its distributor estimated that females under the age of 21 accounted for two-thirds of its audience. By the end of its run, the film grossed $37.3 million in the United States and Canada and $15.2 million in other countries for a worldwide total of $52.5 million.\n External links"
}{
    "id": 81128579,
    "tag": "Psychological Thrillers",
    "image": "https://occ-0-1492-1722.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABcSSAXziK5ppeKZDMobzPjYu8ctwdBqY57siUA-TthiUcfNMXkKidZ47prG6egy8bGA2Nf9UWqPNbbrMT3l8wvSLMj37n_oZ4gCbOUY7xAyxOkP9MuJWXDeLRW0eYoBoZszR.jpg?r=60e",
    "source": "https://www.netflix.com/in/title/81128579",
    "name": "The Platform",
    "genre": "Thriller Movies",
    "maturity": "A ",
    "duration": "1h 34m",
    "synopsis": "A slab of food descends floor by floor in a prison. The inmates above eat heartily, leaving those below starving and desperate. A rebellion is imminent.",
    "related-genre": [
        "Thriller Movies"
    ],
    "plot": "\n Plot The Platform  is a 2019 Spanish social science fiction horror film directed by Galder Gaztelu-Urrutia. The film is set in a large, tower-style \"Vertical Self-Management Center.\" Its residents, who are switched every month between its many floors, are fed via a platform which, initially filled with food at the top floor, gradually descends through the tower's levels, stopping for a fixed amount of time on each. The system inevitably leads to conflict, as the residents at the top levels get to eat as much as they can, with each level getting only the leftovers from the previous ones.\n Cast The film's cast includes Iván Massagué, Antonia San Juan, Zorion Eguileor, Emilio Buale Coka and Alexandra Masangkay. It premiered at the 2019 Toronto International Film Festival , where it won the People's Choice Award for Midnight Madness. At TIFF, the film also secured a worldwide streaming deal with Netflix. It was released on the streaming service on 20 March 2020.\n Production Goreng wakes in a concrete cell marked with the number 48. His cellmate, Trimagasi, explains that they are in \"The Pit\", a tower-style facility in which food is delivered via a platform that travels from the top-down, halting for a fixed period on each floor. People on lower levels can eat only what those above leave and are subjected to fatal temperatures if they keep the food. Prisoners are randomly reassigned to a new level each month. Trimagasi reveals that when assigned to level 132, he and his former cellmate cannibalized a resident who had fallen down the shaft. One day, a bloodied woman named Miharu rides down on the platform, whom Trimagasi explains descends the pit every month searching for her child.\n Release Goreng volunteered to spend six months in the facility in exchange for a diploma, while Trimagasi is serving a year-long sentence for manslaughter. Over the first month, they become friends, but on the day of the room shuffle, they are reassigned to level 171. Expecting the platform to be empty of food when it arrives, Trimagasi ties Goreng to his bed and explains his plans to use Goreng's flesh to sustain them both. On the eighth day, Trimagasi begins cutting into him. Miharu arrives, attacks Trimagasi, and frees Goreng, who fatally stabs Trimagasi. Goreng eats Trimagasi's flesh, subsequently becoming haunted by hallucinations of Trimagasi, who says Goreng is now no better than he is.\n Critical response In the third month, Goreng awakes on level 33 with a woman named Imoguiri and her dog. Goreng recognizes her as the Administration official who had interviewed him before sending him down. She says that she was unaware of the inhumane conditions in the Pit and volunteered to enter after she was diagnosed with terminal cancer. Imoguiri rations her food, but is rebuffed when she attempts to convince the men on level 34 to do the same. One day, Miharu arrives injured, and Goreng and Imoguiri nurse her back to health. The next morning, Imoguiri is distraught to find that Miharu has killed and eaten her dog. As Miharu leaves, Goreng mentions Miharu's child to Imoguiri, who despondently informs him that there are no children in the tower and Miharu registered alone. He also learns from her that there are 200 levels in total. Goreng awakens the following month on level 202 to find that Imoguiri has hanged herself. Goreng eats her flesh to survive, plagued with hallucinations of his former cellmates.\n Accolades In the fifth month, Goreng is assigned to level 6. His new cellmate, Baharat, attempts unsuccessfully to escape. Estimating that there are 250 levels, Goreng convinces Baharat to ride the platform down with him and ration the food. Fellow prisoner Sr. Brambang convinces them to send a symbolic message to the Administration by leaving a single panna cotta untouched. As they descend further, they hand out portions to the prisoners, attacking those who refuse to cooperate. They eventually encounter Miharu being attacked and try to save her, but she is killed and they are left severely injured. Goreng and Baharat continue to descend, eventually reaching level 333, where Goreng notices a child - Miharu's daughter - hiding under the bed. He gets off the platform with Baharat, only to have it continue downward, leaving them behind. Despite Baharat's reluctance, they feed the girl the untouched panna cotta.\n See also Goreng passes out and dreams of Baharat telling him that \"the girl is the message.\" He awakens to find that Baharat has bled to death from his injuries. Goreng takes the child with him when the platform arrives. They descend to the bottom of the pit, where he once again hallucinates Trimagasi. Goreng attempts to back on the platform, explaining to Trimagasi that he must bear the message. Trimagasi replies that \"the message requires no bearer.\" Realizing Trimagasi is right, Goreng gets off the platform and the two walk away, watching as Miharu's daughter ascends.\n References The film was produced by Basque Films alongside Mr. Miyagi Films and Plataforma la película AIE, with the participation of RTVE and ETB and support from ICAA, the Basque administration and ICO. Shooting lasted for six weeks.\n External links"
}{
    "id": 81320770,
    "tag": "Psychological Thrillers",
    "image": "https://occ-0-1492-1722.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABR2Zi20osoOdGqIpvlUP3Thv3UsJQJTcamnD6lH2Gf7LXis3f8RRxoszi7-BtshqugL7AHnpePCMsOpuDeqMGOmBNTjs0NgbJv-Ig-CfigLGzg-Fs18uGE3UFZQb6MAV15eG.jpg?r=367",
    "source": "https://www.netflix.com/in/title/81320770",
    "name": "Haseen Dillruba",
    "genre": "Bollywood Movies",
    "maturity": "U/A 16+ ",
    "duration": "2h 16m",
    "synopsis": "Under investigation as a suspect in her husband’s murder, a wife reveals details of their thorny marriage that seem to only further blur the truth.",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Thriller Movies",
        "Romantic Movies"
    ],
    "plot": "\n Plot Haseen Dillruba  is a 2021 Indian Hindi-language romantic thriller film directed by Vinil Mathew and written by Kanika Dhillon. It stars Taapsee Pannu, Vikrant Massey and Harshvardhan Rane.\n Cast The film premiered on 2 July 2021 on Netflix. It received mixed reviews from critics. Haseen Dilruba emerged as the most-watched Hindi film on Netflix of that year, reaching top 10 in 22 countries.\n Production Rani, a housewife, is outside her home, feeding dogs, when her house suddenly explodes, presumably killing her husband, Rishab \"Rishu\" Saxena. The police find a body charred-beyond-recognition, with a severed hand which Rani identifies as Rishu's. The movie alternates between the past  and the present; the reality of the explosion is interwoven with the police investigation going on in the present-day.\n Soundtrack A flashback reveals the arranged marriage between the two, where he fell for her instantly, while she married him only because her boyfriend had abandoned her. There remain tensions and awkwardness between her, Rishu and his family after the marriage. To add to the tense atmosphere, a nervous Rishu fails to consummate. The next day, he overhears her telling her mother and aunt about his failure to have sex. Hurt, he stops acknowledging her completely and their relation dwindles. His well-built and charming cousin Neel Tripathi comes over to visit, and Rani gets attracted to him. They subsequently begin a relationship and have sex. Rani falls in love and even learns how to cook mutton, despite being a vegetarian. Some time later, she tells him that she would like to marry him instead. A commitment-phobic Neel panics and runs away. Hurt, Rani blurts out the truth to Rishu. He develops a disliking for her but still protects her from others who chastise her actions.\n Reception Meanwhile, in present-day, the police, aware of the history between Rani and Rishu, is convinced that she and Neel planned and killed Rishu. They use polygraphs and various other methodologies to find out her motive. They find footage where Neel can be seen escaping from the house, moments before the explosion. They also catch Rani cheating on one of the polygraphs by manipulating her blood pressure.\n Accolades Back in the past, after Rani tells Rishu the truth about him and Neil after hearing it Rishu transforms into a sadist and deliberately causes physical harm to her multiple times while also trying to kill Neel who knocks him out when he tries to kill him. Having fallen in love with him, she bears it all, as repentance. Over time, they reconcile and become intimate.\n Sequel Narrating the events of the day-of-explosion, she tells the police that Neel came over to visit and got into an argument with them. Rishu, subsequently, wanting to settle things with him, asked Rani to wait outside. The explosion occurred soon after. The police, know that she is lying, but fail to find any evidence or misdoing in her polygraph. Rani is subsequently acquitted and leaves the police station smirking.\n References It is revealed that when Neel came over, he tried to blackmail them using Rani's sex tapes. Angered by this, Rishu  physically attacked him and Rishu and Neel got into a physical fight, Rani hit Neel over the head with a mutton leg , killing him. Not wanting to be jailed, they dress the crime-scene with Rishu cutting off his own hand and placing it next to Neel's body. They rig the gas stove to blow up and Rishu leaves through the backdoor, dressed as Neel. Rani goes out and gets the mutton leg chopped, which she later feeds to the dogs. The explosion occurs and covers up their evidence of murder.\n External links"
}{
    "id": 81112446,
    "tag": "Psychological Thrillers",
    "image": "https://occ-0-1492-1722.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABRMJX-Vjz5lKiggGUrIIGt0Y0Fecs2e4BkqIpM2EhNzoY_92teb8kiSt0J2Os3B4JOwFTczIMZ6j3xgxHDGcbhuFxE8BCtV0Do0.jpg?r=858",
    "source": "https://www.netflix.com/in/title/81112446",
    "name": "Badla",
    "genre": "Bollywood Movies",
    "maturity": "U/A 13+ ",
    "duration": "1h 57m",
    "synopsis": "When a woman is accused of killing her lover, a renowned lawyer is hired -- but the more they try to  untangle the truth, the more convoluted it becomes.",
    "related-genre": [
        "Mysteries",
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Crime Movies",
        "Thriller Movies"
    ],
    "plot": "\n Plot Badla  is a 2019 Indian Hindi-language mystery thriller film directed by Sujoy Ghosh and starring Amitabh Bachchan, Taapsee Pannu, Tony Luke and Amrita Singh. The film is produced by Warner Bros. Pictures, Red Chillies Entertainment and Azure Entertainment and is a remake of the 2016 Spanish film The Invisible Guest. The story follows an interview between a lawyer and a businesswoman, in which the latter insists that she is being wrongfully framed for the murder of her lover.\n Cast Badla was released on 8 March 2019, It has grossed over ₹1.38 billion  worldwide against a production budget of ₹370 million  to emerge as a commercial success.\n Filming At the 65th Filmfare Awards, Badla received 4 nominations, including Best Supporting Actress .\n Marketing and release Naina Sethi is a young and shrewd successful businesswoman in London with a perfect family. Her world turns upside down when she gets arrested for the murder of her secret lover, Arjun. Naina's lawyer, Jimmy Punjabi, hires prestigious defence attorney Badal Gupta to defend her, and over the course of one late evening, they work together to find out what actually happened. Badal reveals that there is a witness whose testimony will incriminate her in the crime. Naina explains that she and Arjun were blackmailed by someone for their extramarital affair. They were called to a hotel where Naina was attacked; only to wake and find Arjun dead with the money meant for the blackmailer. She was arrested but is out on bail. The police find no trace of anyone else being present in the room or breaking in.\n Promotional videos Badal tells Naina that she is not being honest with him and questions her about the disappearance of a young man near the hotel. Naina reveals that she and Arjun went to a cabin in the woods few months ago. On the way back, she accidentally crashed into an oncoming car and killed its driver, a young boy named Sunny. Arjun convinced Naina not to inform the police, and they removed any trace of the crime. They put Sunny's body in the trunk of his car, which Naina dumped in a swamp. While Arjun was waiting for her, Rani and Nirmal, a local couple, met and invited him to their home, where Arjun discovered that they are Sunny's parents. When Rani called Sunny, his phone rang in Arjun's pocket as he had forgotten to dispose of it, making Rani suspicious. Arjun and Naina get away but become worried that they will be discovered soon.\n Dialogue promos Naina watched the news showing that Sunny had embezzled money from the bank where he was working before disappearing. She learned that Arjun had taken Sunny's wallet as they disposed of the body and used his girlfriend's employee credentials to hack into the bank to frame Sunny as a criminal. Rani identifies Naina's car at the scene of her son's disappearance, making her a suspect, but Naina has her lawyer falsify an alibi. The police buy it, but Rani is unconvinced. Rani later confronts Naina at a press event and reveals that she knows the truth. She pleads Naina to tell her Sunny's location but Naina keeps up her act of innocence. A few months later, Arjun and Naina are contacted by the blackmailer, leading to the present events.\n Soundtrack Badal decides that Rani must have killed Arjun and could have easily done so since Sunny's father, Nirmal, works at the hotel. Naina reveals that she saw Rani in the room but lied to check whether Badal was a good lawyer or not, to which Badal reveals there was no witness and he was lying to get the truth from Naina. However, Naina who now trusts Badal, reveals a secret: Sunny was still alive in the trunk before she disposed of the car. However, she let him drown, deciding not to save him to protect herself from potential incrimination. Surprised by her murderous and selfish actions, Badal proposes an alternate sequence of events in which Naina was the one who actually pressured Arjun into hiding the crime and framed Sunny. In this version, Arjun grew so guilty that he traveled to the hotel to confess the truth to Rani and Nirmal, prompting Naina to kill him. With the police knocking, she decided to injure herself and frame Rani for the crime. Naina denies this and claims that what Badal proposed earlier is the truth.\n Reception Badal refuses to fight Naina's case. When she implores him for help, he agrees only if she honestly tells him whether she killed Arjun. Naina confesses to Arjun's murder, revealing where Sunny's body is. Badal agrees to continue defending her and excuses himself for a moment, going out to get some fresh air while Naina receives a call from Jimmy. She realises that Badal's pen is interfering with the call. Naina then discovers that the person who came to her as Badal Gupta was an imposter when she finds the real Badal Gupta at the doorstep. Naina, shocked, takes apart Badal's pen to reveal a voice recorder inside that recorded every word of their meeting, including her confessions of both murders. As she glances outside her window, Naina makes eye contact with the imposter and Rani in the apartment building across from hers. \"Badal\" takes off his disguise, revealing himself to be Nirmal. Rani calls the police for Naina's arrest.\n Critical response The principal photography of the film began on 14 June 2018 in Glasgow, Scotland.\n Box office On 11 February 2019, Shah Rukh Khan, whose production house Red Chillies Entertainment is producing the film, tweeted two first look posters of the film, one with Bachchan's character and another with Pannu's. The film was released on International Women's Day, 8 March 2019 and is available online on Netflix. The film was certified by British Board of Film Classification with runtime of 118 minutes.\n Accolades Three unplugged innovative promotional videos which involved a conversation between Shah Rukh Khan and Amitabh Bachchan were launched on 3 March 2019, 6 March 2019 and 9 March 2019 respectively, which also featured Taapsee Pannu, to promote the film.\n See also \"Main Sach Hi Toh Bol Rahi Hoon\" was published on 25 February 2019, \"Homework\" on 28 February 2019, \"Sab Ka Sach Alag Alag Hota Hai\" on 1 March 2019 and \"Mere Paas Teen Sawaal Hain\" was published on 7 March 2019 on YouTube, featuring Amitabh Bachchan and Taapsee Pannu respectively.\n References The music of the film is composed by Amaal Mallik, Anupam Roy and Clinton Cerejo while the lyrics are penned by Kumaar, A. M. Turaz, Siddhant Kaushal, Manoj Yadav, Anupam Roy and Jizzy. Amitabh Bachchan, inspired by Ranveer Singh's Gully Boy, rapped the song \"Aukaat\".\n External links"
}{
    "id": 70113299,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70113299",
    "name": "The Stepfather",
    "genre": "US Movies",
    "maturity": "A ",
    "duration": "1h 41m",
    "synopsis": "A series of mysterious events makes a teenager suspect that his mother's new boyfriend may be a dangerous serial killer known for preying on families.",
    "related-genre": [
        "US Movies",
        "Crime Movies",
        "Thriller Movies"
    ],
    "plot": "The Stepfather is a 2009 American psychological thriller film and a remake of the 1987 film of the same name. The film was directed by Nelson McCormick and stars Dylan Walsh, Sela Ward, Penn Badgley, Amber Heard and Jon Tenney. It is loosely based on the crimes of mass murderer John List. It was released on October 16, 2009, receiving negative reviews from critics and grossing $31 million against its $20 million budget.\n Plot In a suburban Utah house, Grady Edwards transforms himself in a bathroom. He shaves off his beard, dyes his hair, and removes his brown contact lenses. As he leaves the house, the camera reveals the bodies of his wife and her three children. As the police investigate, it is said that another family was murdered in a similar manner in New Jersey not long ago, which causes them to believe there is a serial killer on the loose.\n Cast Susan Harding, a recently divorced Oregon housewife, is shopping in a grocery store with her youngest children where she meets Grady, who introduces himself as David Harris, and claims that his wife and daughter were killed in a car accident. Susan, desperate for love, is charmed by David, and she rushes into an engagement to be married in less than six months.\n Production Susan's eldest son, Michael returns home from military school and is immediately suspicious of his mother's fiancé. David invites him down to the basement, where he has installed locked cabinets, and tries to befriend him over tequila shots. Michael's suspicions start when David uses the wrong name when mentioning his deceased daughter. After Susan says that Mrs. Cutters warned her that America's Most Wanted ran a profile on a serial killer who looks like David, David sneaks into Mrs. Cutters' house and throws her down her basement stairs, then suffocates her.\n Release Susan's ex-husband Jay confronts David angrily about laying hands on his younger son, Sean. He warns Susan that she knows nothing about David. Doubts about David mount further when he quits his job working as a real estate agent for Susan's sister, Jackie, to avoid displaying a photo ID and other forms of identification. Later, Jay confronts David about an apparent lie regarding his college history. David clubs him with a vase and suffocates him with a plastic bag. He sends Michael a text with Jay's phone saying that David checked out okay.\n Theatrical When the neighbor's body is discovered two weeks later, David tells the family. Michael is alarmed because he overheard David being told by the mailman, who gave less detail than David. While Michael's girlfriend, Kelly, tries to get him to focus on college applications, he grows more obsessed with the contradictions in David's stories. The situation comes to a head when David intercepts an email from Jackie about hiring an investigator. He then goes to Jackie's house and drowns her in her pool. Determined to discover what was in the locked cabinets, Michael breaks into the basement as Kelly keeps a lookout. In the basement, Michael eventually discovers his dad's body in a freezer. David knocks out Kelly and traps Michael in the basement. The commotion awakens Susan, and he berates her parenting skills and says that he thought she could be \"Mrs. Grady Edwards\". On Susan's stunned reaction, David grimaces and asks, \"Who am I here?\" Susan tries to snap him out of it by saying his name, causing him to say, \"David! I'm David Harris!\"\n Home media Susan, realizing the situation after noticing the unconscious Kelly, flees to the bathroom, locking herself in. David kicks the door in, shattering the mirror behind it. Susan picks up a shard of the mirror, holding it behind her. David grabs her, they struggle, and she manages to stab him in the neck with the shard. He falls to the floor, apparently dead. Michael escapes from the basement and finds Kelly. They find Susan in the hallway across from the bathroom, thinking David is dead. Then David approaches from behind and blocks the stairs, chasing all of them into the attic, where he and Michael fight. Both fall onto the roof and then off the edge of the roof to the ground, where they lie unconscious.\n Reception When Michael wakes up, he finds out he had been in a coma for just over a month. He learns that David is still alive and fled the scene before the police arrived. The end scene shows David, who has again changed his appearance and his name to Chris Ames. He is working at a hardware store when he meets a woman who is shopping with her two sons.\n Box office Terry O'Quinn, who portrayed the stepfather in the 1987 original and its 1989 sequel, was approached by director Nelson McCormick to appear in the remake in a cameo role, but according to producer Mark Morgan, O'Quinn turned down the offer. Filming was completed on April 15, 2008.\n Critical response The film was distributed by Screen Gems. It was released in cinemas on October 16, 2009.\n References Sony Pictures Home Entertainment released the film to DVD and Blu-ray on a special Unrated Directors Cut containing a few more special features and depicting each death in the film in a more graphic tone.\n External links"
}{
    "id": 81346196,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81346196",
    "name": "Deadly Illusions",
    "genre": "US Movies",
    "maturity": "A ",
    "duration": "1h 54m",
    "synopsis": "After a bestselling novelist suffering from writer's block hires a new nanny for her children, the line between fiction and reality starts to blur.",
    "related-genre": [
        "US Movies",
        "Thriller Movies"
    ],
    "plot": "Deadly Illusions is a 2021 American erotic thriller film written and directed by Anna Elizabeth James and starring Kristin Davis, Dermot Mulroney, Greer Grammer, and Shanola Hampton.\n Plot Mary Morrison, a successful author of thriller novels, is happily married to Tom with two young children. Her publisher, asking her to write another book, offers a two million dollar advance; she initially declines but has to accept after Tom says he lost half of their estate on a risky investment. Mary's friend Elaine suggests hiring a nanny to help with the kids as she writes and, after a few interviews, she employs Grace.\n Cast Mary has writer's block and uses her blossoming friendship with Grace to inspire her. Mary then starts having what appears to be sexual fantasies about Grace. She also seems to dream about Grace and Tom engaging in sexual activity in the kitchen, but cannot tell if it is real or her vivid imagination. Confronting them both at the dinner table in a tearful rage, she upsets the children and causes a divide between her and Grace.\n Production The following morning, Mary apologizes to Grace, saying her outburst was the result of working too hard. She then calls the nanny agency to ask why they haven't cashed her check yet, and they tell her it's because she hasn't gotten back to them about her choice of a nanny. Mary asks if they have a nanny called Grace in their service and they say no.\n Release Mary goes to see Elaine and finds her dead with a pair of scissors in her neck. Contacting the police, to her surprise and horror, she learns she is the main suspect. The police reveal there is a great deal of incriminating evidence, including a video of what appears to be Mary arriving at Elaine's house, although her face is obscured with a headscarf and sunglasses, and her latest book has a murder with scissors.\n Critical response Mary then travels to Grace's hometown, visiting her aunt, who reveals Grace had been abused by her parents as a child, and herself also exhibiting odd behavior. Mary calls Tom to warn him about Grace but he does not answer. At home, he is in the shower when Grace walks in dressed in lingerie and brandishing a large knife. She continuously switches from her usual sweet, soft-toned self to a violent seducer with a deep voice. As she attacks Tom, Mary arrives home. Grace claims to not know what happened, repeatedly saying, \"I couldn't stop her.\" Grace suffers from dissociative identity disorder, and her other identity \"Margaret\" is who attacked Tom. Mary eventually knocks Grace unconscious.\n References One year later, Mary and her family are together. Mary takes the finished manuscript of her new book to Elaine's grave and leaves it there, as it was Elaine who encouraged her to start writing again. She then goes to visit Grace in a mental hospital. The film ends with \"Mary\" leaving the hospital, her face obscured by a headscarf and sunglasses, as in the police video of Elaine's killer.\n External links"
}{
    "id": 81136406,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81136406",
    "name": "The Paramedic",
    "genre": "Dramas",
    "maturity": "A ",
    "duration": "1h 34m",
    "synopsis": "Unable to face his new reality in a wheelchair, Ángel develops a deadly obsession with the woman who left him and unleashes a sinister revenge plot.",
    "related-genre": [
        "Crime Movies",
        "Dramas",
        "Thriller Movies"
    ],
    "plot": "The Paramedic  is a 2020 Spanish psychological thriller film directed by Carles Torras , written by David Desola and Hèctor Hernández Vicens and starring Mario Casas and Déborah François.\n Plot The Paramedic was released on September 16, 2020 by Netflix.\n Cast Ángel Hernández is a paramedic who lives with his girlfriend Vanesa  François. Ángel has an unempathetic attitude towards his patients and steals from them, selling the more valuable items to a local fence. At home, he is possessive and controlling towards Vane. The couple are trying for a baby without success. Ángel tells Vane it's her fault and even suggest her inability to get pregnant is psychosomatic. He then takes a fertility test and discovers that he has a low sperm count, but does not tell Vane.\n Production One day, while taking an injured patient to hospital, the ambulance  is in an accident and Ángel is left paralysed from the waist down and uses a wheelchair. He blames Ricardo and is unable to forgive him. His disability puts a strain on his relationship with Vane, and he becomes increasingly more paranoid that she is cheating on him. He seems to enjoy berating, mocking, and gaslighting her. Vane works at a call centre at night, and Ángel installs spyware on her phone to keep tabs on her.\n Release Via the phone spyware, he overhears a conversation between Vane and her friend, who tells her that Ángel is abusive and that Vane should leave him. When Vane returns home that day, Ángel has cooked her favourite meal and is contrite about the way he has treated her. They try to have sex but do not succeed because Ángel is unable to feel anything. While he is showering, Vane discovers from his laptop that he has been spying on her. Disgusted, she packs up and leaves for good.\n Reception Several months pass, but Ángel is still obsessed with Vane.  He stalks her and eventually sees her kissing Ricardo, with whom she has begun a relationship. Later, Ángel observes the couple shopping for baby things and realises that she is pregnant with Ricardo's baby. Ángel meets Vane in the street and tells her that he has boxed up her remaining possessions and asks if she would like to come and pick them up. However, on their arrival at the apartment, Ángel injects Vane, causing her to lose consciousness. When she awakes, she finds herself gagged and tied to a bed. Ángel uses Vane's phone to send Ricardo a message, telling him that she does not want to have their baby, and asking him not to contact her. Ricardo later approaches Ángel to say he does not believe Vane sent the message and is worried because he can't find her.\n See also Ángel injects Vane with an epidural so that she temporarily loses the use of her legs. He presents her with a engagement ring  and talks of their future together raising their  baby. Vane makes an escape attempt but he overcomes her. His elderly neighbour hears Vane scream and comes to investigate. When the old man threatens to call the police, Ángel stabs him to death, and pays his friend the fence to dispose of the body. Ángel also goes over to Ricardo's house and kills him.\n References A few days later, police arrive at Ángel's apartment and advise him that they are investigating Ricardo's death, and the disappearance of Vane . Ángel manages to satisfy the police that he knows nothing about either.\n External links"
}{
    "id": 80070182,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80070182",
    "name": "Circle",
    "genre": "Independent Movies",
    "maturity": "U/A 16+ ",
    "duration": "1h 26m",
    "synopsis": "When a group of strangers is seized and awaits execution, they face the impossible task of choosing the one person among them worthy of being spared.",
    "related-genre": [
        "Sci-Fi Movies",
        "US Movies",
        "Dramas",
        "Thriller Movies",
        "Independent Movies"
    ],
    "plot": "Circle is a 2015 American science fiction psychological horror-thriller film written and directed by Aaron Hann and Mario Miscione. The ensemble cast includes Carter Jenkins, Lawrence Kao, Allegra Masters, Michael Nardelli, Julie Benz, Mercy Malick, Lisa Pelikan, and Cesar Garcia. It was inspired by the 1957 drama 12 Angry Men and was shot in 2014. It premiered at the Seattle International Film Festival on May 28, 2015, before being released to video-on-demand on October 16. In the film, fifty people wake up in a darkened room, only to find that one of them is killed every two minutes or when they attempt to leave. When they realize that they can control which person is selected to die, blocs emerge based on personal values.\n Plot Fifty people awaken in a darkened room, arranged in two concentric circles around a black dome.  When they attempt to move from their designated platforms or touch the others, alarms sound off.  When someone ignores the warning and leaves formation, a beam from the dome kills them, and their body is quickly removed.  As the others panic, a man attempts to calm them, but the device kills him mid-sentence.  Thereafter, every two minutes, another person is killed.  After several people die, the group realizes that the room's technology allows them to use hand gestures to vote for who dies, while arrows on the floor show each person their own vote but not others'.  They attempt to boycott the vote, but someone is randomly selected to die after two minutes.\n Cast Following someone's suggestion, the group buys time to think by deciding in advance to eliminate the elderly for the next selections.  The captives discuss where they are, how they got there, who has abducted them, and why.  A young man, Eric, remembers attempting to flee Los Angeles, and others concur.  Eric says that he was pulled into the air, later waking in a red room with other humans.  The old man next in line agrees, saying he saw and heard aliens.  The disbelieving group eliminates him instead of listening.\n Production After another member of the group aggressively targets a 52-year-old cancer survivor over the objections of people who do not consider her elderly, he is eliminated.  Several people say they recognize the others: a man identifies the woman next to him as his wife, another man identifies the doctor he was having an affair with, and a tattooed man is eliminated after he admits to a cop's accusation of domestic violence.  After several minorities are quickly eliminated, an African-American man claims the process has become racist.  Several others dispute this, but when the cop goes on a racist rant, he is selected next.\n Release The captives experiment with voting, find they cannot vote for themselves, and attempt to give one vote to every person in the circle. One man gives a second vote for a pregnant woman, so Eric votes for him; this causes a tie and the man is killed in a run-off vote.  After several take their own lives by leaving formation to buy the others time, an atheist antagonizes the theists who praised the volunteers' faith.  The atheist is briefly saved, but when he mocks the girl beside him for having her boss pay for her breast enlargement, he is killed.  A homophobic lawyer targets a lesbian, and he is killed as a result.  The group realizes that one of the final two people left must not vote  to render a winner.\n Critical reception The group creates a schism. One bloc  believes that everyone should sacrifice themselves to save a pregnant woman and a little girl, while the other bloc  wants to eliminate them immediately as a threat to their survival, as they believe everyone is equal and no special privileges should be afforded. The husband and wife team initially vote with the bearded man's bloc but the husband is forced to vote with Eric's bloc when they threaten to eliminate his wife. Under interrogation, the couple admit that they concocted the relationship to curry favor, resulting in the \"husband's\" elimination.\n References Eric's faction incurs heavy losses but eliminates the other faction, leaving only Eric, the pregnant woman, the girl, and a silent man who has never voted.  Eric theorizes that aliens have used the process to learn about humanity's values.  After the silent man is eliminated, Eric manipulates the girl to simultaneously sacrifice themselves.  As the girl dies, Eric instead votes to kill the pregnant woman, leaving him and the woman's unborn child.  Eric votes to kill the child, becoming lone survivor. He awakes in Los Angeles where he joins a group of people, primarily children and pregnant women, watching a fleet of alien craft float over the city.\n External links"
}{
    "id": 70262614,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70262614",
    "name": "Talaash",
    "genre": "Bollywood Movies",
    "maturity": "A ",
    "duration": "2h 19m",
    "synopsis": "Set in the jumbled landscape of Mumbai, this mystery drama centers on a police inspector who's trying to cope with the collapse of his marriage.",
    "related-genre": [
        "Mysteries",
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Crime Movies",
        "Dramas",
        "Thriller Movies"
    ],
    "plot": "\n Plot Talaash: The Answer Lies Within  is a 2012 Indian Hindi-language crime thriller film written and directed by Reema Kagti, co-written by Zoya Akhtar, and produced by Ritesh Sidhwani and Farhan Akhtar under Excel Entertainment and Aamir Khan under Aamir Khan Productions, with Reliance Entertainment serving as distributor and presenter. The film stars Aamir Khan, Kareena Kapoor and Rani Mukerji in lead roles, with Nawazuddin Siddiqui, Rajkummar Rao and Shernaz Patel in supporting roles. The film score and soundtrack of the film were composed by Ram Sampath, with lyrics written by Javed Akhtar. Principal photography of the film took place during March–November 2011, primarily in Mumbai, Pondicherry and London.\n Cast Released on 30 November 2012, Talaash: The Answer Lies Within received positive reviews from critics, who praised its themes, direction, screenplay, music, cinematography and performances of the cast. It grossed over ₹174.21 crore  worldwide, becoming one of the highest-grossing Indian films in 2012.\n Production At the 58th Filmfare Awards, Talaash: The Answer Lies Within received 3 nominations, including Best Supporting Actress  and Best Supporting Actor . \n Development Late at night on a deserted road, well-known actor Armaan Kapoor loses control of his car, apparently trying to avoid something, and the car falls into the sea. Senior Police Inspector Surjan \"Suri\" Singh Shekhawat with his assistant Devrath Kulkarni begin an investigation. Surjan's relationship with his wife, Roshni has suffered ever since their 8-year-old son, Karan, recently drowned during a family outing. Surjan's guilt complex causes insomnia.\n Filming Surjan learns that on the night of Armaan's accident, Armaan was travelling with ₹2 million in cash, which is missing. Armaan had given the money to a blackmailer, a pimp named Shashi. Three years ago, Shashi had performed a cover-up for Armaan and his friend Sanjay. Once he learns of Armaan's death, Shashi takes off with the cash. Shashi's friend, Tehmur, begins blackmailing Sanjay with the help of an escort, Rosie. Sanjay gets Shashi murdered.\n Soundtrack Roshni seeks solace from a medium, Frenny Mistry, who is in touch with Karan's soul, though Surjan is angry and skeptical of her. One night, Surjan is propositioned by Rosie. He declines but asks if she can become an informer. The police find Shashi's body, along with the blackmail money and a DVD. The DVD contains CCTV footage of Armaan and his friends leaving a hotel with Rosie. Rosie confides in Surjan that three years ago, she was picked up by Armaan and his friends, Sanjay and Nikhil. Surjan discovers that Nikhil has been brain-dead after the incident three years ago.\n Reception Tehmur blackmails Sanjay into giving him money so he can give it to his girlfriend, a prostitute, for a better life. Sanjay gets Tehmur killed too. The police learn Sanjay is behind Shashi and Tehmur's murders and arrest him. Sanjay confesses that three years ago, he, Armaan, and Nikhil had picked up an escort named Simran to celebrate Armaan's bachelor party. The unlocked car door in the backseat opened by accident, throwing both Nikhil and Simran out of the moving car. Armaan and Sanjay rushed Nikhil to the hospital but fearing a scandal, left Simran to die on the road. Sanjay had called Shashi to take care of her. Since then, Shashi had continued to blackmail them. Surjan re-watches the footage and realizes with shock that Simran is Rosie.\n Marketing As he drives Sanjay to the police station, they approach the same road where Armaan had his car accident. Both men see Rosie/Simran standing ahead. In a re-enactment of Armaan's accident, they swerve the car to avoid a collision with her and it falls into the sea. Sanjay dies but Rosie saves Surjan. Surjan writes in the official report that Armaan's death was an accident. He returns to the riverside place where he used to meet Rosie and uncovers her remains where Shashi had hidden her body. Remembering that he had been told that \"the dead come to those who are troubled,\" he gives Rosie a proper funeral.\n Release Now more accepting of the supernatural, Surjan finds a letter from Karan, penned by Frenny, in which Karan tells Surjan not to blame himself for his death and that he wants his parents to be happy. Surjan reconciles with Roshni. In a post-credits scene, two workers put a \"Caution\" sign on the same accident spot.\n Controversy Following the release of her first film, Honeymoon Travels Pvt. Ltd. , Kagti was approached and offered to direct many films by several production houses. However, unable to find any films that interested her, she began working on a new script with her friend Zoya Akhtar in early 2010. Speaking about it, she said, \"Zoya and I thought of the story and co-wrote it. We do a lot of writing together. We are also best-friends so it is fun and there is a huge comfort factor.\" Initially, Shahrukh Khan, Saif Ali Khan and Salman Khan were reportedly approached to play the male lead but opted out due to differing reasons. Upon finalising the story, she approached Aamir Khan with the script in November 2010 and he agreed to produce and star in it. Since the start of pre-production, the project has faced several speculations regarding its title. In November 2011, Khan confirmed that the film was titled Talaash: The Answer Lies Within.\n Critical Reception In an interview with The Indian Express, Kagti revealed that a few months before casting Khan in the film, she had approached him with another project. Later, Kareena Kapoor and Rani Mukerji were signed on to star opposite Khan. Prior to the start of principal photography, the actors attended acting workshops and signed a non-disclosure agreement. To prepare for a key scene in the film, Khan and Mukerji took swimming lessons.\n India The principal photography for the film started in March 2011 with Khan and Mukerji in Mumbai. For a scene involving Khan and Kapoor, it was reported that both the actors would shoot in a red-light district. However, Kagti dismissed it and explained that it wouldn't be safe to do so. The scene was later shot at the Leopold Cafe on Colaba Causeway. The film's second phase continued with the entire cast in Pondicherry and was completed by the end of August. The final phase was expected to commence the following month in Khopoli with an underwater shot.\n Overseas Khan, who never knew how to swim went under rigorous training for this underwater sequence. He was trained for 3 months under a specialist trainer and went well prepared for the shoot. Due to visibility problems, it was cancelled and later filmed at an undisclosed water studio in London. The filming was completed by November 2011 after some of the remaining shots were executed at the Bandstand Promenade.\n Box office \nThe soundtrack is composed by Ram Sampath and Javed Akhtar penned the lyrics for all the songs. The music was launched on 19 October 2012 by T-Series. The album features vocals by Ram Sampath, Vishal Dadlani, Suman Sridhar, Sona Mohapatra, Ravindra Upadhyay and Rupesh. The song \"Jee Le Zara\" has a remix version. India The album met with highly positive reviews from music critics. Indiaglitz quoted, \"Once again, Ram Sampath has an unmatched compilation of tracks here. Along with random fantastic lyrics they have created a masterpiece here.\" Bollyspice reviewed the album stating, \"The soundtrack to Talaash: The Answer Lies Within is like a box of chocolates: it contains a little 'good' and a little 'not-so-good' in it. Yet it is still an album that is worth listening!\". Rediff reviewed, \"Except a steady undercurrent of anxiety, the soundtrack of Talaash: The Answer Lies Within doesn't have a fixed theme or ambiance. Every song belongs to a unique genre and fosters the enigma of Kagti's suspense drama. And that's what makes Sampath's efforts truly appreciable.\" Planet Bollywood said, \"A film made by Aamir Khan Productions doesn’t need an item song or song for the masses to make it successful. Instead, the music is made solely for the film in mind. If the listener can appreciate it before the release of the film then that is a bonus but that’s not essential.\" Sify quoted, \"Overall, the soundtrack is not out-of-the-box, but the overdose of electronic music doesn't bother either. Thus, it's an album which may not top the charts, but some songs could definitely make their way into many people's personal playlists.\" Gomolo stated, \"Ram Sampath is continuously giving very fresh and stunning music for Khan. The album is full of fresh, scrumptious and susceptible tracks.\" Musicperk summarized the album as \"Well, the answer lies within!\", the tagline of the film itself.\n Overseas Talaash: The Answer Lies Within tied up with Windows 8 for its marketing. Aamir Khan promoted the film on the crime detective series C.I.D. The episodes were aired on 23 and 24 November 2012. Aamir Khan visited Lucknow to promote Talaash: The Answer Lies Within. Aamir Khan also appeared in a TV special show 'Nayi Soch Ki Talaash, Aamir Ke Saath' to promote Talaash: The Answer Lies Within. Aamir Khan also visited Jalandhar for promotion purposes. The premiere of the film was held at PVR Cinema in Mumbai on 29 November 2012.\n Awards and nominations  The film received a U/A certificate from the Censor Board of India. Originally scheduled to release in October 2011, the film was postponed to its tentative release date of 1 June 2012. Media reports claimed that the reason behind the delay was due to the similarities with Sujoy Ghosh's Kahaani ; the director, however, went on to deny the reports. On 26 January 2012, along with a digital poster of the film, the first teaser trailer of Talaash: The Answer Lies Within was released in theatres. Due to Khan's prior commitment plans with his television show, co-producer Ritesh Sidhwani announced that the film would no longer be able to release on its tentative date as planned and would officially release on 30 November 2012. Pre-bookings for Talaash: The Answer Lies Within opened on 25 November 2012 in all multiplexes of India. Talaash: The Answer Lies Within was released in 520 screens in overseas markets, a new overseas record for an Aamir Khan starrer.; 3 Idiots  was released in 415 screens overseas. The estimate for the number of release screens in India is around 2500.\n See also In February 2012, Reliance Entertainment acquired the distribution rights of the film for ₹900 million  whilst its satellite rights were sold for ₹400 million .\n References After taking offense at Aamir Khan's TV show Satyamev Jayate  for \"projecting men in a bad light\", several men's rights activists took up cudgels against his film. Virag Dhulia, the head of gender studies at a men's rights community center, said \"We are not against Talaash: The Answer Lies Within, but Aamir. We want to send out the message that he can't portray a negative image of men.\" It is further reported that most of the filming got the inspiration from Rabbit Hole.\n External links"
}{
    "id": 80044537,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80044537",
    "name": "Regression",
    "genre": "Crime Movies",
    "maturity": "A ",
    "duration": "1h 46m",
    "synopsis": "A sexual assault perpetrated by a man with no memory of the crime leads a detective and a psychologist down a dark path of hidden, repressed evil.",
    "related-genre": [
        "Mysteries",
        "Crime Movies",
        "Thriller Movies"
    ],
    "plot": "\n Plot Regression is a 2015 psychological thriller horror mystery film directed and written by Alejandro Amenábar. The film stars Ethan Hawke and Emma Watson, with David Thewlis, Lothaire Bluteau, Dale Dickey, David Dencik, Peter MacNeill, Devon Bostick, and Aaron Ashmore in supporting roles.\n Cast The film had its world premiere at the San Sebastián International Film Festival on September 18, 2015. It was released in the United States on October 9, 2015, by The Weinstein Company under the banner RADiUS-TWC. The film received mostly negative reviews from critics.\n Production The film takes place in Minnesota, in 1990. Detective Bruce Kenner  investigates the case of John Gray , who admits to sexually abusing his 17-year-old daughter Angela  but has no recollection of the abuse. They seek the help of Professor Kenneth Raines  to use recovered-memory therapy on John Gray to retrieve his memories, and come to suspect that their colleague Detective George Nesbitt  is involved. They detain him but fail to find evidence against him. Detectives suspect a satanic cult is involved because of Angela's testimony, in which Angela says that she was abused by people in masks and someone took pictures of it.\n Filming Bruce and Kenneth meet Angela's estranged brother Roy Gray  to inquire about why he left the house. Using the regression technique on him, he recalls hooded figures entering his room while he was young. Bruce and Kenneth suspect Roy's grandmother, Rose Gray , has some involvement but find nothing after a search of her house.\n Marketing Meanwhile, Bruce begins having nightmares involving satanic rituals. Angela tells him that the cult is out to kill her as she has shown her demonic mark to him and that he is in danger as well. She tells him that her mother received miscellaneous calls and saw strange figures staring at her in the street before she herself had an accident. Bruce starts to experience the same things and his nightmares increase in intensity.\n Release Rose jumps from the window of her house after seeing ghostly figures, injuring herself. Bruce meets Angela in the church's cemetery to reassure her and after an emotional outburst, she kisses him. Shocked, Bruce leaves her there and returns to his home. He sees a soup advertisement on the street and recognizes the woman in it as the one he sees in his nightmares. He concludes that his imagination has run away with him. He tells Kenneth that all these past memories are induced by therapy and the whole situation is just the result of mass hysteria. Though the professor is initially resistant to the idea, he too comes to suspect that these memories were not real.\n Reception Bruce is attacked by two hooded figures who finally reveal themselves as George and their colleague, Farrell . George was seeking revenge after Bruce detained him as a child molester and ruined his career. Bruce offers to forget the whole situation if George tells him everything he knows. After George reveals things, Bruce confronts Angela about her abuse and she insists she told the truth. Finally Bruce concludes that she was fabricating everything from the beginning as she wanted to escape from her family, whom she thinks are responsible for her mother's death. She wanted to elope with George, as they had a sexual relationship for some time, but he refused to elope with a minor. Angela accused her father in order to escape the house. When Bruce confronts her, she tells him that no one is going to believe him, especially if she tells them that they kissed in the cemetery. Bruce tells John everything but John decides to take the blame and pleads guilty in order to rescue Angela and hopes that she will forgive him one day for being a bad father.\n See also The film ends with a statement that many cases like this were reported before the satanic abuse hysteria faded, and that there was never any proof that such ritualistic abuse by organized Satanic cults existed .\n References On October 31, 2013, it was announced that Ethan Hawke would star in the thriller film Regression. On February 5, 2014, Emma Watson joined the film to star with Hawke, and on March 25, David Dencik was added to the cast, playing a man who is arrested in a Minnesota town for allegedly sexually abusing his daughter. On May 23, Devon Bostick was added to the cast of the film.\n External links"
}{
    "id": 81264422,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81264422",
    "name": "Torbaaz",
    "genre": "Bollywood Movies",
    "maturity": "U/A 16+ ",
    "duration": "2h 13m",
    "synopsis": "At an Afghanistan refugee camp, an ex-army doctor seeks to bring children joy through cricket — and soon realizes that the stakes go beyond the sport.",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Dramas",
        "Sports Movies",
        "Thriller Movies"
    ],
    "plot": "  Plot Torbaaz  is a 2020 Indian Hindi-language action thriller film directed by Girish Malik. Sanjay Dutt plays the role of a medical professional that lost his wife and son while he was placed in the Indian Embassy in Kabul, while Nargis Fakhri and Rahul Dev play other prominent characters. Torbaaz was earlier scheduled for a theatrical release, which could not happen owing to the COVID-19 pandemic, after which the makers confirmed its distribution contract with Netflix. It was premiered on 11 December 2020 on Netflix. Cast Naseer is an ex-army doctor who is visiting a refugee camp in Afghanistan. Whilst he is there, he recalls how he lost his wife and young son to a suicide terrorist attack, during his placement at the Indian Embassy, in Kabul. He, alongside Ayesha, work together to run his late wife’s NGO. Naseer tries to bring joy to the children in the camp, through cricket. He tries to make a team of displaced boys that were victims of the Afghan war. Naseer tries to get the boys to work together and put aside their differences through cricket. He constantly faces the threat of Qazar and his men, who want to use the boys as soldiers and suicide bombers.  Production Torbaaz was announced in September 2016. Nargis Fakhri was roped in for lead role after Sanjay Dutt. Release Principal photography begun in December 2017. After shooting in Afghanistan, Torbaaz was majorly filmed in Bishkek, Kyrgyzstan becoming the first Indian film shot there. References Other filming locations included Mumbai, Manali  and Punjab, India. External links"
}{
    "id": 80206420,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80206420",
    "name": "Intrusion",
    "genre": "US Movies",
    "maturity": "U/A 13+ ",
    "duration": "1h 34m",
    "synopsis": "After a deadly home invasion at a couple’s new dream house, the traumatized wife searches for answers — and learns the real danger is just beginning.",
    "related-genre": [
        "US Movies",
        "Thriller Movies"
    ],
    "plot": "Intrusion is a 2021 American psychological thriller film directed by Adam Salky and written by Christopher Sparling, starring Freida Pinto and Logan Marshall-Green. It was released on September 22, 2021, by Netflix. It is about a couple who move from Boston to a small town in New Mexico to live a quieter life, only to find themselves the victims of a burglary and a deadly home invasion.\n Plot Tired of the rat race in Boston, therapist Meera and her husband, architect Henry Parsons, have recently moved into an isolated, ultra-modern house in Corrales, New Mexico, which Henry designed and built. One evening, they find their house broken into, although the only items stolen are a laptop and their cell phones. A few days later, Meera is woken up by a rattling noise and finds the power out. Henry goes outside to check the generator and finds it destroyed. Spotting flashlight beams inside, he realizes the intruders have returned. He discovers Meera tied up inside the house and releases her. They try to escape, but are pursued by several masked men. Henry retrieves a handgun hidden in the house and the couple flee upstairs. Henry lowers Meera down to the ground and she gets to her car, but then she hears gunshots from inside the house. A wounded man staggers outside, followed by Henry, who shoots him.\n Cast At the police station, Meera argues with Henry about the gun, which he had kept secret from her. They are shown mugshots of the three intruders, all of whom were members of the Cobb family; two are dead, but one, Dylan Cobb, is in ICU at the local hospital. The couple is told that another family member, college student Christine Cobb, has recently gone missing, and that the trio is suspected to have been involved in her disappearance, which might go unsolved unless Cobb recovers. Meera, who has previously had breast cancer, is re-traumatized by the attack, but Henry tries to encourage her to put it behind them.\n Reception One night, Henry goes to the store, but forgets his wallet. When he doesn't answer his phone, Meera decides to catch up to him in her car, but he turns off towards the hospital instead of the store. Meera gets in a car accident before she can follow him. Back at the house, Henry claims it was just a wrong turn.\n References Meera borrows Henry's car to get to work and learns that the surviving intruder died the same night she saw Henry go towards the hospital. Suspicious, Meera finds the Cobb family's address in the GPS on Henry's car. Inside their trailer, she finds an envelope from Henry's construction company. She opens the family's mailbox and takes a video camera from inside. At home, Meera finds the camcorder is broken and won't play the tape, so she orders a new one. In Henry's office, she finds a USB drive with photos from the construction of their house, which show that Dylan Cobb worked on the house and that Christine Cobb visited the site.\n External links"
}{
    "id": 60002273,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/60002273",
    "name": "Along Came a Spider",
    "genre": "Movies Based on Books",
    "maturity": "A ",
    "duration": "1h 43m",
    "synopsis": "Detective and psychologist Alex Cross teams with a disgraced Secret Service agent to find a senator's daughter abducted from an exclusive prep school.",
    "related-genre": [
        "Mysteries",
        "US Movies",
        "Movies Based on Books",
        "Crime Movies",
        "Thriller Movies"
    ],
    "plot": "Along Came a Spider is a 2001 American neo-noir psychological thriller film directed by Lee Tamahori. It is the second installment in the Alex Cross film series and a sequel to the 1997 film Kiss the Girls, with Morgan Freeman and Jay O. Sanders reprising their roles as detective Alex Cross and FBI-agent Kyle Craig. The screenplay by Marc Moss was adapted from the 1993 novel of the same title by James Patterson, but many of the key plot elements of the book were eliminated. The film was a box office success, although receiving mixed reviews from critics.\n Plot After Washington, D.C. detective, forensic psychologist and author Alex Cross loses control of a sting operation, resulting in the death of his partner, he retires from the force. He is drawn back to police work when Megan Rose, the daughter of a United States senator, is kidnapped from her exclusive private school by Gary Soneji, a computer science teacher. US Secret Service Special Agent Jezzie Flannigan, held responsible for the breach in security, joins forces with Cross to find the missing girl.\n Cast Soneji contacts Cross by phone and alerts him to the fact one of Megan's sneakers is in the detective's mailbox, proving that Soneji is the kidnapper. Cross deduces that the man is obsessed with the 1932 Charles A. Lindbergh Jr. kidnapping and hopes to become as infamous as Bruno Hauptmann by committing a new \"Crime of the Century\", which might be explored by Cross in one of his true crime books. \n Production Megan's kidnapping proves to be only part of Soneji's real plan: to kidnap Dimitri Starodubov, the son of the Russian president, and guarantee greater infamy for himself.\n Writing After Cross and Flannigan foil his second kidnapping plot, a supposed call from the kidnapper demands that Cross deliver a ransom of $10 million in diamonds. He must follow an intricate maze of calls made to public phone booths scattered throughout the city. Following the ransom directions, Cross ultimately tosses the gems out the window of a rapidly moving Metro train to a figure standing by the tracks. \n Reception Soneji later arrives at Flannigan's home and confronts Cross after disabling Flannigan with a taser. As Soneji has not reacted to Cross's verbal comment about receiving the ransom amount , the detective realizes that the kidnapper is unaware of the ransom demand and delivery. Soneji tries to leave with Flannigan, but Cross kills him.\n Box office Cross becomes suspicious and realizes that someone else discovered Soneji long before his plot came to fruition. After searching Flannigan's personal computer, he finds enough evidence to prove that Flannigan and her fellow Secret Service agent Ben Devine used Soneji as a pawn in their own plot to collect a ransom for Megan. \n Critical response Cross tracks them down to a secluded farmhouse, where Flannigan has murdered Devine and is now intent on killing Megan. He stops her by shooting her in the heart. Cross then takes Megan to her parents.\n Accolades One of the primary elements of the book screenwriter Marc Moss eliminated from his script was the fact that Soneji is actually a mild-mannered suburban husband and father suffering from dissociative identity disorder resulting from having been abused as a child. After a lengthy trial for kidnapping and several murders not included in the film, he is found guilty but remanded to a mental institution to serve his sentence. Also missing from the film is a romantic relationship shared by Cross and Jezzie, her trial and eventual execution by lethal injection, and the discovery of Megan , hidden away with a native Bolivian family near the Andes Mountains, two years after her kidnapping.\n Series reboot A few other minor differences from the original book include: Dimitri  being kidnapped at the same time as Megan ; Megan's  mother was the more famous of her parents, being a popular actress; when the children are kidnapped they are sprayed with chloroform spray.\n See also Box office receipts totaled US$105,178,561, of which $74,078,174 was from the United States having earned US$16,712,407 in its opening weekend at 2,530 theaters.\n References On Rotten Tomatoes the film has an approval rating of 32% based on reviews from 126 critics. The site's critics consensus was: \"Derivative and contains too many implausible situations\". On Metacritic the film has a score of 42% based on reviews from 31 critics, indicating \"mixed or average reviews\".\n External links"
}{
    "id": 81092222,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81092222",
    "name": "The Woman in the Window",
    "genre": "Dramas",
    "maturity": "A ",
    "duration": "1h 41m",
    "synopsis": "Confined to her home by agoraphobia, a psychologist becomes obsessed with her new neighbors — and solving a brutal crime she witnesses from her window.",
    "related-genre": [
        "Mysteries",
        "US Movies",
        "Movies Based on Books",
        "Crime Movies",
        "Dramas",
        "Thriller Movies"
    ],
    "plot": "\n Plot The Woman in the Window is a 2021 American psychological thriller film directed by Joe Wright from a screenplay by Tracy Letts, based on the 2018 novel of the same name by pseudonymous author A. J. Finn. The film follows an agoraphobic woman  who begins to spy on her new neighbors  and is witness to a crime in their apartment. Anthony Mackie, Wyatt Russell, Brian Tyree Henry, and Jennifer Jason Leigh also star.\n Cast Produced by Fox 2000 Pictures, the last film released under the label, the film was originally scheduled to be theatrically released by 20th Century Fox in October 2019, but was delayed to May 2020, due to re-editing after poor test screenings. The theatrical release was later canceled due to the COVID-19 pandemic and its rights were sold to Netflix, which released the film on May 14, 2021. Upon release the film received negative reviews from critics, with most criticism aimed at Wright's direction and the screenplay, though the cast earned some praise.\n Production Soon after its release Netflix also released The Woman in the House Across the Street from the Girl in the Window, an eight-episode series which parodied tropes from this film and others like it.\n Release Child psychologist Anna Fox lives alone in a Manhattan brownstone after separating from her husband Edward; he lives away with their daughter Olivia, but she talks to them on a daily basis. Anna suffers from agoraphobia and her housebound state leads her to observe all of her neighbors from a second-storey window, including the Russell family who recently moved in across the street. She also takes a large number of medications and drinks heavily.\n Reception One evening, Jane Russell visits Anna and they befriend one another. She also meets Ethan, Jane's teenage son, who suggests his father Alistair is abusive. One night, Anna witnesses Jane being stabbed to death in the living room. She contacts the police but they do not believe her, claiming everyone in the family is fine. Alistair arrives along with \"Jane\" who, to the shock of Anna, is a different woman from the one she met. She begins spying on the Russell family.\n Accolades Anna's tenant David, who lives in her basement, claims he did not hear or see anything, though she learns David was once in prison and broke his parole conditions. She receives an anonymous e-mail with a photo of her sleeping. She again contacts the detectives, who are joined by the Russells and David in Anna's house, and Anna breaks down when it is revealed by a detective that Edward and Olivia are dead as a result of a car crash that Anna accidentally caused. Anna is now agoraphobic as a result and her medication has caused her to have hallucinations and conversations with people who are not there.\n See also Anna apologizes to the Russell family and stops pursuing her suspicions. She records a video on her cell phone, planning to commit suicide by overdose. She then discovers a photograph she took of her cat and, in the reflection of a wine glass, sees the original Jane, proving she is real. Anna shows David the photo and he confesses the original Jane she met is a woman named Katie Melli, Ethan's biological mother. Katie had been stalking the Russell family, trying to get close to Ethan. David refuses to help Anna prove the truth; he is then suddenly attacked and killed by Ethan, who had been lurking inside the house.\n Notes Ethan reveals to Anna that he murdered Katie and is a serial killer, having also killed Alistair's secretary in Boston, and now intends to kill Anna. He had been letting himself into her house all week with a stolen key, and he was the one who took the photo of her sleeping. Anna flees to the roof, where they fight until she pushes Ethan through the skylight to his death.\n References As Anna recovers in the hospital, Detective Little visits and tells her they have arrested Alistair and Jane for helping Ethan cover up Katie's murder and that they have found Katie's body. Little admits he watched Anna's suicide video, but hands back her phone to allow her to delete it before she has to return it for evidence. He apologizes for not believing her.\n External links"
}{
    "id": 70134537,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70134537",
    "name": "Karthik Calling Karthik",
    "genre": "Bollywood Movies",
    "maturity": "U/A 16+ ",
    "duration": "2h 14m",
    "synopsis": "Unlucky in love and bullied at work, an office drone is resigned to his dead-end life until it’s transformed by mysterious calls from … himself.",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Dramas",
        "Thriller Movies"
    ],
    "plot": "\n Plot Karthik Calling Karthik is a 2010 Indian psychological thriller film, written and directed by Vijay Lalwani and produced by Farhan Akhtar and Ritesh Sidhwani under the banner of Excel Entertainment. The film stars Farhan Akhtar and Deepika Padukone in lead roles. Ram Kapoor, Vivan Bhatena, Vipin Sharma and Shefali Shah play supporting roles in the film. The film's music was composed by the trio of Shankar–Ehsaan–Loy, while the background score was composed by MIDIval Punditz and Karsh Kale.\n Cast Karthik Narayan  is an introvert who lacks confidence and feels trapped in his average job at a construction company. He is continuously troubled by an incident from his childhood: His elder brother, Kumar, used to torture him, but whenever he complained to his parents, they did not believe him. One day, Kumar took Karthik to a well and tried to throw him in it, but Karthik escaped. Kumar accidentally fell inside the well and died. Karthik has thought himself responsible for his brother's death ever since.\n Production Shonali Mukherjee  is a co-worker at Karthik's company, whom Karthik secretly loved though she remains unaware of his existence, much less his feelings. After being derided by his boss Mr Kamath  yet again; Karthik figures his life can't get any worse and decides to commit suicide. Just as he is about to, a stranger with the same, exact voice as his, calls and says that he is also Karthik, convincing him that he has the ability to change his life. These phone calls become Karthik's life guide. His chats take place every morning at 5:00 a.m. and the caller provides advice on Karthik's problems, guiding him to become a successful man, win Shonali's heart, and bring color to his otherwise dreary life.\n Release However, when Karthik tells Shonali and his psychiatrist about the phone calls, despite being warned not to, the mysterious caller gets angry and tells Karthik that if he could bring him up, he could also throw him down. As per his word, things start going downhill. Karthik's boss throws him out and Shonali leaves him. Karthik decides that if he goes somewhere he does not know, then the caller wouldn't know where he is either and stop calling him. Karthik travels to an unknown place, takes shelter in a small hotel, and asks the receptionist to remove the telephone and room number plate.\n Critical reception After a few months, Karthik is comfortably living in Cochin with a decent job. His life is back to normal except for the fact that he refuses to have a phone line. Upon his boss's request, he is forced to purchase a landline. He goes to great lengths to ensure that he himself is unaware of the phone number. However, one day at exactly 5 a.m, he receives a call from the mysterious caller, who threatens to kill him. Meanwhile, Shonali is contacted by Dr. Shweta Kapadia , who reveals the twist: Karthik actually suffers from schizophrenia, a mental disorder characterized by abnormal social behavior and failure to understand reality. He has an alter-ego that is more assertive and advises him on how to live life. It is revealed that the strange caller was Karthik himself. He has been dealing with this condition from a young age, when he created a fake brother named Kumar with his imagination . Karthik's phone has the capacity to record messages and act as a playback feature at a certain time. Karthik would wake up in the middle of the night, leave himself messages as his alter ego, and return to sleep, where he would awake once again at 5 AM to take his own calls.\n Box office Eventually, Karthik becomes so disturbed that he attempts to commit suicide again. Shonali, realizing the truth, arrives at the right time to save him. They reconcile and she stands by him, helping him with his condition. After a few months, Karthik is in the process of dealing with his disorder and lives a happy and rehabilitated life with Shonali by his side.\n Soundtrack In an effort to prepare for his role as loner introvert Karthik, Farhan Akhtar isolated himself at home and turned off his phone. He also learned to solve the Rubik's Cube, an activity which his character completes in only one try.\n Track listing The film received mixed reviews from critics. Nikhat Kazmi of Times of India rated the movie 3.5/5 stars, calling it \"immensely watchable, purely for the class act by Farhan Akhtar in the title role\" and recommending it to those who are in the mood for serious cinema. Shweta Parande of News18 gave a rating of 3.5 out of 5, applauding the cast and crew for their performances and their efforts on building up the story as a team. Mayank Shekhar of Hindustan Times gave the film 3 out of 5 stars and wrote, \"This one’s clearly not a formula film. It isn’t merely suspense for most parts either. It’s the kind of thriller that practically every Bollywood B, or big budget, genre flick aspires for.\" Anupama Chopra of NDTV gave it 2.5 out of 5 stars and stated that \"it isn't a bad film, but it isn't very good either\". Taran Adarsh of Bollywood Hungama gave the movie 2.5 out of 5 stars calling it \"a decent product with an unconvincing conclusion\". Sukanya Verma of Rediff.com gave the film a 2.5/5 rating, praising Farhan Akhtar for his versatility, while simultaneously criticizing Deepika Padukone for not being able to \"hold a single scene on her own\".\n Awards and nominations Karthik Calling Karthik was declared a below average hit at box office. Collecting ₹18.75 crore  on a budget of ₹20 crore , it grossed ₹5.1 crore  overseas, for a total of ₹28.22 crore  worldwide.\n References The soundtrack of the film is composed by Shankar–Ehsaan–Loy with lyrics penned by Javed Akhtar. The album was released on 20 February 2010.\n External links"
}{
    "id": 60031247,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/60031247",
    "name": "Gothika",
    "genre": "Horror Movies",
    "maturity": "U/A 16+ ",
    "duration": "1h 38m",
    "synopsis": "After a car crash, a criminal psychiatrist awakens to find that she's a patient in the same mental institution that currently employs her.",
    "related-genre": [
        "US Movies",
        "Thriller Movies",
        "Horror Movies"
    ],
    "plot": "Gothika is a 2003 American supernatural psychological horror thriller film directed by Mathieu Kassovitz, written by Sebastian Gutierrez, co-produced by Joel Silver and Robert Zemeckis, and starring Halle Berry with Robert Downey Jr., Penélope Cruz, Charles S. Dutton, John Carroll Lynch, and Bernard Hill. The film follows a psychiatrist who finds herself incarcerated in the penitentiary in which she works, accused of brutally murdering her own husband.\n Plot The fourth project developed by production company Dark Castle Entertainment, following 2002's Ghost Ship, Gothika was the second film by the company to be co-distributed by Warner Bros. and Columbia Pictures, the first being Thirteen Ghosts. It was also the first feature by Dark Castle to boast a number of high-profile stars in it's lead roles.\n Cast Gothika was shot in Montreal, Quebec in the spring of 2003. It was released theatrically in the United States on November 21, 2003, the Friday before Thanksgiving. The film grossed $141.6 million internationally, though it received generally negative reviews from critics.\n Production Dr. Miranda Grey, a psychiatrist at Woodward Penitentiary in rural western Connecticut, crashes her car one night on a country road to avoid hitting a young woman. When she awakens, she finds herself an inmate of the women's ward in which she works, receiving treatment from her colleague, Dr. Pete Graham. Miranda is horrified when Pete reveals to her that her husband, Douglas, has been the victim of a brutal axe murder, and that she is the sole suspect. As Miranda attempts to adjust to life as an inmate, she is haunted by visions of the young woman she saw the night of the car accident, and is attacked by her apparition in the showers; the woman carves the phrase \"Not Alone\" into Miranda's arm, though the hospital staff presume Miranda is self-harming. She later learns that the same phrase was scrawled in Douglas's blood inside their home after his murder. Miranda meets with her lawyer and start preparing for her defense and they bring in Douglas's best friend, Sheriff Bob Ryan, who confronts Miranda in the penitentiary, accusing her of the murder.\n Soundtrack Miranda begins to bond with fellow inmate Chloe Sava, whom she treated prior to her incarceration. During Miranda's previous sessions with Chloe, Chloe claimed to have been raped in the hospital. One night, Miranda's cell door inexplicably opens, and she quietly prowls through the ward. As she passes Chloe's cell, she witnesses Chloe being raped, and glimpses a tattoo of an Anima Sola on the perpetrator's chest. She is subsequently found by guards, who disbelieve her story. As time passes, Miranda regains memories of the night of the car accident, and subsequently identifies the mysterious woman as Rachel, the daughter of Miranda's superior, Dr. Phil Parsons; she had died in an apparent suicide several years prior. Late one night, Miranda is attacked by Rachel's ghost in her cell, and subsequently manages to escape from the hospital. She returns to her home and observes the blood-stained crime scene. This triggers vivid memories of Miranda committing Douglas's murder, though she believes that Rachel possessed her to carry out the act.\n Release Recalling that Douglas mentioned he was going to visit his rural farmhouse in Rhode Island prior to his murder, Miranda decides to visit the site, hoping it will contain clues. While investigating a cellar in the barn, she finds a blood-stained mattress, along with containers of sedatives, restraints, and video recording equipment. Miranda views one of the tapes: It is a snuff film shot by Douglas, which shows him raping, torturing, and murdering a young woman. Police subsequently arrive at the property, arresting Miranda and finding one of Douglas's victims, Tracey Seaver, still alive in the barn. Miranda realizes that Rachel possessed her to avenge her own murder by Douglas.\n Critical response Incarcerated in the county jail, Miranda converses with Sheriff Ryan about Douglas's crimes, and asserts that Rachel's suicide was staged; she also espouses her belief that a second perpetrator was involved. Using her expertise as a psychiatrist, Miranda constructs a psychological profile of the second perpetrator, and realizes it is in fact Sheriff Ryan. Ryan, realizing Miranda has identified him, attempts to inject her with a sedative. In the struggle, Miranda tears at his shirt, revealing the Anima Sola tattoo on his chest. Miranda manages to turn the syringe on Ryan before fleeing. In a drugged state, Ryan pursues Miranda through the jail, ranting proudly about his and Douglas's crimes; he tells her that Rachel was their first victim, and that they worked together to abduct, rape, and murder a string of local women. Suddenly, Rachel's apparition appears, distracting Ryan. He begins to shoot at it, causing a gas leak and subsequent explosion that sets him ablaze. Miranda obtains his gun, and shoots the burned Ryan to death. Moments later Pete arrives at the jail to try to save her, having realized the truth.\n Home media Approximately a year later, Miranda, now freed, walks with Chloe, also released from the penitentiary, on a city sidewalk. Miranda claims to be free of Rachel's influence and sends Chloe off in a taxi. Miranda then sees a young boy standing in the middle of the road who appears as though he is about to be struck by a fire truck. Miranda yells for the boy to move, but after the fire truck passes through the boy without harming him, she realizes he was only a ghost. As Miranda walks away, she fails to notice a missing person flyer for the young boy on a nearby telephone pole.\n Awards The fourth feature film produced by Dark Castle Entertainment, Gothika was the first to boast a high-profile leading cast, and was the company's largest-scale production at the time, with a budget of approximately $40 million.\n Won Berry was partly inspired to take the role because her mother, a nurse, worked in a psychiatric hospital for decades.\n Nominated Filming took place in Montreal, Quebec, Canada in the spring of 2003. Shooting of Berry's sequences was temporarily halted for several weeks in May 2003, after Robert Downey Jr., while filming a tense scene with Berry, grabbed and twisted her arm, accidentally breaking it.\n See also The score's original music was composed by John Ottman. \"Behind Blue Eyes\" by Limp Bizkit  was featured in the film but was not available on the soundtrack. The record was released on November 18, 2003, via Varèse Sarabande.\n References Gothika was released on November 21, 2003, in North America, grossing $19.3 million in the opening weekend and ranking at #2, behind The Cat in the Hat. It went on to gross $59.7 million in the US and $81.9 million from foreign markets for a worldwide total of $141.6 million.\n External links"
}{
    "id": 81225962,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81225962",
    "name": "Hypnotic",
    "genre": "US Movies",
    "maturity": "U/A 13+ ",
    "duration": "1h 29m",
    "synopsis": "Feeling stuck both personally and professionally, Jenn turns to a mysterious hypnotherapist for help, only to find herself caught in a deadly mind game.",
    "related-genre": [
        "US Movies",
        "Thriller Movies"
    ],
    "plot": "Hypnotic is a 2021 American thriller film directed by Matt Angel and Suzanne Coote, written by Richard D'Ovidio and starring Kate Siegel, Jason O'Mara, and Dulé Hill. It was released on October 27, 2021, by Netflix.\n Plot A young woman seeking self-improvement enlists the help of a renowned hypnotherapist. But after a handful of intense sessions, she discovers unexpected and deadly consequences.\nThe hypnotist engages her in a lethal game of mind manipulation.\n Cast On review aggregator Rotten Tomatoes, the film holds an approval rating of 27% based on 15 critical reviews, with an average rating of 4.6/10. On Metacritic, Hypnotic holds a score of 33 out of 100 based on 5 critics, indicating \"generally unfavorable reviews\".\n Reception \n References This article related to an American film of the 2020s is a stub. You can help Wikipedia by expanding it. External links"
}{
    "id": 81085817,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81085817",
    "name": "Under Her Control",
    "genre": "Dramas",
    "maturity": "A ",
    "duration": "1h 50m",
    "synopsis": "An ambitious young woman enters into an unusual arrangement with her charismatic boss. By the time doubts creep in, it may be too late to back out.",
    "related-genre": [
        "Dramas",
        "Thriller Movies"
    ],
    "plot": "\n Plot Under Her Control  is a 2022 Spanish drama film directed by Fran Torres which stars Aitana Sánchez-Gijón and Cumelen Sanz\n Cast Sofía, who works for a multinational company, gets pregnant. Desperate for offspring, Sofía's boss Beatriz offers her a bargain involving the child  in exchange for a job promotion. Instead of interrupting her pregnancy, Sofía accepts the offer.\n Production La jefa is Fran Torres' debut feature film. The screenplay was penned by Laura Sarmiento. Produced by Feelgood Media, Francisco Torres Quincoces, Hugo-Daniel Boyero Garmendia, Penúltima Toma AIE, Teoponte PC and Audiovisuales del Monte, filming took place in 2021, shooting in Madrid in July.\n Release Distributed by Filmax, it was theatrically released in Spain on 29 April 2022.\n Reception Pablo Vázquez of Fotogramas rated the film with 4 out of 5 stars praising \"its twisted and playful nature, worthy of the best exploitation cinema\", assessing the give-and-take between a Joan Crawford-esque Sánchez-Gijón and the \"young and enchanting\" Cumelén Sanz to be the engine of the film.\n See also Oti Rodríguez Marchante of ABC scored 2 out of 5 stars, writing that \"the way in which the plot is complexified is overly forced, but it is easy to see the place towards which the plot is tumbling\".\n References"
}{
    "id": 80988896,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80988896",
    "name": "A Simple Favour",
    "genre": "Dramas",
    "maturity": "A ",
    "duration": "1h 56m",
    "synopsis": "Thirsty for thrills, single mom Stephanie strikes up a friendship with the glamorous Emily, who asks for a small favor, then mysteriously vanishes.",
    "related-genre": [
        "Mysteries",
        "US Movies",
        "Movies Based on Books",
        "Crime Movies",
        "Comedies",
        "Dramas",
        "Thriller Movies"
    ],
    "plot": "A Simple Favor  is a 2018 American crime thriller film directed by Paul Feig from a screenplay by Jessica Sharzer, based on the 2017 novel of the same name by Darcey Bell. It stars Anna Kendrick, Blake Lively, Henry Golding, Andrew Rannells, Linda Cardellini, Rupert Friend, and Jean Smart and follows a small-town vlogger who tries to solve the disappearance of her elegant and mysterious friend.\n Plot It was released in the United States on September 14, 2018, by Lionsgate. Critics praised the plot twists, and the performances of Kendrick, Lively and Golding. It grossed $97 million worldwide on a $20 million budget. A sequel is in development, with Kendrick and Lively set to reprise their roles, and Feig returning to direct.\n Cast Widowed single mother Stephanie Smothers runs a vlog featuring crafts and recipes for parents.  She becomes friends with Emily Nelson, the mother of her son's schoolmate and a PR director for a fashion company, and they exchange confessions over martinis. Stephanie shares that as a teenager, she had sex with her half-brother Chris. Emily is frustrated by the lack of success of her husband, English professor Sean Townsend, and their  poor financial situation.\n Production Stephanie babysits Emily's son while Sean is in London. After two days of Emily not returning calls, she learns from Emily's boss, Dennis Nylon, that she is in Miami. Stephanie calls Sean, who contacts the police. Trying to get to the bottom of Emily's disappearance, she makes missing person flyers using a photo of Emily that she found hidden on her desk.\n Development Detective Summerville reports that Emily lied about flying to Miami, and that her drowned body had been discovered in the lake at a summer camp in Michigan. Stephanie and Sean share their grief and begin a sexual relationship. Summerville reveals to Stephanie that Emily had severe liver damage, a large amount of heroin in her system, and that Sean had recently taken out a $4 million life insurance on her.\n Pre-production Stephanie receives an insulting message apparently from Emily about her tryst with her half-brother Chris. She has a flashback of her late husband suspecting her infidelity, possibly leading him to cause the car crash that killed both him and Chris. \n Filming Investigating Emily's past, Stephanie meets Diana Hyland, who seems to have been a lover of Emily and who had painted a portrait of her. Diana says that the painting is actually of her muse Claudia, whom she describes as a con artist who disappeared. Her information leads Stephanie to a yearbook that shows Emily to be a girl named Hope McLanden, and who had an identical twin named Faith. Stephanie visits Margaret, the mother of the twins, who explains that at 16, the twins had set fire to the family house, killing their father, and disappeared.\n Release Meanwhile, while Stephanie is away on these investigative trips, Emily surprises Sean by reappearing, and tells him that she plans to collect the insurance money and leave the country. Stephanie later contrives to meet with Emily, who explains that she and her sister indeed started the fire to kill their abusive father. \n Marketing The sisters fled separately with a plan to reunite later, but Faith didn't turn up as agreed. Emily then built a career and family but then Faith reappeared 14 years later. Now an alcoholic and heroin addict, Faith threatened to turn them both in to the authorities by confessing the patricide unless paid a million dollars by Emily. After assenting to the demand, Emily drowned Faith in the lake , but Emily tells Stephanie that Faith committed suicide and that Sean planned the insurance scam.\n Reception Emily and Stephanie are both angered by Sean's relationship with the other and decide to frame Sean. He is arrested and released on bail. Stephanie has a change of heart and stages an argument with Sean in front of Emily in order to incriminate her while police-planted microphones are recording the meeting. Stephanie fakes shooting Sean. \n Box office Emily, having predicted their ruse and disabled the microphones, confesses her crimes while holding the pair at gunpoint, saying that she will stage their murder-suicide. Shooting Sean in the shoulder, she turns the gun on Stephanie, who reveals that a hidden camera is livestreaming the entire event on her vlog. Emily attempts to escape, only to be hit by a car driven by Stephanie's friend Darren. She is arrested immediately after.\n Critical response Closing text says that Emily was sentenced to 20 years in prison, Sean's second novel was a bestseller and he became a successful professor at Berkeley, and Stephanie is said to be dating another man and that her vlog has a million followers and is being developed as a TV show and also that she is a part-time private detective. In a mid-credits scene, Emily is seen winning a basketball game in prison.\n Sequel In January 2016, it was announced that 20th Century Fox had bought the film rights to author Darcey Bell's novel A Simple Favor prior to the book's publication. The story was pitched as being similar to Gone Girl and The Girl on the Train. Creative Artists Agency represented the movie rights in the deal with Fox.\n References In June 2017, it was announced that A Simple Favor would be extricated from 20th Century Fox and instead be distributed by Lionsgate. It was also announced that it would be directed by Paul Feig, with Anna Kendrick and Blake Lively \"in talks\" for the lead roles. On July 26, 2017, Kendrick and Lively were confirmed, while Henry Golding joined the cast as the husband of Lively's character. Linda Cardellini was announced as having been cast in an undisclosed role in September 2017, and Andrew Rannells, Jean Smart, and Rupert Friend were later added.\n External links"
}{
    "id": 81283586,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81283586",
    "name": "The Weekend Away",
    "genre": "Movies Based on Books",
    "maturity": "U/A 16+ ",
    "duration": "1h 31m",
    "synopsis": "When her best friend vanishes during a girls trip to Croatia, Beth races to figure out what happened. But each clue yields another unsettling deception.",
    "related-genre": [
        "US Movies",
        "Movies Based on Books",
        "Thriller Movies"
    ],
    "plot": "The Weekend Away is a 2022 American thriller film directed by Kim Farrant from a screenplay by Sarah Alderson, based on Alderson's 2020 novel of the same name. It follows a woman named Beth , who travels to Croatia for a weekend getaway with her best friend Kate. However, Kate suddenly goes missing and Beth is forced to figure out what happened to her. The film was released on Netflix on March 3, 2022.\n Plot Between February 27 and March 20, 2022, the film was watched for 79.95 million hours according to Netflix's top 10s.\n Cast London-based American new mother Beth flies to Croatia for a holiday with her best friend Kate. Beth confides that her marriage has hit a dull patch and that she is uncertain what to do. They go clubbing and two men flirt with them. Kate suggests Beth have a one-night stand.\n Production The next morning, Beth wakes up foggy about the night's events and realizes Kate is missing. Her husband Rob and the police are indifferent, but Zain, the taxi driver who drove them to the club, agrees to help. Beth recovers Kate's purse and phone, and learns that the men from the club were escorts hired by Kate. However, they are also con men who drug and rob the women they service.\n Reception Beth returns to the police, who start an official investigation. Rob arrives and immediately suspects Zain. Shortly after, Kate's body is found. Beth searches her phone for clues and finds text messages between Rob and Kate revealing an extramarital affair.\n References Beth is called into the police station as the primary suspect. It is revealed that both Kate and Beth had drugs in their systems, as Beth suspected due to her memory loss, and she insists she was drugged. The police interview the escorts, who have no criminal history and deny any wrongdoing, and confiscate Beth's passport. Beth calls Rob and confronts him about the affair.\n External links"
}{
    "id": 81028990,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81028990",
    "name": "Red Dot",
    "genre": "Thriller Movies",
    "maturity": "A ",
    "duration": "1h 26m",
    "synopsis": "Trying to rekindle their marriage and with a child on the way, a young couple on a ski trip suddenly finds themselves stalked by remorseless killers.",
    "related-genre": [
        "Thriller Movies"
    ],
    "plot": "\n Plot Red Dot is a 2021 Swedish drama thriller film written by Alain Darborg with Per Dickson and directed by Alain Darborg. The film stars Nanna Blondell, Anastasios Soulis, Thomas Hanzon, Johannes Bah Kuhnke, Kalled Mustonen and Tomas Bergström. It  premiered on Netflix on February 11, 2021.\n Cast After his university graduation ceremony, David  publicly and awkwardly proposes to his girlfriend, Nadja , which she happily accepts. A year and a half later, however, they are stressed due to work and school and fight frequently in their apartment in Stockholm. The stress is compounded when Nadja learns that she is pregnant, which she is unhappy about as she is studying to be a doctor and she is not sure if she and David should be parents. She decides to keep it a secret from David. Nadja opens up to an older neighbor, Tomas , and he assures her that she and David will be great parents; he insists that parenthood is life's greatest gift and implies he has lost a child of his own. The next morning, David surprises Nadja with a camping trip to see the northern lights, and the two reconcile and take the trip with their dog, Boris. While stopping for gas, David encounters two locals, brothers Jarmo and Rolle, and is made uncomfortable by their rough mannerisms and their truck bed full of dead game. As he has difficulties taking his car out of park, he accidentally bumps into the brothers' truck, leaving scratches. David chooses to drive off instead of saying something, which annoys Nadja. When they reach their destination at an inn, the woman at the front desk treats them strangely and silently refuses to serve them, leaving her brother Einar to imply that she's not used to seeing an interracial couple. He learns of their itinerary and offers to host them at his cabin in the wilderness. Nadja becomes nervous seeing Jarmo and Rolle in the establishment, and when they leave, they discover that someone has keyed their car and vandalized their bumper sticker with a racial epithet. Angered by this, Nadja spots their pickup truck later on the drive and scratches it with a screwdriver, narrowly avoiding retaliation when the brothers catch her in the act. \n Production The couple camps beneath the northern lights, and Nadja reveals she is pregnant, which makes David nervous and unsure. Their conversation is interrupted when they spot a red dot on the wall of their tent. They first assume that it is a laser pointer prank, but quickly realize that is a laser sight from a rifle and guess that the brothers are attacking them in revenge for the car damage. Boris escapes into the wilderness while they try to hide, and they hear gunshots and the sound of Boris whining. After they are shot at, they flee into the forest and hear their pursuers chase after them. After spending the night hiding in a small shelter, they return to the bloodied campsite and find all their belongings missing, and Boris's decapitated head in the tent. While searching for any remaining possessions, David is injured when his arm gets caught in a hunting trap. Finding nothing to help them, they set off to find help. However, they are soon shot at again, and David, increasingly losing blood, hallucinates a boy in a winter coat staring at them. David is shot in the shoulder while Nadja escapes unhurt, and the two search for each other as a snowstorm sets in. Nadja realizes that she has run atop a frozen lake, and as David searches for her, he falls in and is narrowly rescued by her. The couple finally makes it to an emergency cabin, where they phone rescuers and are told they will have to wait until the storm passes for help.\n Development The next morning, they hear a vehicle approach the cabin and realize it is an armed  Jarmo, who works as a mountain rescuer. Escaping through a back window, they flee into the woods and seek shelter in what is revealed to be the den of a hibernating bear. Jarmo discovers them, but before he can shoot, Nadja shoots him with a flare found at the cabin. David's condition deteriorates as they progress, and he hallucinates the boy again and begins mumbling about guilt. Spotting Einar's cabin in the distance, Nadja runs ahead to get help for David, but encounters Rolle on the way. Rolle seems confused by her appearance, but before he can act, David knocks him unconscious with a rock, and the two make it to Einar's cabin. Einar appears to call for help, but Nadja realizes that he is contacting someone else, and Einar suddenly becomes aggressive and locks them in a room discovered to be covered in stealth photographs taken of the couple.\n Reception Finally, Tomas arrives with a rifle, and the truth is revealed: the day of the couple's engagement, Nadja attempted to perform oral sex on David as they drove home, and a distracted David struck and killed a pedestrian -- the boy he had hallucinated earlier, who was also Tomas's son and Einar's nephew. David chose to drive off instead of calling the police as Nadja wanted, which left her wracked with guilt. On that day, Tomas had been playing with a drone with his son, which had caused him to run into the road; however, the drone also captured the couple's license plate, and a grieving Tomas tracked them down and moved into a nearby apartment to surveil them. Tomas is intent on inflicting revenge on the couple for callously driving away and had been behind the earlier murder attempts. He now decides to become more sadistic and tries to get David to use a power drill to torture and kill Nadja's child, and he shoots David in the knee when he does not comply. Tomas prepares to kill them both but is interrupted by the arrival of a furious Jarmo, who has tracked down the couple. In the confusion, Tomas shoots and fatally wounds Jarmo, who accidentally does the same to Einar, and Nadja and David escape while Jarmo and Tomas struggle for a rifle.\n References Nadja and David attempt to flee, but David cannot escape with his injuries. He tells Nadja to run, and when she stumbles upon the unconscious Rolle, she decides to take his rifle and save David. However, when she returns, she hesitates while trying to shoot him and is shot in the head and killed instantly by Mona, Tomas's wife and Einar's sister encountered earlier at the inn. A traumatized David begs to be killed as well, but Thomas refuses, telling him that he can now understand how he felt after his own son had died. Mona and Tomas depart as David is left sobbing in the snow.\n External links"
}{
    "id": 81151878,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81151878",
    "name": "Game Over",
    "genre": "Horror Movies",
    "maturity": "A ",
    "duration": "1h 37m",
    "synopsis": "As a series of murders hit close to home, a video game designer with PTSD must confront her demons, or risk becoming their victim.",
    "related-genre": [
        "Thriller Movies",
        "Horror Movies"
    ],
    "plot": "\n Plot Game Over is a 2019 Indian psychological thriller film directed by Ashwin Saravanan. Produced by YNOT Studios and Reliance Entertainment, the film stars Taapsee Pannu as a woman with PTSD who is defending her home from mysterious intruders. The film was shot simultaneously in Tamil and Telugu. The film was also dubbed in Hindi and was presented by Anurag Kashyap. The dialogues were written by Ashwin Saravanan and Kaavya Ramkumar in Tamil and Venkat Kacharla in Telugu. The music is composed by Ron Ethan Yohann.\n Cast Principal photography commenced on 10 October 2018. The film was released on 14 June 2019 to mostly positive reviews.\n Production Game Over starts with a serial killer  stalking a girl with cancer from outside her house and later at midnight killing her by wrapping her head in plastic and tying her hands behind her. After that he takes her to an abandoned field where he beheads her and sets her body on fire.\n Soundtrack Later, the film focuses on Swapna  who is a single young woman and also a talented game designer. She has a fear of the darkness, and also has post-traumatic stress more so known as 'anniversary reaction', a condition, which triggers unsettling feelings around the anniversary of a traumatic event. For Swapna, it is the horrific memory of her rape that took place on last New Year's Eve.\n Marketing and release It is her second time that she suffers from the uncontrollable feeling whenever she enters darkness; the first time was one year ago, the following days after she was raped. Her symptom starts when she feels pain at her wrist, where there is a tattoo she got one year ago. As she got the tattoo too long ago, it was explained technically impossible by a doctor that the pain was caused by it, but only she knows there is a connection between the tattoo and her miserable memory. Her family have a traditional mindset that think decent girls should not have tattoos or go out in the night; to which she did not listen, and was later raped. Instead of encouraging her afterward, her parents kept blaming the tragedy on her, for having a tattoo and going out at night.\n Home media Because of this, she leaves her parents, never contacted them since, and leads a secluded life with Kalamma , a housemaid who stays with her. Her only solace is her love for gaming.  Swapna later learns that her tattoo ink was mixed with a stranger's ash, because of a mistake by the tattoo artist. She begins to have some bizarre dreams and finds that the girl Amutha , a cancer survivor, was an unfortunate victim of a serial killer. Amutha's mother tells Swapna that her daughter will always be with her and want her to fight.\n Reception The same serial killer that killed many young women in the city, including Amutha, finally targets Swapna, who is now temporarily a wheelchair user due to an attempted suicide. The killer kills Mr Anwar, the security of her house, and Kalamma, and finally Swapna. But before Swapna is killed, she is surprised to find that she has three of the same tattoo pattern on her wrist, where she had only one.\n Critical response Swapna wakes up from the \"nightmare\", but finds now only two tattoo patterns are left on her wrist. She now realizes that she was not killed in a dream, but it is Amutha's spirit, who wants Swapna to fight, that gave her three lives, just like video games she is often playing. And now Swapna has lost one life, with two remaining.\n Box office To avoid the same mistake that got them all killed in her first life, Swapna, who is now using her second life, call the police and stay in the house with Kalamma to wait for the police. Police arrive in time and shoot the killer before the latter kills Swapna and after, however, kills Kalamma. She seems to be saved and is taken by the police to the station. But on their way, their vehicle is exploded by a bomb set by the killers. It is now revealed that there was not only one killer that was trying to kill her, but three.\n Awards and nominations Swapna now is using her third, also the last life to fight against the killers. Encouraged by Amutha's spirit, Swapna conquers her fear for darkness. She does not turn on the light to draw the killers' attention. Swapna and Kalamma manages to kill the first killer by setting him on fire. The second killer almost kills them both but is also taken down by them. The third killer beats Kalamma to unconsciousness and confronts Swapna, who manages to stab him to death with a piece of broken mirror.\n See also The film marks the return of actress Taapsee Pannu to Tamil cinema after a hiatus of four years. The first look poster of the film was unveiled on 10 October 2018, which displayed Taapsee sitting in a wheelchair with legs in plaster casts. The shooting of the film commenced on the very next day on 11 October 2018. Pannu went under intense training playing a person who uses a wheelchair. The shooting of the film was wrapped up on 14 December 2018.\n References The official film score is composed by Ron Ethan Yohann who had worked with Ashwin Saravanan in Maya and Iravaakaalam. The music rights were secured by the production company's subsidiary music label YNOT Music, with Divo as their digital partner. The official soundtrack album was released by Santhosh Narayanan on 24 August 2019. The album features 28 songs which lasts for 67 minutes.\n External links"
}{
    "id": 81144153,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81144153",
    "name": "The Girl on the Train",
    "genre": "Bollywood Movies",
    "maturity": "U/A 16+ ",
    "duration": "2h",
    "synopsis": "A troubled divorcée fixates on a seemingly ideal couple from afar until a shocking observation sends her spiraling straight into a knotty murder case.",
    "related-genre": [
        "Mysteries",
        "Hindi-Language Movies",
        "Movies Based on Books",
        "Bollywood Movies",
        "Crime Movies",
        "Thriller Movies"
    ],
    "plot": "\n Premise The Girl on the Train is a 2021 Indian Hindi-language mystery thriller film directed by Ribhu Dasgupta and produced by Reliance Entertainment, based on British author Paula Hawkins's 2015 novel of the same name. The film stars Parineeti Chopra, Avinash Tiwary, Aditi Rao Hydari and Kirti Kulhari and was released worldwide on 26 February 2021 on Netflix.\n Plot The film revolves around Mira Kapoor , an alcoholic and troubled divorcee who gets embroiled in a big murder investigation.\n Cast The film begins with Nusrat being chased by someone in the forest and Mira is standing at the station. In a flashback it is shown that Mira met her husband Shekhar at a wedding where they fell in love. They both get married and Mira is pregnant. Mira is fighting a case against Jimmy Bhagga where she successfully wins and Jimmy has to go to jail. A few days later she is hit by a car. Mira suffers from anterograde amnesia caused by a car accident. She is also an alcoholic, which doesn’t exactly help the memory loss either. She and Shekhar have separated and Shekhar married someone else.\n Production Obsessed with a seemingly perfect couple she sees from the train window on her commute to London, one drunken night Mira follows the young woman into the forest but doesn’t recall what happens next.\n Release Mira is actually a bit of a badass. The police have a decent amount of circumstantial evidence against her and even move to make an arrest but Mira escapes out the window and calls in a favour from the family member of a former client. Get me a phone, cash, and a gun, she says.\n Soundtrack Mira discovers that the missing girl Nusrat wasn’t as happily married as she looked and that she was having an affair.  It’s entirely plausible that Mira is the killer – in a drunken rage which she accidentally records on her phone, Mira fantasizes about smashing Nusrat’s head in, angry that she is ruining her own marriage.\n Reception There are plenty of other suspects too, though, including Nusrat’s sex pest dance teacher, a blackmailing private eye, and more than one aggressive and abusive husband.\n Accolades In the story, we learn that Mira’s philandering ex-husband Shehkar has been gaslighting her for years. She’s a blackout drunk but she isn’t the violent, offensive brute that he’s been claiming, and she isn’t responsible for him losing his job. \nThough Nusrat was unhappy in her marriage to abusive Anand and was pregnant by someone else, Anand didn’t kill her. Nor did the kindly therapist who was trying to help Nusrat. It turns out the Nusrat’s baby was Shehkar’s, and the night Mira followed Nusrat into “Greenwich Forest” Shehkar was there too and it was him who bashed Mira over the head with a rock and left her there. Nusrat told him of the pregnancy, they fought, and Shehkar strangled Nusrat, leaving her for dead.\n References But, she wasn’t dead, and here’s where the film diverts. It turns out there were two other people in Greenwich Forest that night. These are the police woman in charge of the case, Inspector Dalbir, and a private detective named Walter, who was hired by Anand to follow Nusrat.\n External links"
}{
    "id": 81586984,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81586984",
    "name": "Usogui",
    "genre": "Thriller Movies",
    "maturity": "U/A 13+ ",
    "duration": "1h 59m",
    "synopsis": "A brilliant gambler goes up against the most diabolical swindlers dominating the country in a fight to win control of a powerful secret organization.",
    "related-genre": [
        "Thriller Movies"
    ],
    "plot": "\n Plot Usogui  is a Japanese manga series written and illustrated by Toshio Sako. It was serialized in Shueisha's seinen manga magazine Weekly Young Jump from May 2006 to December 2017, with its chapters compiled into forty-nine tankōbon volumes. The manga was later adapted into original video animation, which was released on October 19, 2012.\n Characters Madarame Baku, known as \"The Lie Eater\", is a gambler who gambles against maniacal opponents. Alongside his protege, Kaji Takaomi, and his bodyguard, Marco, he attempts to take over the underground gambling organization known as Kakerou. Kakerou oversees a variety of high stakes gambles, wherein the participants often use their lives as an ante or a bet. There are 48 members of Kakerou and 101 referees who act as supervisors and the debt collectors for when gambles have been completed. As the series progresses, Baku and his crew find themselves increasingly involved in the war between Kakerou and a rival criminal organization, IDEAL.\n Key Figures Usogui is written and illustrated by Toshio Sako. It was serialized in Shueisha's Weekly Young Jump from May 11, 2006 to December 21, 2017. Shueisha compiled its 594 chapters into forty-nine tankōbon volumes, released from September 19, 2006 to February 19, 2018. A spin-off manga titled Usogui: Tokubetsu-hen was serialized in Weekly Young Jump from October 7, 2021 to November 25, 2021, with its one compiled volume releasing in February 2022.\n Club Kakerou A live action film adaptation was announced in the 24th issue of Shueisha's Weekly Young Jump magazine in 2016. The film is produced by Warner Bros. Japan and directed by Hideo Nakata. The film was released in Japan on February 11, 2022.\n Leaders The manga's compiled book volumes have frequently ranked on Oricon's weekly top 50 comic charts. Volume 10 reached number 28, Volume 11 reached number 16, Volume 12 reached number 19, Volume 13 reached number 29, Volume 14 reached number 20, Volume 16 reached number 19, Volume 17 reached number 21, Volume 18 reached number 18, Volume 19 reached number 27, Volume 20 reached number 25.\n Moderators"
}{
    "id": 81151877,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81151877",
    "name": "Game Over",
    "genre": "Horror Movies",
    "maturity": "A ",
    "duration": "1h 37m",
    "synopsis": "As a series of murders hit close to home, a video game designer with post-traumatic stress must confront her demons, or risk becoming their victim.",
    "related-genre": [
        "Thriller Movies",
        "Horror Movies"
    ],
    "plot": "\n Plot Game Over is a 2019 Indian psychological thriller film directed by Ashwin Saravanan. Produced by YNOT Studios and Reliance Entertainment, the film stars Taapsee Pannu as a woman with PTSD who is defending her home from mysterious intruders. The film was shot simultaneously in Tamil and Telugu. The film was also dubbed in Hindi and was presented by Anurag Kashyap. The dialogues were written by Ashwin Saravanan and Kaavya Ramkumar in Tamil and Venkat Kacharla in Telugu. The music is composed by Ron Ethan Yohann.\n Cast Principal photography commenced on 10 October 2018. The film was released on 14 June 2019 to mostly positive reviews.\n Production Game Over starts with a serial killer  stalking a girl with cancer from outside her house and later at midnight killing her by wrapping her head in plastic and tying her hands behind her. After that he takes her to an abandoned field where he beheads her and sets her body on fire.\n Soundtrack Later, the film focuses on Swapna  who is a single young woman and also a talented game designer. She has a fear of the darkness, and also has post-traumatic stress more so known as 'anniversary reaction', a condition, which triggers unsettling feelings around the anniversary of a traumatic event. For Swapna, it is the horrific memory of her rape that took place on last New Year's Eve.\n Marketing and release It is her second time that she suffers from the uncontrollable feeling whenever she enters darkness; the first time was one year ago, the following days after she was raped. Her symptom starts when she feels pain at her wrist, where there is a tattoo she got one year ago. As she got the tattoo too long ago, it was explained technically impossible by a doctor that the pain was caused by it, but only she knows there is a connection between the tattoo and her miserable memory. Her family have a traditional mindset that think decent girls should not have tattoos or go out in the night; to which she did not listen, and was later raped. Instead of encouraging her afterward, her parents kept blaming the tragedy on her, for having a tattoo and going out at night.\n Home media Because of this, she leaves her parents, never contacted them since, and leads a secluded life with Kalamma , a housemaid who stays with her. Her only solace is her love for gaming.  Swapna later learns that her tattoo ink was mixed with a stranger's ash, because of a mistake by the tattoo artist. She begins to have some bizarre dreams and finds that the girl Amutha , a cancer survivor, was an unfortunate victim of a serial killer. Amutha's mother tells Swapna that her daughter will always be with her and want her to fight.\n Reception The same serial killer that killed many young women in the city, including Amutha, finally targets Swapna, who is now temporarily a wheelchair user due to an attempted suicide. The killer kills Mr Anwar, the security of her house, and Kalamma, and finally Swapna. But before Swapna is killed, she is surprised to find that she has three of the same tattoo pattern on her wrist, where she had only one.\n Critical response Swapna wakes up from the \"nightmare\", but finds now only two tattoo patterns are left on her wrist. She now realizes that she was not killed in a dream, but it is Amutha's spirit, who wants Swapna to fight, that gave her three lives, just like video games she is often playing. And now Swapna has lost one life, with two remaining.\n Box office To avoid the same mistake that got them all killed in her first life, Swapna, who is now using her second life, call the police and stay in the house with Kalamma to wait for the police. Police arrive in time and shoot the killer before the latter kills Swapna and after, however, kills Kalamma. She seems to be saved and is taken by the police to the station. But on their way, their vehicle is exploded by a bomb set by the killers. It is now revealed that there was not only one killer that was trying to kill her, but three.\n Awards and nominations Swapna now is using her third, also the last life to fight against the killers. Encouraged by Amutha's spirit, Swapna conquers her fear for darkness. She does not turn on the light to draw the killers' attention. Swapna and Kalamma manages to kill the first killer by setting him on fire. The second killer almost kills them both but is also taken down by them. The third killer beats Kalamma to unconsciousness and confronts Swapna, who manages to stab him to death with a piece of broken mirror.\n See also The film marks the return of actress Taapsee Pannu to Tamil cinema after a hiatus of four years. The first look poster of the film was unveiled on 10 October 2018, which displayed Taapsee sitting in a wheelchair with legs in plaster casts. The shooting of the film commenced on the very next day on 11 October 2018. Pannu went under intense training playing a person who uses a wheelchair. The shooting of the film was wrapped up on 14 December 2018.\n References The official film score is composed by Ron Ethan Yohann who had worked with Ashwin Saravanan in Maya and Iravaakaalam. The music rights were secured by the production company's subsidiary music label YNOT Music, with Divo as their digital partner. The official soundtrack album was released by Santhosh Narayanan on 24 August 2019. The album features 28 songs which lasts for 67 minutes.\n External links"
}{
    "id": 81004797,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81004797",
    "name": "The Occupant",
    "genre": "Crime Movies",
    "maturity": "U/A 16+ ",
    "duration": "1h 43m",
    "synopsis": "An unemployed advertising executive begins stalking the new tenants of his former home and his motives toward the family turn sinister.",
    "related-genre": [
        "Crime Movies",
        "Thriller Movies"
    ],
    "plot": "The Occupant  is a 2020 Spanish thriller drama film directed by David Pastor and Àlex Pastor, and written by David Pastor and Àlex Pastor.\n Plot The plot revolves around Javier Muñoz , a former executive who is forced to sell his apartment because of unemployment. He becomes obsessed with the new occupants, and begins infiltrating their lives.\n Cast The film was slated for a March 2020 world premiere at the Málaga Spanish Film Festival, but the event was postponed due to the COVID-19 pandemic disruption. It was released on March 25, 2020 on Netflix.\n Release On review aggregator Rotten Tomatoes, the film holds an approval rating of 61% based on 23 reviews, with an average rating of 5.9/10. The website's critics consensus reads, \"Meandering character development undercuts The Occupant's exciting premise, though Javier Gutiérrez's exceptional performance makes the proceedings work.\"\n Reception"
}{
    "id": 81038345,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81038345",
    "name": "The Intruder",
    "genre": "US Movies",
    "maturity": "U/A 16+ ",
    "duration": "1h 42m",
    "synopsis": "After moving into their Napa Valley dream house, a couple realizes that the strange seller isn’t quite as motivated to move on.",
    "related-genre": [
        "US Movies",
        "Thriller Movies"
    ],
    "plot": "The Intruder is a 2019 American psychological thriller film directed by Deon Taylor and written by David Loughery. The film stars Michael Ealy and Meagan Good as a couple who buy a house in the country, only to realize its previous owner  refuses to let it go. It was released in the United States on May 3, 2019, by Sony Pictures Releasing, receiving generally negative reviews from critics. However, it was a commercial success, grossing $40 million worldwide against its $8 million budget.\n Plot Scott  and Annie Howard  purchase a Napa Valley house called \"Foxglove\" from its previous owner, Charlie Peck . Charlie explains his wife, Ellen, passed away from cancer two years earlier and he will soon be moving to Florida to live with his daughter, Cassidy. Scott is instantly irritated by Charlie who appears overly friendly with Annie and keeps dropping by unannounced.\n Cast Scott and Annie invite their friend Mike and his wife over to spend the night. When Mike goes outside for a cigarette, he senses he is being watched. The following morning, he notices a cigarette burn on the seat of his luxury car that wasn't there previously. Charlie continues to show up without an invitation; he explains he is not moving to Florida just yet, and is staying at the Royal Hotel in town. Tensions rise between Scott and Annie due to Scott's coldness toward Charlie, and it is also revealed that, before getting married, he had cheated on her with a colleague.\n Production When a neighbour tells Scott that Charlie's wife killed herself with one of Charlie's shotguns, Scott asks Mike to investigate him. Meanwhile, Charlie has developed an obsession with Annie and begins visiting her at home when Scott is not there. One morning, while Scott is out jogging, a truck runs into him from behind; it turns out that Charlie was the driver. Mike uncovers that Charlie had gone into debt and was facing legal trouble and therefore was forced to sell the house to Scott and Annie. While Scott is in the hospital, Charlie shows up at the house, and he and Annie have dinner. Mike goes to check on her and is confronted by Charlie, who declares he has a chance to get back all he lost and must get rid of Scott. Charlie then kills Mike with an axe.\n Release The next morning, Scott contacts Cassidy, who has since changed her name, but she hangs up when Scott mentions her father. Scott also discovers Charlie has never stayed at the Royal. Charlie appears in the house and passionately declares his feelings for Annie. She claims she is feeling ill and calmly asks Charlie to leave, which he does. Annie then goes upstairs and finds a hidden door behind the linen closet, leading to Charlie's underground cellar, where he has been living the whole time since selling the house. Meanwhile, Scott is driving home and receives a call back from Cassidy who explains Charlie is a pathological liar who murdered her mother after she threatened a divorce.\n Reception Back at the house, Charlie discovers that Annie has found his cellar. He knocks her unconscious, carries her upstairs and begins assaulting her. When Scott returns home, Charlie ambushes him and throws him over the hallway balcony. Charlie begins strangling Annie, but Scott reappears. The two men struggle and Annie stabs Charlie in the back. Charlie staggers away to the cellar, where he retrieves a shotgun.\n Box office Scott and Annie hide behind the bedroom door as Charlie searches the house for them. When Charlie enters the room, Scott strikes him in the head with a baseball bat and seizes the rifle. Lying on the floor bleeding, Charlie taunts Scott by saying Scott would never dare shoot him. As they stand over Charlie, Annie calls 911 and informs the dispatcher that her husband has just shot an intruder. Horrified, Charlie screams, \"You don't deserve Foxglove!\" Scott replies, \"Go to hell,\" and shoots Charlie, finally killing him.\n Critical response In May 2018, Ealy, Good and Quaid all signed onto the project. It was then announced that the worldwide distribution rights had been acquired by Screen Gems at the 2018 Cannes Film Festival, after production had been completed under the title Motivated Seller.\n See also The Intruder was released in the United States on May 3, 2019. It was previously set for an April 26, 2019 release, but was pushed back a week to separate from Avengers: Endgame. The film was released on Blu-Ray and DVD on July 30, 2019.\n References The Intruder grossed $35.4 million in the United States and Canada, and $5.2 million in other territories, for a worldwide total of $40.6 million, against a production budget of $8 million.\n External links"
}{
    "id": 81277610,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81277610",
    "name": "Oxygen",
    "genre": "Sci-Fi Movies",
    "maturity": "U/A 13+ ",
    "duration": "1h 41m",
    "synopsis": "After waking up in a cryogenic unit, Liz fights to survive and remember who she is before her oxygen runs out.",
    "related-genre": [
        "Sci-Fi Movies",
        "Dramas",
        "Thriller Movies"
    ],
    "plot": "Oxygen  is a 2021 French-language science fiction thriller film, directed and produced by Alexandre Aja, from a screenplay by Christie LeBlanc. As part of an American-French co-production, it stars Mélanie Laurent, Mathieu Amalric, and Malik Zidi. The film was released by Netflix on May 12, 2021.\n Plot A woman awakens in an airtight medical cryogenic unit, and discovers that she is trapped and that the unit's oxygen levels are falling rapidly. Suffering from memory loss, she does not remember who she is or how she got there. She is assisted by an advanced AI named M.I.L.O. , but it refuses to open the cryo unit without an administrator code. Using M.I.L.O., she is able to transmit outside the pod and contact emergency services. She provides them with the cryo unit's model and serial number, which are printed on the interior. Upon contacting the manufacturer they are told the unit was destroyed three years prior. Unable to recall her memories, she looks for clues about her past by searching for pictures and articles from M.I.L.O. and finds her name, Elizabeth  Hansen. She realizes she is a cryogenic doctor. She finds her husband, Léo Ferguson, and his contact number by accessing her social media, but when she calls his number a woman answers. She tells the woman that she is Léo's wife and demands to speak to him. The woman seems confused and hangs up.\n Cast As the oxygen level continues to fall, Liz begins hallucinating and tries to open the pod, only to receive an electric shock. She then receives a call back from the police but suspects they are hiding something from her, and disconnects. The unknown woman she called earlier rings and tells her that Léo is dead. She also gives her the administrator code to open the pod, but tells her that if she opens the pod, she will die. Liz uses the code to give herself administrator access, but stops short of opening the pod when the unknown woman begs her to listen. Following the woman's instructions, Liz accesses controls for a centrifuge, and turns the centrifuge off. She begins floating weightlessly. After a brief explanation, it is revealed that she has been placed into hypersleep, and is 12 years into a 34-year journey to a 14 light-year distant planet. The mission is secret and mankind will be extinct in the near future due to a deadly virus – the virus that killed Léo.\n Production Heartbroken, she learns that the awakening was due to a processor overheating, and realizes she must divert the functions of the processor to a less sophisticated processor assigned to non-essential functions, but fails since the data exceeds that processor's capacity. As time passes and with the oxygen level fading, she prepares for suicide by attempting to open the pod. Shortly after, she discovers Léo is also in hypersleep in the damaged spaceship together with nearly 10,000 others, but she notices he lacks a scar on his forehead that he had before. Upon further investigation, through a video of a presentation  by an elderly version of her, it is revealed that she is a genetic clone with the original Elizabeth Hansen's personality and memories implanted, including memories of Léo. The woman she has been speaking to on earth designed the hypersleep units, but the call disconnects as the spacecraft moves out of communications range.\n Filming M.I.L.O. activates a euthanasia protocol due to her zero chance of survival; however, Liz manages to deactivate the euthanasia processor and successfully reassigns the malfunctioning processor's functions to it. As her oxygen level counts down to zero, Liz manages to reroute oxygen from pods with already dead occupants, and M.I.L.O. puts her back in hypersleep.\n Release The clones of Léo and Elizabeth are shown on the new planet, smiling and embracing each other.\n Reception In July 2017, it was announced Anne Hathaway had joined the cast of the film and would serve as a producer on the film, with Echo Lake Entertainment and IM Global attached to produce the film , from a screenplay by Christie LeBlanc. In February 2020, it was announced Noomi Rapace had joined the cast of the film, replacing Hathaway, with Franck Khalfoun directing the film, and Alexandre Aja serving as producer. In July 2020, Mélanie Laurent, Mathieu Amalric, and Malik Zidi joined the cast, replacing Rapace, with Aja serving as director replacing Khalfoun, and Adam Riback and James Engle executive producing through Echo Lake Entertainment. In February 2021, the completed film was reported to have received the new title Oxygen.\n References Principal photography began in July 2020.\n External links"
}{
    "id": 80242820,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80242820",
    "name": "The Chalk Line",
    "genre": "Crime Movies",
    "maturity": "U/A 16+ ",
    "duration": "1h 47m",
    "synopsis": "After a couple finds a traumatized child of unknown origins, wife Paula must decipher the girl's strange behaviors to unlock her identity and dark past.",
    "related-genre": [
        "Mysteries",
        "Crime Movies",
        "Thriller Movies"
    ],
    "plot": "\n Plot The Chalk Line  is a 2022 Spanish mystery psychological thriller film directed by Ignacio Tatay in his feature debut. It stars Elena Anaya.\n Cast and characters The story is primarily set in a residential area with upper-class villas. One night, Paula and her husband discover a wandering girl who is obsessed with a monster that will allegedly haunt her once she crosses a chalk square drawn on the ground. After attempting to amend their conjugal relationship, the couple pledges to foster the girl on a temporary basis.\n Production Isabel Peña collaborated in writing the story. The project, a Pokeepsie Films production, was halted due to the onset of the COVID-19 pandemic in Spain. Filming resumed in July 2020, with Oriol Barcelona on cinematography duties. The film was shot at a number of locations in the Madrid region, including Madrid, San Lorenzo de El Escorial, Boadilla del Monte, as well as a set in Villaviciosa de Odón.\n Release Distributed by Sony Pictures Entertainment Iberia, the film was theatrically released in Spain on 9 September 2022 and came out on Netflix on 24 October 2022.\n Reception The Chalk Line grossed $177,828 in Spain.\n Box office The review aggregator website Rotten Tomatoes reported a 67% approval rating, with an average score of 6.4/10, based on 9 reviews.\n Critical response Raquel Hernández Luján of HobbyConsolas gave the film 78 points , deeming it to be \"candy for thriller lovers\", with \"good performances and production values\", endorsing a \"memorable debut\". Miguel Ángel Romero of Cinemanía rated the film 3 out of 5 stars, writing that Tatay makes a masterful debut, \"a horror-tinged thriller whose strength lies in the acting quality of its protagonists\". Jordi Batlle Caminal of Fotogramas rated Jaula 3 out of 5 stars, deeming the debut feature to be a \"model exercise in genre cinema, well-made and without authorial pretensions\", featuring a \"spectacular\" plot twist at the height of the hour mark. Marshall Shaffer of Decider.com considered that despite being a \"promising feature debut\" for Tatay, the film \"never quite coheres as it should\", failing to \"fulfill all its ambitions or breakthrough beyond its  atmosphere\".\n See also"
}{
    "id": 80202902,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80202902",
    "name": "Two",
    "genre": "Dramas",
    "maturity": "A ",
    "duration": "1h 11m",
    "synopsis": "Two strangers awaken to discover their abdomens have been sewn together, and are further shocked when they learn who's behind their horrifying ordeal.",
    "related-genre": [
        "Dramas",
        "Thriller Movies"
    ],
    "plot": "\n Cast Two  is a 2002 French drama film directed by Werner Schroeter and starring Isabelle Huppert.\n See also \n References This article related to a French film of the 2000s is a stub. You can help Wikipedia by expanding it. External links"
}{
    "id": 80211749,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80211749",
    "name": "Who Am I",
    "genre": "Crime Movies",
    "maturity": "U/A 16+ ",
    "duration": "1h 41m",
    "synopsis": "After his compatriots are murdered by Russian gangsters, a hacker confesses the history of his elite, fame-seeking group to a Europol investigator.",
    "related-genre": [
        "Crime Movies",
        "Thriller Movies"
    ],
    "plot": "\n Plot Who Am I  is a 2014 German techno-thriller film directed by Baran bo Odar. It is centered on a computer hacker group in Berlin geared towards global fame. It was screened in the Contemporary World Cinema section at the 2014 Toronto International Film Festival. The film was shot in Berlin and Rostock. Because of its storyline and some elements, the film is often compared to Fight Club and Mr. Robot.\n Cast Benjamin Engel, a hacker from Berlin, sits in an interrogation room. The officer in charge tells Hanne Lindberg, Head of the Cyber Division of Europol, that Benjamin asked to conduct the interrogation. Benjamin says that he has information regarding FR13NDS , a notorious hacking group of four members connected to the Russian cyber mafia, and MRX, an infamous hacker known on Darknet; he tells her that he could give them both to Hanne if she listens to him. Having no choice, Hanne sits down.\n Reception Benjamin tells Hanne that he is like a superhero: like many heroes, he, too, has no parents; he never met his father as he abandoned the family when Benjamin was born, and his mother committed suicide when he was 8. He lives alone with his ailing grandmother. He regards his \"superpower\" as invisibility, as he was never noticed by most people during his childhood, due to him being socially awkward. He says he learned programming and hacked his first system when he was 14. Though he felt like a loser in real life, he felt a sense of belonging on the Internet. While spending most of his time on Darknet, he met his hacking hero, MRX, whose identity no one knows and who can hack into any system. Benjamin aspires to be like him.\n Other versions However, as he was unable to attend university, he worked as a pizza delivery boy to pay the bills. He tells Hanne that, one night while he delivered pizzas to a group of students, he saw Marie, a girl with whom he was in love since his school days. Hearing her having trouble with examinations, he decided to help her and be a 'superhero'. He went to the University, hacked into its servers to download the exam questions—but he was caught by a security guard and arrested. Having no prior criminal record, he was forced to perform community service as a punishment.\n References He tells Hanne that while working on cleaning the streets as punishment, he met Max, a fellow hacker, who Benjamin feels is the opposite of himself; a charismatic, cocky and confident individual. Later, Max had introduced him to his colleagues Stephan and Paul. After Benjamin proved himself as a hacker, Max explained to him that the concept of social engineering is the greatest form of hacking. They decide to form a hacking group, called \"Clowns Laughing At You\", nicknamed CLAY, and they use Benjamin's house as a base of operations, since Benjamin was forced to send his grandmother to a nursing home due to her Alzheimer's disease. They cause general mayhem around Berlin in a form of pranking, becoming popular around social media. However, MRX, with whom is Max obsessed, mocks them outright. Infuriated, Max wants to perform a more outrageous feat of hacking, and Benjamin suggest hacking the main building of BND . Impressed by this outrageous idea, the group agrees with Benjamin and decide to hack the BND in order to impress MRX.\n External links"
}{
    "id": 81157374,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81157374",
    "name": "Run",
    "genre": "Horror Movies",
    "maturity": "U/A 16+ ",
    "duration": "1h 29m",
    "synopsis": "Desiring freedom after years of isolated medical care, teenager Chloe suspects her mother might be holding her back — and harboring sinister secrets.",
    "related-genre": [
        "US Movies",
        "Thriller Movies",
        "Horror Movies"
    ],
    "plot": "Run  is a 2020 American psychological horror thriller film directed by Aneesh Chaganty and written by Chaganty and Sev Ohanian. The film stars Kiera Allen as Chloe Sherman, a disabled homeschooled teenager who begins to suspect that her mother Diane  is keeping a dark secret about her upbringing.\n Plot Announced in June 2018, with Paulson being cast that October and Allen that December. Principal photography also occurred in that time frame, with filming primarily taking place on location in Winnipeg, Manitoba. The film has connections to other films by Chaganty and Ohanian, including Missing .\n Cast Run was released in the United States via streaming on November 20, 2020 on Hulu, and was released in other territories both theatrically and through streaming by Lionsgate International and by Netflix on April 2, 2021. The film received generally positive reviews from critics and became Hulu's most successful original film upon its release.\n Production Diane Sherman gives birth prematurely to a daughter, whom she goes to see lying in an incubator surrounded by hospital staff. Seventeen years later, Diane lives a quiet life with her now-teenage daughter, Chloe. Due to the circumstances of her birth, Chloe suffers from arrhythmia, hemochromatosis, asthma and diabetes, as well as partial paralysis. She uses a wheelchair, takes multiple medications daily, and is homeschooled by her mother.\n Release One morning while looking through a bag of groceries for chocolate, Chloe finds a prescription bottle of green pills with Diane's name on the label. However, when Chloe later inspects the bottle, she finds a label bearing her name has been pasted over the original. Chloe tries to look up the name of the pills - Trigoxin - but discovers the house has no internet connection; Diane is seen sitting in the dark behind her next to an unplugged router. The next day, Chloe dials a random number from her mother's bedroom phone, and asks the answering stranger to look up the drug. He tells her it is a heart medication and that all pictures of the medication show a small red pill.\n Reception Chloe asks Diane to take her to the movies. During the film, while pretending to go to the bathroom, she rushes to the pharmacy across the street. The pharmacist reveals the green pills are a relaxant called Ridocaine, which is only approved for dogs. When Chloe asks what would happen if a human took the medication, the pharmacist informs her that it could numb one's legs. Upon realizing her mother may be administering medication to her to impair her ability to walk, Chloe begins to hyperventilate. Diane runs in and secretly sedates her daughter to take her home.\n Audience viewership Chloe wakes up in bed and finds her bedroom door locked while Diane is out running an errand. Realizing that she has the house to herself, Chloe breaks out of her room by dragging herself onto the roof, eventually making her way to her mother's bedroom and breaking the window with a soldering iron and some water. She begins to have an asthma attack and only barely manages to crawl to her room and retrieve her inhaler. She tries to use her automated wheelchair ramp to go downstairs, but finds that Diane has cut the power cord. Chloe is forced to throw her wheelchair down the stairs and accidentally falls, sustaining minor injuries but also discovering that she can move one of her toes due to having not taken the Ridocaine in a few days.\n Critical response Outside down the road, Chloe sees a mail truck and rushes to stop it; she explains her situation to Tom, the postal worker, who agrees to help. Diane pulls up and Chloe asks him to contact the police. Tom confronts Diane and tells her she can't take Chloe home. When closing up the van to take Chloe to the police station, Diane appears and stabs him with a sedative syringe. Chloe blacks out, and when she awakes, she is in the basement of her house, with her wheelchair chained to a steel pole.\n Related films While in the basement, Chloe discovers all of her childhood photos, which show her walking, as well as a death certificate for a girl named Chloe who died two hours after her birth and an article about a couple who had their baby stolen from the same hospital. When Diane enters, Chloe accuses her of deliberately making her sick and demands the truth. Diane insists everything she ever did was to help and protect Chloe and when Chloe accuses Diane of poisoning her, Diane exclaims that she saved her, while filling a syringe with paint thinner, saying it will make her forget. Chloe crawls away and locks herself in a closet. Afraid, but realizing that Diane won't let her die, Chloe swallows the contents of a bottle of organophosphate, forcing Diane to rush her to a hospital.\n Searching  Chloe wakes up in a hospital bed, intubated and barely able to move. Diane insists that her \"daughter\" be discharged, but the doctors refuse until Chloe has been evaluated by a mental health professional. Chloe signals to a nurse, who brings her a crayon and paper. While Chloe is attempting to write \"MOM\" on the paper, a code blue is called and the nurse rushes out. Diane then sneaks in and ties Chloe to a wheelchair to escape; the nurse finds the bed empty and alerts hospital security. As a panicking Diane tries to find an exit, Chloe is able to move her foot and hold the chair in place. Diane begs her to come home with her, but Chloe defiantly replies that she doesn't need her any longer. Diane is shot in the arm by security guards, causing her to fall down the stairs.\n Missing  Seven years later, an adult Chloe goes to a correctional facility; although she still relies on her wheelchair, she is now able to walk short distances with the use of a cane. She visits Diane in the infirmary ward, who is now confined to a bed, and begins talking about her wonderful husband, children, and job. Chloe takes out three plastic-wrapped Ridocaine pills she hid under her tongue, and tells Diane that she still loves her before asking her to open her mouth wide.\n See also In June 2018, it was announced Lionsgate would produce, distribute, and finance the film, with Aneesh Chaganty directing, from a screenplay he wrote alongside Sev Ohanian. Ohanian and Natalie Qasabian produced the film. In October 2018, Sarah Paulson joined the cast of the film, and in December 2018, Kiera Allen was set to star as well.\n References Principal photography in Winnipeg, Canada began on October 31, 2018, and wrapped on December 18, 2018.\n External links"
}{
    "id": 81281446,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81281446",
    "name": "The Royal Bengal Tiger",
    "genre": "Dramas",
    "maturity": "U/A 16+ ",
    "duration": "1h 43m",
    "synopsis": "Knocked down by life one too many times, a meek family man drastically transforms from shy to savage after an encounter with a mysterious friend.",
    "related-genre": [
        "Dramas",
        "Thriller Movies"
    ],
    "plot": "\n Synopsis The Royal Bengal Tiger is an Indian Bengali suspense thriller film directed by Rajesh Ganguly, written and produced by Neeraj Pandey.It is based on Chuck Palahniuk's famous novel 'Fight Club'. The film stars Abir Chatterjee, Priyanka Sarkar, Shraddha Das and Jeet. The film received positive reviews from critics and turned out to be commercially successful. The film has only one song, sung by Timir Biswas. The film premiered in Kolkata on 1 February 2014.\n Cast Abhi  is a meek Bengali family man who does not know how to fight. He lives in Kolkata with his wife Apu  and his son. He has a tenant Mr. Pakrashi  who has not paid rent for six months. He simply walks away. In his office Abhi is a hardworker. His colleague Deepankar  is jealous of him and plans his downfall, but his other colleague Nandini  is a friend and sympathiser. During Abhi's birthday morning he asked his tenant to pay up, but gets slapped in the middle of the road by him.\n Critical response Abhi goes to his office only to learn that all his files have been messed up by someone and one important file of payment is missing. He works the whole night on them only to be sabotaged by Deepankar again. That night while Abhi was returning with Nandini she gets molested by some goons at the metro station. She cries to Abhi for help, but Abhi cannot fight. Nandini boards the metro crying. leaving Abhi at the station.\n References Abhi is ashamed. He meets his friend Anjan   and narrates the story and about his helplessness. Anjan takes him to a coffee house and encourages him, causing him to shrug off his fear. They both visit his office to search for the missing file. Finding nothing, they ransack the office and run away.\n External links"
}{
    "id": 80210767,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80210767",
    "name": "Spiderhead",
    "genre": "Sci-Fi Movies",
    "maturity": "A ",
    "duration": "1h 47m",
    "synopsis": "A prisoner in a state-of-the-art penitentiary begins to question the purpose of the emotion-controlling drugs he's testing for a pharmaceutical genius.",
    "related-genre": [
        "Sci-Fi Movies",
        "US Movies",
        "Movies Based on Books",
        "Thriller Movies"
    ],
    "plot": "\n Plot Spiderhead is a 2022 American science fiction psychological thriller film directed by Joseph Kosinski, with a screenplay by Rhett Reese and Paul Wernick, based on the dystopian short story \"Escape from Spiderhead\" by George Saunders and first published in The New Yorker. The film stars Chris Hemsworth, Miles Teller, and Jurnee Smollett. The story follows inmates in a luxurious prison who participate in experiments involving mind-altering drugs. Principal photography took place in Australia in 2020.\n Cast Spiderhead premiered in Sydney on June 11, 2022, and was released on Netflix on June 17. The film received mixed to unfavorable reviews from critics.\n Production Spiderhead is a state-of-the-art penitentiary experimenting with the effects of research chemicals. The test subjects, technically prisoners of the state, are volunteers for the project aiming to reduce their sentence time. The program is overseen by the sympathetic and hospitable Steve Abnesti, along with his assistant Mark. The prisoners have their own rooms, do chores, and are free to roam without guard supervision. The subjects go through daily test runs of various drugs, all of which alter their emotions and their perceptions of their surroundings.\n Development Inmate Jeff, still reeling from having killed his friend whilst drunk driving, is given N-40, a \"love drug\", which distorts his senses and drives him to have sex with two of his fellow inmates. Steve asks him to choose which one of them to give Darkenfloxx, a drug that induces intense fear and psychological pain. He declines to choose, claiming he feels nothing in particular for either one of them after the effects of the love drug had worn off. Mark helps Steve administer some N-40 to himself. \n Filming The next day, Steve brings Jeff into the observation room and tells him that the \"higher ups\" have decided that the younger of the two women, Heather, must be injected with a dose, though it will only last five minutes. Jeff reluctantly agrees, and to his horror, Heather commits suicide while on the Darkenfloxx after she damages her MobiPak, the device that administers the drugs. This causes Mark to doubt their work in the facility. As Steve rushes out of the projection room, he drops his keys. Jeff unlocks Steve's desk compartment, discovering that there are no \"higher-ups\": the prison is run by Abnesti Pharmaceuticals, Steve's company. The drugs were named from a bingo card.\n Release Steve and Jeff get high together on a laughing drug, as Steve also has a MobiPak installed. Steve tells Jeff that his father abandoned him as a child. Jeff confesses to Lizzy, an inmate he is close with, that he not only killed his friend in the car accident but his girlfriend as well. Lizzy hugs him and they kiss. Steve notices Jeff's feelings for Lizzy. Mark becomes doubtful of Steve's motives, and he breaks down when Jeff confronts him. \n Reception When Steve asks Jeff to administer Darkenfloxx to Lizzy, Jeff takes control of Steve's MobiPak, reveals that Mark has spiked his Mobipak with Darkenfloxx, and forces him to admit the true goal of the program: testing a compliance drug, B-6. The other drugs are merely side projects being used to put B-6 to the ultimate test: whether or not they would harm their love when commanded to. The entire time inmates had been consenting to the various tests, they had really been under the influence of the obedience drug. In addition, Steve informs Jeff that he had in fact finished his sentence seven months previously, while Lizzy's appeal for release had passed the previous week. Jeff forces Steve to open the door of the main entrance to free Lizzy and then tries to order him to hand over the pocket knife. Steve resists the order , and instead takes his phone and enables all four vials of Darkenfloxx in Lizzy's MobiPak, causing her to behave hysterically and attempt suicide. The two fight for control and Jeff is able to disarm Steve, damaging his MobiPak in the process. Jeff rushes to save Lizzy, successfully removes the vials of Darkenfloxx and tells her he loves her, but Steve gets up and orders the other inmates to apprehend Jeff and Lizzy. They are able to escape from Spiderhead after overpowering some of the other inmates and locking the main door behind them. Mark and the police are now approaching the island as Steve escapes on his floatplane, but he joyously crashes into a mountain as he is now high off of his damaged MobiPak.  Meanwhile, Jeff and Lizzy take the remaining motorboat and escape.\n References In a voice-over, Jeff comments that no drug can bestow self-forgiveness, instead it must be worked on and chosen.\n External links"
}{
    "id": 60021786,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/60021786",
    "name": "Vanilla Sky",
    "genre": "US Movies",
    "maturity": "A ",
    "duration": "2h 16m",
    "synopsis": "A man who has everything -- money, good looks and a gorgeous woman -- seemingly loses it all when his face is horribly disfigured in a car accident.",
    "related-genre": [
        "US Movies",
        "Thriller Movies",
        "Romantic Movies"
    ],
    "plot": "Vanilla Sky is a 2001 American science fiction thriller film directed, written, and co-produced by Cameron Crowe. It is an English-language remake of Alejandro Amenábar's 1997 Spanish film Open Your Eyes, which was written by Amenábar and Mateo Gil. The film stars Tom Cruise, Penélope Cruz , Cameron Diaz, Jason Lee, and Kurt Russell. It follows a magazine publisher who wakes up in a different reality, after his lover kills herself. After surviving the car accident and being accused of murder, he plans to kill himself and join his lover in death.\n Plot The film has been described as \"an odd mixture of science fiction, romance, and reality warp\". It was nominated for an Academy Award for Best Original Song, and Diaz was nominated for a Screen Actors Guild and Golden Globe Award. The film has gained a cult following.\n Cast David Aames, the owner of a large publishing company he inherited from his father, is in prison. Wearing a prosthetic mask, David tells his life story to court psychologist Dr. Curtis McCabe.\n Production In flashbacks, David leaves the duties of the publisher to his father's trusted associates while living as a playboy in Manhattan. He is introduced to Sofia Serrano by his best friend, Brian Shelby, during a party. David and Sofia spend the night together at Sofia's apartment and fall in love, unaware that David's current lover, Julie Gianni, has followed them there. As David leaves, Julie offers him a ride, and soon reveals her jealousy of Sofia. She purposely crashes the car, killing herself and disfiguring David.\n Development Doctors cannot repair David's face using plastic surgery, forcing him to wear a prosthetic mask, but the mental and physical scarring from the accident causes him to become withdrawn and depressed. Brian convinces David to join him and Sofia at a club. They leave him in the street outside the club after he becomes drunk and insults them.\n Filming The next day, Sofia returns and apologizes to David. She takes him home, the two form a relationship and he slowly begins to recover. Doctors find a way to repair David's face despite their prior prognosis. Later, he is plagued by bizarre experiences, such as brief flashbacks of his disfigurement and an encounter with a mysterious man at a bar who informs him that David is omnipotent, demonstrated by the entire bar falling silent at David's command. One day, while at Sofia's, David awakens to find himself in bed with Julie, whose face has replaced Sofia's in their photographs. In shock, he suffocates Julie. David is arrested and imprisoned and his facial disfigurement is mysteriously restored.\n Alternate ending Dr. McCabe conducts several more interviews, which serve to help David to recall the name \"Life Extension\". Seeing a company with that name nearby, McCabe arranges to take David there under guard. Rebecca, a company representative, explains how Life Extension uses cryonic suspension to save those with terminal illnesses until a cure can be found, keeping them in a lucid dream state to otherwise exercise their mind. David realizes that he is in cryonic suspension and the world he inhabits is his own lucid dream, which has become a nightmare. He escapes McCabe and the guards while calling for \"tech support\", and rushes for the building's lobby, which is suddenly empty. An elevator opens, revealing the strange man from the bar.\n Music As the elevator climbs to the top of an impossibly tall building, the man explains that he is Tech Support and that David has been in suspension for 150 years. Unable to face the twin traumas of the loss of his love, Sofia, and his facial injuries, he had opted for Life Extension to be woken when technology could repair his face, and left the publishing company in the hands of his father's associates. As part of the program, David had chosen to experience a lucid dream, in which his life would resume the morning after Sofia left him. However, a glitch in the software had caused other elements of his subconscious to distort his dream.\n Interpretations They emerge on the rooftop, high above the clouds. Tech Support tells David that while they have corrected the flaw, he now has a choice of either being returned to the dream or being restored to life, requiring a literal leap of faith off the roof that will wake him from his sleep. David chooses the latter, despite McCabe warning him against it. Before jumping, David envisions Brian and Sofia to say his goodbyes. He leaps from the edge of the building, and his life flashes before him.\n Release David snaps awake as a female voice invites him to open his eyes.\n Reception In the days after completing Almost Famous, the opportunity to keep our film-making team together was too attractive to pass up. I'd always written my own original screenplays, but Open Your Eyes, with its open-ended and impressionistic themes, felt like a great song for our 'band' to cover.\n Critical response —Cameron Crowe, explaining his reason for directing Vanilla Sky.\n Awards and nominations After the American debut of Alejandro Amenábar's 1997 Spanish film Abre los ojos  at the 1998 Sundance Film Festival, Tom Cruise and his producing partner Paula Wagner optioned the remake rights. Hoping to entice director Cameron Crowe, who collaborated with Cruise on Jerry Maguire, Cruise invited Crowe over to his house to view the film. Cruise has stated:\n Notes I've been offered a lot of films to buy and remake, and I never have because I felt it was too connected with the culture of that place, whatever country it was from. But this was a universal story that was still open-ended, that still felt like it needed another chapter to be told. See also The title of the film is a reference to depictions of skies in certain paintings by Claude Monet. In addition to Monet's impressionistic artwork, the film's tone was derived from the acoustic ballad \"By Way of Sorrow\" by Julie Miller and a line from an early interview of Elvis Presley in which he said, \"I feel lonely, even in a crowded room.\"\n References Principal photography for Vanilla Sky began in late 2000 and lasted six weeks. On November 12, 2000, shooting for the scene of the deserted Times Square in New York took place in the early hours of the day. A large section of traffic was blocked off around Times Square while the scene was shot. \"There was a limit on how long the city would let us lock everything up even on an early Sunday morning when much of NYC would be slow getting up,\" said Steadicam operator Larry McConkey. \"Several times we rehearsed with Steadicam and Crane including a mockup of an unmovable guardrail that we had to work the crane arm around.  participated in these rehearsals as well so we shared a clear understanding of what my limitations and requirements would be.\"\n External links"
}{
    "id": 80135164,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80135164",
    "name": "1922",
    "genre": "Horror Movies",
    "maturity": "A ",
    "duration": "1h 42m",
    "synopsis": "A farmer pens a confession admitting to his wife's murder, but her death is just the beginning of a macabre tale. Based on Stephen King's novella.",
    "related-genre": [
        "US Movies",
        "Movies Based on Books",
        "Crime Movies",
        "Thriller Movies",
        "Horror Movies"
    ],
    "plot": "\n Plot 1922 is a 2017 American horror drama film written and directed by Zak Hilditch, based on Stephen King's 2010 novella of the same name. Starring Thomas Jane, Neal McDonough, and Molly Parker, the film was released on Netflix on October 20, 2017.\n Cast In 1922, Wilfred \"Wilf\" James is a farmer living in Hemingford, Nebraska with his wife, Arlette James, and their 14-year-old son, Henry. Wilf is strongly opposed to Arlette's plans to sell the farm and move to Omaha. He decides to convince Henry to help murder Arlette, holding Henry's girlfriend, Shannon Cotterie, whose relationship Arlette opposes, at stake. Henry reluctantly agrees to assist his father in carrying out the murder.\n Production Wilf pretends to agree to the sale, appeasing Arlette. As she celebrates, she becomes inebriated. After Wilf carries her to bed in a drunken stupor, Henry covers her face while Wilf cuts her throat with a butcher's knife. Wilf dumps her body into a dry well where her corpse is soon fed upon by rats. The next day, they drop a cow into the well to hide Arlette's body and provide a reason for filling in the well. Sheriff Jones is suspicious following her sudden disappearance; he searches the house, but finds no proof of a crime, tentatively believing Wilf's story that his wife absconded.\n Reception As time passes, Henry becomes brooding and isolated, regretting the crime that he and his father have committed. Shannon grows increasingly concerned and subsequently discovers she is pregnant with Henry's child. Her parents decide to send her to a Catholic institution in Omaha until the baby is born and will then be placed for adoption. Henry steals Wilf's car, arrives in Omaha, and runs away with Shannon.\n References As the winter passes, Wilf appears to be going insane, being constantly harassed by rats. He takes out a mortgage on his house to fix it up, but is never actually able to begin the work, as a rat bites his hand while he searches through an upstairs closet. Owing to continued neglect, the roofs on his barn and his house cave in, but he is too consumed by guilt and alcohol to fix them, and in his increasing isolation, his hand injury worsens. His house falls in to a state of total disrepair and becomes completely infested by rats.\n External links"
}{
    "id": 81068703,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81068703",
    "name": "Fatal Affair",
    "genre": "US Movies",
    "maturity": "U/A 16+ ",
    "duration": "1h 29m",
    "synopsis": "A lawyer is caught in a terrifying game of cat and mouse when a drink with an old friend escalates into an obsession that jeopardizes everyone she loves.",
    "related-genre": [
        "US Movies",
        "Thriller Movies"
    ],
    "plot": "Fatal Affair is a 2020 American psychological thriller film directed by Peter Sullivan, who co-wrote the screenplay with Rasheeda Garner. It stars Nia Long, Omar Epps, Stephen Bishop, and KJ Smith.\n Plot It was released on July 16, 2020, by Netflix.\n Cast Ellie Warren is a successful attorney living with her husband Marcus who is recovering after a horrible car accident. They have just moved into a new house on the coast from the city of San Francisco now that their daughter Brittany has left for college. Ellie meets her firm's new tech consultant, David Hammond, who both first met each other in college. David is in anger management therapy following an incident with a woman named Deborah. Ellie and David initially meet for drinks, but the situation turns sexual as they go to the bathroom of a club, although Ellie resists. Afterwards, David stalks her via phone calls, texts, viewings of her house from a distance, breaking into her home, hacking into her home security system, sending her a package, and dating Ellie's friend Courtney. This is all despite Ellie's warnings to stay away from her and her family.\n Production Ellie learns from another one of her former college classmates that David murdered his ex-wife Deborah and her new boyfriend a few months after the divorce. Ellie sends Courtney an e-mail with information about Deborah's murder and how David likely committed it, but David deletes it. Ellie is horrified to see him golfing with Marcus. She convinces the concierge at David's building to let her into his apartment, where she finds pictures of Deborah and of herself taken from afar on his computer. As Ellie calls Courtney about the pictures, David gets to Courtney’s place and attacks her. She is found bleeding from the head by Ellie and taken to the hospital. With the police now looking for David, he tries to pull a trick on the public by making them think he committed suicide; he sets a homeless man on fire with a suicide note. The police find all the evidence in his home, including a confession for his ex-wife’s murder.\n Release One night, Ellie gets a message from her assistant  to sign some documents. Ellie stops by her office and finds her assistant murdered on the floor. Ellie rushes home and calls the police, before she finds David alive and knocks him unconscious with a vase. She encounters the corpse of Brittany's boyfriend Scott, and finds Marcus and Brittany tied up. She frees them as the police arrive, but David kills a cop. As Brittany gets into her car and drives away, a fight ensues between Marcus, David, and Ellie, which ends with David falling to his death on a beach cliffside. A few months later, Marcus and Ellie send Brittany back to school, and their house is for sale.\n Reception In October 2019, Deadline reported that Netflix had partnered with Hybrid Films with Peter Sullivan directing the film project. Nia Long, Omar Epps and Stephen Bishop were attached to star in the film, with Sullivan and Rasheeda Garner writing the script. Long, Barry Barnholtz, Brian Nolan and Jeffrey Schenck would serve as producers on the film. In November 2019, it was announced KJ Smith had joined the cast of the film. Principal photography for the film took place on location in Los Angeles, California in 2019.\n References The film was released on July 16, 2020 by Netflix. It was the top-streamed film on the site in its debut weekend, then placed sixth the following weekend.\n External links"
}{
    "id": 81410551,
    "tag": "Psychological Thrillers",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81410551",
    "name": "The Perfumier",
    "genre": "Dramas",
    "maturity": "A ",
    "duration": "1h 36m",
    "synopsis": "To regain her sense of smell and get back her lover, a detective joins forces with a perfume maker who uses deadly methods to create the perfect scent.",
    "related-genre": [
        "Mysteries",
        "Movies Based on Books",
        "Crime Movies",
        "Dramas",
        "Thriller Movies"
    ],
    "plot": ""
}