{
    "id": 81551307,
    "tag": "Telugu-Language Movies",
    "image": "https://occ-0-1492-1722.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABWNnNFfb5EO7c5DBXlsqSyS71JUVa4h2MQqXDT0Ss5l6laOntrgWj8pM1n17hfXQeID0-9ixP2FK6Yrvboy6UGSXScznzOH6gN4.jpg?r=780",
    "source": "https://www.netflix.com/in/title/81551307",
    "name": "Waltair Veerayya",
    "genre": "Telugu-Language Movies",
    "maturity": "A ",
    "duration": "2h 37m",
    "synopsis": "Desperate to nab a wanted criminal on the run, a cop turns to the formidable Waltair Veerayya, a fisherman with a notorious streak, for help.",
    "related-genre": [
        "Action & Adventure"
    ],
    "plot": "\n Plot \n Cast Waltair Veerayya is a 2023 Indian Telugu-language action film directed by Bobby Kolli and produced by Mythri Movie Makers. The film stars Chiranjeevi as the title character alongside Ravi Teja, Shruti Haasan, and Catherine Tresa.\n Production The film was announced in August 2021, principal photography commenced in December 2021 with filming taking place in Hyderabad, Visakhapatnam and Malaysia. The soundtrack is composed by Devi Sri Prasad with cinematography by Arthur A. Wilson. Waltair Veerayya was released on 13 January 2023, and received mixed reviews from critics. The film was successful at the box office becoming the highest grossing Telugu film of 2023.\n Music Waltair Veerayya, a notorious fisherman-cum-smuggler from Vizag, needs money to fight a court case. He is approached by CI Seethapathi, who tells him about Solomon Caesar, a notorious drug lord who escaped from RAW's custody after killing multiple police officers. Seethapathi, who was responsible for Caesor's custody, gets suspended from service. He asks Veerayya to extradite Caesar from Malaysia to India, in exchange for providing money. Veerayya accepts the deal and travels to Malaysia with his friends and Seethapathi's brother-in-law. They check in at a hotel owned by Caesar and devise a plot to kidnap him.\n Release However, Veerayya misses the opportunity as he gets stunned by seeing Dr Nithya and her daughter, Vaishnavi, where Nithya angrily takes the kid away from Veerayya. Seethapathi's brother-in-law gets impatient and prompts Seethapathi to follow Caesar on their own without Veerayya's knowledge, only to get caught by Caesar. Veerayya arrives at the place and tricks Caesar into believing that they want to cut a drug deal with him, therefore saving the day. Later, Veerayya gets invited by Caesar to his private party where a group of masked assassins attempt to nab Caesar, but their plans are foiled by Veerayya, who later realises that they are the hotel staff.\n Theatrical They reveal themselves as RAW agents, led by Athidhi. Caesar expresses his admiration for Veerayya and offers to ask him anything in return for saving his life. Veerayya asks him to come back to India and Caesar agrees, but soon finds out about their ploy and they get busted. As Caesar assaults Athithi for information with his elder brother Michael Solomon on video conference, Veerayya retaliates and reveals that Michael was his ultimate target. Veerayya kills Caeser at the public fair in the Batu Caves, where a helpless Michael witnesses everything.\n Home Media Past: Four years ago, Michael, in disguise as a fisherman named Kaala, acts as Veerayya's friend and confidant. Without Veerayya's knowledge, Michael supplies drugs from the former's ice factory. The newly appointed ACP Vikram Sagar, who is also Veerayya's half-brother, arrives in Vizag and begins a crackdown on the drug syndicate. During their childhood, Veerayya, who suffered from vertigo, accidentally let Sagar fall from a tree. Ever since, the brothers grew up separately. Though Sagar developed hatred towards Veerayya, Veerayya always loved him. Sagar is also happily married to Dr. Nithya and they bear a daughter Vaishnavi.\n Reception Sagar tracks down the origin of drugs in Veerayya's locality, but Michael manages to keep his cover. One day, the ice factory accidentally supplies cocaine, wrapped in ice to a school, which resulted in the deaths of 25 children. Michael subsequently frames Veerayya and plans to escape to Malaysia. Veerayya gets arrested by the police, who decides to kill him in an encounter to calm the public rage. Sagar, who believes that Veerayya is innocent, loots the seized drugs to lure Michael. He secretly arrives at the planned encounter shooting, in place of Veerayya to nab Michael.\n Critical Response However, the JCP, who is also Sagar's senior officer, is in cahoots with Michael, where he fatally stabs him, along with Michael's men. Michael manages to escape as Veerayya arrives, not before he shows his true face to him. Veerayya tries to take a heavily injured Sagar to the hospital, but he succumbed to his injuries on the way, revealing that he always had affection for him, but could not express it publicly due to his crackdown on the drug syndicate. Veerayya is stopped by the police and taken away. Sagar is deprived of state honours and labelled as a traitor by the police. Heartbroken, Veerayya decides on extraditing Michael to India for his testimony in court, before Seethapati shows him the way.\n Box office Present: Veerayya sets up Michael against his drug partner by blowing up his base of operations. The rival gang attempts to kill Michael, where he agrees to come to India with Veerayya and testify in court, in exchange for his life. With the help of Athithi, Veerayya brings Michael back to India. Following Michael's testimony, the court recognises Sagar's valour and grants him state honours, whilst also acquitting Veerayya of his charges. To fulfil Sagar's last wish of avenging the children's deaths, Veerayya severs Michael's head in the courtroom and is sentenced to prison.\n References In August 2021, it was announced that Chiranjeevi and K. S. Ravindra  would team up for a film tentatively titled Mega154  under the production of Mythri Movie Makers. The film was formally launched in November 2021. In April 2022, Chiranjeevi unintentionally revealed the film is titled Waltair Veerayya. The title was officially confirmed in October 2022. Ravindra wrote the story and dialogues, which were scripted by Kona Venkat and K. Chakravarthy Reddy. Arthur A. Wilson was signed on as the cinematographer, marking his third collaboration with Bobby, after Power and Sardaar Gabbar Singh. Niranjan Devaramane was the film's editor. In March 2022, Ravi Teja joined the cast, reuniting with Chiranjeevi after 22 years since Annayya . Teja reportedly plays his brother, a police officer disguised as a mafia don. Shruti Haasan was paired opposite Chiranjeevi, while Catherine Tresa is playing Teja's wife. Nawazuddin Siddiqui was approached to play the antagonist, but due to scheduling conflicts, was replaced by Bobby Simha. Malayalam actor Biju Menon was also offered a role in the film, however, was replaced by Prakash Raj. In the early November 2022, Urvashi Rautela was roped in for doing special appearance in a song. Principal photography commenced in December 2021 in Hyderabad. In April 2022, the second schedule commenced with Haasan joining the sets in Vishakapatnam. In July 2022, the third schedule commenced with Teja joining the sets. A schedule was also held in Malaysia.\n External links"
}{
    "id": 81605071,
    "tag": "Telugu-Language Movies",
    "image": "https://occ-0-1492-1722.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABSt-vzPKdYUdKfce1UkjsDFBBv-phR7VOLZrSU9tbbvIbEvoW0BHCZ6IVFdJj3TTsWrznJV1xPqJHgtgX07OltSH-r56XK3V5-U.jpg?r=e6c",
    "source": "https://www.netflix.com/in/title/81605071",
    "name": "Dhamaka",
    "genre": "Dramas",
    "maturity": "U/A 13+ ",
    "duration": "2h 16m",
    "synopsis": "Two total strangers who happen to look alike — one a street-smart hustler, the other a wealthy corporate heir — compete for the same woman’s love.",
    "related-genre": [
        "Action & Adventure",
        "Dramas"
    ],
    "plot": "\n Plot Dhamaka  is a 2022 Indian Telugu-language action comedy film directed by Trinadha Rao Nakkina and written by  Prasanna Kumar Bezawada. It stars Ravi Teja, Jayaram and Sree Leela. The film is produced by People Media Factory and Abhishek Agarwal Arts.\n Cast Principal photography commenced in October 2021 and ended in September 2022 which took place in Hyderabad and Spain. The film was released on 23 December 2022, during the Christmas weekend. It opened to mixed reviews from critics with the praise of Ravi Teja and Sreeleela's performance, Sreeleela's dance, songs and score; however, the pace and screenplay was criticised. The film grossed over ₹108 crores worldwide, making it the one of the highest-grossing Telugu film of 2022.\n Production Jayan Pakshitap alias J. P., a business magnate and head of \"J. P. Orbit\", is known for taking over companies in a ruthless manner. He sets his sights on Nanda Gopal Chakravarthy's \"People Mart\" and decides to present it as a birthday gift to his son, Atharva Pakshitap. However, J. P. faces problems from Nanda Gopal's son Anand Chakravarthy, who is also the company's upcoming CEO. He decides to overthrow him and acquire the company.\n Music Meanwhile, Swami is a street-smart unemployed man and a doppelganger of Anand, who lives with his family consisting of his father Vasudeva Rao, mother Yashoda, and younger sister Subbu. He tries to find work unsuccessfully and constantly is burdened by Subbu's impending wedding. Pranavi is Subbu's friend, who meets Swami while planning for Subbu's wedding. They get attracted to each other. However, Pranavi's father and Chakravarthy's friend, Ramesh Reddy instead arranges a marriage alliance with Anand. Initially, Pranavi is confused upon seeing Anand; whether to choose Swami over Anand and ultimately rejects the proposal, due to which Ramesh sends goons to kill Swami. \n Release At the same time, Atharva and his goons corner Anand to kill him. Pranavi calls Swami for help but later learns that Anand is actually Swami himself. Swami thrashes both Ramesh and Atharva's goons, but gets knocked out by one of them, and is presumed dead. However, Swami survives and fakes his death. Pranavi asks him about living as dual people. Swami reveals that he met Chakravarthy in his childhood when he and Vasudeva went missing at the local fair, and Chakravarthy tried to locate Swami's parents. However, he instead adopted him as his son. 4 years later, Swami's parents arrived in search of him and Chakravarthy was hesitant to send him back with them. Thus, to keep both families happy, he then assumed dual identities. \n Theatrical Meanwhile, J. P., who is under the impression that Anand is dead, asks Swami to act as Anand and makes the company shares be distributed to J. P. Orbit. A sequence of comedic events ensues, where Swami manages to fool both J. P. and Atharva every time while arranging Subbu's marriage and donating his shares to the employees. However, J. P. discovers Swami's dual identities and tries to kill Chakravarthy, but Swami saves him. He also saves Vasudeva and thrashes both J. P. and Atharva. Swami reveals to Chakravarthy that his nephew, Vikram Chakravarthy, was also behind the attempt on Swami's life, as he became an obstacle for him to become the next CEO. Swami tells Vikram that Chakravarthy wanted him to become the CEO, upon which Vikram realizes his mistake and apologizes to both Swami and his family, reuniting with them. With Vikram becoming the CEO, Swami and Pranavi happily get married, and both families lead normal and happy life.\n Home Media The film's title was revealed in October 2021. Principal photography of the film began on 4 October 2021. The first schedule was completed in November 2021. The makers shot an action sequence in February 2022 in Hyderabad. The makers also shot a song in Spain's Plaza de España in March 2022. The filming was wrapped on 22 September 2022.\n Reception The music of the film is composed by Bheems Ceciroleo. The first single titled \"Jinthaak\" was released on 18 August 2022. The second single titled \"Mass Raja\" was released on 23 September 2022.\n Critical reception Dhamaka was theatrically released on 23 December 2022. The worldwide theatrical rights of the film were sold at a cost of ₹18.30 crore. The Hindi dubbing rights were sold at a cost of ₹10 crore, whereas the satellite and digital streaming rights were sold for ₹20 crore.\n Box office The satellite and digital rights of the film were acquired by Netflix and Star Maa. It was released on 22 January 2023 for streaming.\n References Dhamaka received mixed reviews from critics and audience.\n External links"
}{
    "id": 81641429,
    "tag": "Telugu-Language Movies",
    "image": "https://occ-0-1492-1722.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABW5NqQpF1usFZKJuc5q6jkOMf8lbjMrVMs-Z6xygIIY1QYA1LwPKA1S4oMJJAlrlUT8SMyZEEbPnHqnt_QL6jixBtuZfxfHtAOo.jpg?r=5a4",
    "source": "https://www.netflix.com/in/title/81641429",
    "name": "Butta Bomma",
    "genre": "Dramas",
    "maturity": "U/A 16+ ",
    "duration": "1h 52m",
    "synopsis": "After dialing the wrong number, a young woman befriends a rickshaw driver but their romance takes a sudden turn when a stranger enters the picture.",
    "related-genre": [
        "Dramas",
        "Thriller Movies",
        "Romantic Movies"
    ],
    "plot": "\n Plot Butta Bomma  is a 2023 Indian Telugu-language romantic action thriller film directed by Shouree Chandrashekhar T. Ramesh in his directorial debut and produced by Sithara Entertainments and Fortune Four Cinemas. \n Cast It is a remake of the 2020 Malayalam film, Kappela. It stars Anikha Surendran, Arjun Das and Surya Vashistta and the title is inspired by the song of the same name from Ala Vaikunthapurramuloo .\n Soundtrack Satya  wrong dials Murali ; over a period of time, their frequent conversations lead to the blossoming of love. But when they decide to meet in Vizag, Ramakrishna \"RK\" , enters the scene. What happens next takes the romantic story on a different tangent.\n Reception The music is composed by Gopi Sundar and Sweekar Agasthi while the latter did the film score.The audio rights were acquired by Aditya Music.The first single \" Vinodamlo Kathemundo\" was released on 9 January 2023.The second single \"Ammadi Gummadi\" was released on 2 February 2023.The full album was released by Aditya Music on 10 February 2023.\n References"
}{
    "id": 81346056,
    "tag": "Telugu-Language Movies",
    "image": "https://occ-0-1492-1722.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABS5KFywBCVcnyyqtcoP3xGPAM_59QCj3VJvumm3FEWTyFAmBDm8wRXn2iWsTpXSQSKV7hg0vHa4emCjEwBWlDpP4beIzp0Po4IU.jpg?r=79a",
    "source": "https://www.netflix.com/in/title/81346056",
    "name": "Ante Sundaraniki",
    "genre": "Telugu-Language Movies",
    "maturity": "U/A 13+ ",
    "duration": "2h 53m",
    "synopsis": "When sparks fly between childhood friends Sundar and Leela, they hatch a plan to persuade their conservative families to accept an interfaith romance.",
    "related-genre": [
        "Romantic Comedies",
        "Comedies",
        "Romantic Movies"
    ],
    "plot": "\n Plot Ante Sundaraniki!  is a 2022 Indian Telugu-language romantic comedy film written and directed by Vivek Athreya. Produced by Mythri Movie Makers, it stars Nani and Nazriya Nazim . The film tells the story of Sundar and Leela, an interfaith couple who try to convince their parents about their marriage through a string of lies only to find themselves in more complicated situations. \n Cast Ante Sundaraniki! was announced in November 2020 with principal photography taking place between April 2021 and January 2022. The film was predominantly shot in Hyderabad and the United States. Ante Sundaraniki! was released in theatres on 10 June 2022 and opened to positive reviews from critics. The film failed at the domestic box-office, tough it fared well in the overseas market. It grossed over $1 million overseas, making it Nani's seventh film to do so. The film grossed over ₹38 crore worldwide.\n Production Sundar comes from an orthodox Brahmin family. During his childhood, Sundar is duped by a fraudster who promises him a role in an upcoming film starring Chiranjeevi that would be filmed in the US. Therefore, his family develops deep skepticism towards such ventures. Sundar grows up to be an employee at an ad agency. He tries to persuade his colleague Soumya to give up the opportunity to go to the US so that he can take her place and fulfill his dream. But on Soumya's insistence, he tells her the actual reason. Sundar is in love with his childhood sweetheart Leela, a Christian who is now a professional photographer. She gets close to Sundar when her ex-boyfriend Vamsi cheats on her. Sundar and Leela decide to marry but since they belong to different religions, Sundar sketches a plan to convince their parents. As a part of it, they lie to their families about the reason they are leaving for the US. Soumya is convinced and lets Sundar take her place by lying to their manager.\n Development A month after arriving in the US, Sundar lies to his parents that he has Azoospermia but Leela is ready to marry him despite this while Leela lies to her parents that she is pregnant with Sundar's child. They return to India immediately on their parents' demand but Sundar and Leela's bags are exchanged. Sundar's father gathers their relatives to tell them about Sundar's impotency but they come across Leela's bag which raises suspicion. Leela's parents also recognize that her boyfriend is Hindu by looking at a Hanuman sticker on Sundar's bag. They force her to take a pregnancy test which Leela fudges to be positive using a bottle of Mountain Dew.\n Filming Sundar's father takes him to several doctors for treatment, all of whom rebuke him after listening to his deception, until they meet Dr. Guru, Sundar's childhood friend. Guru lies that it may take 10–15 years to treat Sundar. Meanwhile, Leela's parents arrange her marriage with Joseph, a family friend, who accepts Leela's pregnancy. Sundar tries to talk Joseph out of it but in vain. Intimidated by Joseph, Sundar reveals that Leela being pregnant is a lie. Joseph informs the same to Leela's parents. He asks Leela to tell the truth by swearing on The Bible but Leela's father calls off her wedding as he doesn't want an outsider to suspect his daughter. With no option left, both their families reluctantly accept Leela and Sundar's marriage while both remain unaware of the other family's reason to do so. During their meeting, the parents come very close to discovering the contradicting stories, but Sundar's parents help in treating the pregnancy cramps of Leela's sister Pushpa, thus bringing their families closer.\n Music Sometime later, Joseph reveals to Leela's mother that it was Sundar who told him that Leela isn't pregnant. She takes Leela to the hospital and gets her pregnancy checked, and to Leela's surprise, the result turns out to be positive. Sundar and Leela are confused about the result as they have not consummated their relationship. They go for another check-up for second opinion. The doctor tells that Leela has dysgerminoma, a type of ovarian cancer which often results in false positives for pregnancy test. The tumour has to be surgically removed from her ovaries following which Leela might not bear children. Sundar confesses to Leela's father that they lied about her pregnancy all along.\n Background score Sundar's father and grandmother now want to call off the marriage citing Leela's issue. However, Sundar's mother exposes their hypocrisy as they were ready to marry off Sundar despite his perceived impotency. She feels that Sundar's happiness is more important than their traditions and having children. Sundar's grandmother approves of the marriage by playing the Veena which she gave up post Sundar's childhood fiasco. Delighted, Sundar runs to meet Leela who has undergone the surgery and they decide to get married.\n Release They reach Amelia Island for the wedding to fulfill Leela's wish. Sundar confesses that the anonymous postcard which Leela received in her childhood was sent by him while Leela reveals that she knows it was Sundar who sent the postcard and admits that her dream to have her wedding on Amelia Island was just a made-up story.\n Theatrical The film was launched under the tentative title Nani#28. On 21 November 2020, the film's official title was revealed to be Ante Sundaraniki. The film marks the debut of actress Nazriya Nazim in Telugu cinema.\n Home media Principal photography of the film began on 16 April 2021. Filming wrapped up on 23 January 2022.\n Reception \nThe film score and soundtrack album of the film is composed by Vivek Sagar. The music rights were acquired by Saregama. Critical reception The film released theatrically on 10 June 2022. It was announced in January 2022 that the film was going to be released in the summer of 2022. In February 2022, the makers announced that they would release the film in any of seven dates starting from 22 April 2022 to 10 June 2022. In the same month, the makers announced the film's release date as 10 June 2022. Apart from the original version, the film was also dubbed in Tamil under the title Adade Sundara and in Malayalam under the title Aha Sundara.\n Box office The film's theatrical rights were sold at ₹30 crore.\n Notes The digital streaming rights of the film is owned by Netflix. The film was streamed on Netflix on 8 July 2022 in Telugu and dubbed versions of Tamil and Malayalam languages.\n References Ante Sundaraniki received positive reviews from critics. Manoj Kumar R of The Indian Express rated the film 4 out of 5 stars and wrote \"Nani effortlessly fits into the role of a rebellious man, who comes up with masterful lies as easy as he breathes. Nazriya Fahadh's screen presence adds a lot to the appeal of the movie\". Siby Jeyya of India Herald rated the film 4 out of 5 stars and wrote \"Director Vivek took a story of interfaith marriage, adding comedy rooted in mindlessly following religious customs, and drama rooted in striving to achieve a balance between family and love\". Critic Latha Srinivasan wrote in Firstpost that Nani and Nazriya shone in this romantic comedy cum family drama and gave it 3 stars on 5. She wrote, \"The director has packed a lot of depth into the film.\"\nNeeshita Nyayapati of The Times of India rated the film 3.5 out of 5 stars and wrote \"Ante Sundaraniki is at its best when the stellar cast are mouthing off one-liners that are not just relatable but hilarious. Nani shines in the role of Sundar that's right down his alley while Nazriya fits right into the skin of Leela\". A critic for Sakshi Post rated the film 3 out of 5 stars and wrote \"Ante Sundarainki is an out and out family entertainer and tailor-made film for Nani fans\".\n External links"
}{
    "id": 81177374,
    "tag": "Telugu-Language Movies",
    "image": "https://occ-0-1492-1722.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABTg5c1JKuEVIot72E6rcYRXDHoDcgtcdv8rxmS-smcxtU9gvGiZFYmLj5W6Idsgg2yXV4dNycnw7NRZvlsOnvPa_s3XPr_o3C0Y.jpg?r=5ec",
    "source": "https://www.netflix.com/in/title/81177374",
    "name": "F3: Fun and Frustration",
    "genre": "Telugu-Language Movies",
    "maturity": "U/A 16+ ",
    "duration": "2h 21m",
    "synopsis": "An unlikely group of money-hungry scammers are thrust into a farcical roller coaster of events when a wealthy industrialist enters their lives.",
    "related-genre": [
        "Comedies"
    ],
    "plot": "\n Plot F3: Fun and Frustration is a 2022 Indian Telugu-language comedy film written and directed by Anil Ravipudi and produced by Dil Raju and Sirish under the banner Sri Venkateswara Creations. It is a standalone sequel to F2: Fun and Frustration  and the second installment of Fun and Frustration series. The film stars Venkatesh, Varun Tej, Tamannaah and Mehreen Pirzada reprising their roles from the prequel. Devi Sri Prasad composed the music.\n Cast Principal photography commenced in December 2020 and ended in January 2022; filming took place in Hyderabad. The film was released on 27 May 2022. A critical and commercial success, F3 has grossed a total of ₹1.35 billion  in worldwide markets.\n Production Venky, who works as an agent at a RTO in Hyderabad, struggles to meet his ends and suffers from night blindness, but hides his disability from everyone. His friend Varun Yadav, an orphan, stutter plans various schemes to make money, but to no avail. Venky, along with his friend, loses a lot of their money after investing in Harika's family restaurant. In a search for money, Varun mistakes Honey  for a rich woman and plans to marry her. Venky agrees to fund Varun's plan, failing to recognize Honey due to his disability. Venky and Varun take a huge amount of loan from Pala Baby, a local landlord by pledging their property. After spending lakhs of rupees by giving expensive gifts and cash to Honey, they realize their mistake while Harika's family loses all their money in shares.\n Development Pala Baby, who worships women, drops his plans to waive off the loan after realizing the guile methods of Harika's family. They all reach the police station to settle their issue, where CI Nagaraju, an honest policeman who is on the brink of losing his job, hatches a plan to raid commissioner Dileep Chandra's house with them to steal the illegally acquired cash and diamonds. They successfully execute their plan and hide the valuables in the boot of a scrap car. While doing so, they also rescue a kidnapped girl. The following morning, they confess their robbery to  Dileep out of fear. However, the car goes missing and Dileep threatens their life if they fail to return the stolen amount. When Venky, Varun, Harika, and Nagaraju are about to commit suicide, they receive news that billionaire Anand Sharma was looking for his prodigal son. \n Cast and crew They decide to go to his place and claim themselves as his son to steal his wealth. However, they almost die because of their plans of committing suicide. Thankfully, they get saved by rare occasions. They all reach his place in Vizianagaram. Venky, Varun, Harika , and a junior artist hired by Nagaraju present themselves as Anand's son. Unsure of who the right person is, Anand lets everyone stay in his palace. They scheme against each other and utterly fail to impress Anand. All the contenders endure the toughest of the tests given by Anand. As a final effort, Anand announces that whoever brings his F3 toy factory to profits shall be declared as his heir. Putting their differences aside, all the contenders team up together to create a new kind of toy to achieve profit. They develop a set of interactive toys by merchandising Telugu film characters, namely, Amarendra Baahubali, Gabbar Singh, Ajay Krishna, Veera Raghava, Chitti Babu and Bantu. \n Filming The sales skyrocket and the factory earns a bumper profit. They together elect Varun and present him to Anand as his rightful heir. However, Anand reveals that his son died by suicide several years ago after earning money by fraudulent means. Since they have rescued his granddaughter, Anand allowed them to prove themselves and offers them the profit that they earned. Venky and Varun realize their mistakes and give up the money. Later, Anand is kidnapped by his subordinates who demand a ransom of ₹100 crore . Venky, Varun, and others arrive at the place but they are attacked by the goons. Initially, they try to confuse them but when the plan fails, Venky dresses up as Narappa and Varun as Vakeel Saab, and thrash the goons together. When they are trying to leave, the police arrive and arrest everyone.\n Music Meanwhile, the thief who stole the car reveals to Dileep that he sold all the diamonds at a cheap rate mistaking them for regular gemstones, and later gets elected as an MLA with the support of his buyers, and Dileep, who is ousted out of his job joins him as an assistant.\n Release Following the success of F2: Fun and Frustration , studio owner Dil Raju announced its sequel in February 2019. He added that a third lead actor will be cast for the sequel. However, in April 2020, director Ravipudi clarified that there was little space for a third protagonist. In an interview in March 2021, Ravipudi said: \"F3 is not a  sequel to F2. It is completely a new story where the leads are seen getting frustrated caused by money.\"\n Theatrical Venkatesh, Tej, Prasad, Tamannaah and Pirzada are reprising their roles in the sequel. Devi Sri Prasad, who scored the music for F2, is retained as the music composer. Sunil and Murali Sharma signed to play a key roles in the film. In April 2021, it was reported that Anjali was cast in the film, though there is no official communication yet. Rajendra Prasad was also set to return with a different role. Venkatesh plays a night blind while Tej's character would be suffering from stuttering. Sonal Chauhan confirmed that her appearance in the film in October 2021, describing her role as a \"surprise\". In April 2022, Pooja Hegde was signed on for a special song.\n Home media F3  was formally launched on 6 December 2020. Principal photography of the film began on 26 December 2020 in Hyderabad. Varun Tej has joined the production in January 2021. Due to COVID-19 pandemic in India, filming was paused from April to June. Filming was planned to be resumed in July 2021 with 10-day long schedule. However, the filming resumed in September 2021. In December 2021, filming took place at Charminar and nearly 85% of the shoot is completed. The talkie portions were wrapped in January 2022 with only a song left to shoot. A special song featuring Hegde was filmed in April 2022 at a specially constructed set at the Annapurna Studios.\n Reception The soundtrack and score of the film is composed by Devi Sri Prasad. The audio rights were acquired by Aditya Music. First single \"Lab Dab Dabboo\" was released in February 2021. The second single \"Woo Aaa Aha Aha\" was released on 22 April 2022.\n Critical response On 17 May 2022, the third single track \"Life Ante Itta Vundaala\" was launched, which had vocals by Geetha Madhuri and Rahul Sipligunj. The song featuring Pooja Hegde received positive response.\n Box office F3 was released on 27 May 2022. Earlier, it was scheduled to be released on 27 August 2021, but was deferred due to the COVID-19 pandemic. It was later scheduled to release theatrically on 25 February 2022, but was postponed to avoid clash with Bheemla Nayak which released on that date. Its release date was scheduled as 28 April 2022 but it was again delayed and moved to the current date to avoid clash with Acharya.\n References The film's pre-release theatrical business stood at ₹72 crore, and needs a worldwide gross over ₹130 crore in order to be a profitable venture.\n External links"
}{
    "id": 81643832,
    "tag": "Telugu-Language Movies",
    "image": "https://occ-0-1492-1722.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABXM3Uot249b5gvZwRSg9fYhsv_CnjCjb65hVV0O3ZhZq5-C_q3Y2egdvy64NppUmcd-wbQlO6TsReofPMIu52cHPcPgQKBpz-2o.jpg?r=939",
    "source": "https://www.netflix.com/in/title/81643832",
    "name": "Satya 2",
    "genre": "Dramas",
    "maturity": "U/A 16+ ",
    "duration": "2h 5m",
    "synopsis": "An ambitious outsider rapidly climbs the ranks of the underworld, turning a disorganized network of mobsters into a national crime syndicate.",
    "related-genre": [
        "Crime Movies",
        "Dramas",
        "Thriller Movies"
    ],
    "plot": "\n Plot Satya 2  is a 2013 Indian crime film directed by Ram Gopal Varma. Shot simultaneously in Hindi and Telugu languages, the film stars Puneet Singh Ratn , Sharwanand , Anaika Soti and Mahesh Thakur. The film tells the story of Satya, an immigrant who comes to Mumbai aiming to refashion the mumbai underworld. The film is the fourth installment of the Gangster series.\n Cast The storyline of Satya 2 is narrated by a voice about the underworld whose activities have slowed down from the last decade in Mumbai . The story is based on Satya who comes to Mumbai and starts working for Lahoti, a construction magnate. In trying to beat a competitor in a deal, he gets involved with the mafia and other underworld elements who don't have the clout anymore. Later, he kills RK who is the retired mafia leader and his son since his son wanted to kill Satya due to a feud between them. During this time, he gets his friend production money for a film and gets a flat and brings his girlfriend Chitra to live there. He makes enemies all around and in a shootout with cops, loses his girlfriend and also his friend. But, even though he is captured, he is able to get out of jail through the company he creates with his connections and begins his reign as the newest underworld leader in Mumbai/Hyderabad.\n Telugu version \"As a film maker I have been doing a deep study of the underworld and its gangsters for more than two decades primarily for the purposes of gathering subject matters for my films and to get inspired for characters from real life references..And that's how films like Satya and company happened... Then one day it occurred to me what if a guy out there studied the same gangsters not for becoming a film maker but for the purpose of becoming a gangster himself.it's that idea of mine which finally shaped itself into Satya 2. A new age gangster will obviously be armed with the mistakes of the earlier gangsters and also with the modern day policing methods\". said Ram Gopal Varma. One romantic song of Satya 2 was shot in Kashmir in June 2013. The Central Board of Film Certification  passed Satya 2 with A certificate with 3 cuts. Satya 2 is made within the budget of Rs 15 crore.\n Production The film was promoted as a trilingual and was to mark the Tamil-language directorial debut of Varma. However, the Telugu version was partially reshot in Tamil as Naanthaanda.\n Soundtrack The background score of the film has been composed by Shakthikanth Karthick. The soundtrack of the film consisted of nine tracks composed by Nitin Raikwar, Sanjeev–Darshan, Kary Arora and Shree D and lyrics by Moied Elhaam, Nitin Raikwar, Kumaar, Sonny Ravan and Shree D on 15 October 2013.\n Release and reception Director Ram Gopal Verma hinted that Satya 2 will be his last film on the underworld and that now he wants to make romantic movies. Satya 2 was released on 2 8 October 2013 in U. A. E. and 8 November 2013 in India.\n Box office The film received mixed reviews, Subhash K. Jha of Bollywood News stated that Ram Gopal Varma returns to form with Satya 2.\nSamreen Tungekar of Bolly spice has stated \"Ram Gopal Verma had made it clear that Satya 2 is not a sequel to Satya, and he has evidently made no attempt of making this film look like a prequel or a sequel too. Satya 2 stands as an independent story and does well for itself as a film.\" Taran Adarsh of Bollywood Hungama gave it 3 out of 5 stars and stated that Satya 2 has the right elements that make a quintessential gangster film. Madhureeta Mukherjee of Times of India gave it 2 out of 5 stars.\n References The Telugu version released to negative reviews with Sangeetha of The Hindu advising to \"skip this and watch the original Satya.\"\n External links"
}{
    "id": 81177444,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81177444",
    "name": "Aaviri",
    "genre": "Horror Movies",
    "maturity": "U/A 13+ ",
    "duration": "1h 49m",
    "synopsis": "After losing their first child in an accident, a couple moves to a palatial home, where their young daughter comes under the spell of an eerie spirit.",
    "related-genre": [
        "Thriller Movies",
        "Horror Movies"
    ],
    "plot": "\n Plot Aaviri  is a 2019 Indian Telugu-language horror thriller film written, directed, and produced by Ravi Babu. The film features Neha Chauhan, Ravi Babu, Sri Muktha, Bharani Shankar, and Mukhtar Khan in principal roles. Aaviri was released on 1  November 2019.\n Cast Raj  and his wife Leena  move into an old palatial house along with their younger daughter Munni , after an accidental death of their elder daughter Shreya. Munni happens to see the ghost of her elder sister who had died due to their father's unattentiveness. The ghost tries to drive Munni away from the house and eventually succeeds. What happens next forms the rest of the story.\n Reviews The movie generally received negative reviews with critics labelling it dull, predictable and outdated.\n References \n External links"
}{
    "id": 81273583,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81273583",
    "name": "Bheeshma",
    "genre": "Telugu-Language Movies",
    "maturity": "U/A 16+ ",
    "duration": "2h 18m",
    "synopsis": "Tired of being single, a smart-aleck meme creator has a chance to prove himself to the girl he loves when he is suddenly appointed CEO of her workplace.",
    "related-genre": [
        "Romantic Comedies",
        "Action & Adventure",
        "Comedies",
        "Romantic Movies"
    ],
    "plot": "\n Plot Bheeshma is a 2020 Indian Telugu-language romantic comedy film written and directed by Venky Kudumula. The film stars Nithiin and Rashmika Mandanna while Anant Nag, Jisshu Sengupta, Vennela Kishore, and Sampath Raj play supporting roles. It is produced by Suryadevara Naga Vamsi under Sithara Entertainments. The music is composed by Mahati Swara Sagar. Upon Release, on 21 February 2020, the film received positive reviews and became a commercial success.\n Cast Bheeshma is the CEO of \"Bheeshma Organics\", who wants farmers to shift from using chemicals in farming to organic practices and he gets them successfully to shift. Bheeshma then announces to the media that he will announce the next CEO on the company's 50th anniversary.\n Production Meanwhile, Bheeshma Prasad, a single man seeks to find love always, where he attends his friend Parimal's boss's pre-wedding party where he sees Sarah. He introduces himself as Bheeshma I.A.S.  and he gets her to elope with her. She then realizes that he does not have money and she gets him stuck with the police which gets Parimal fired. His uncle, JP, has to bail him out by calling his classmate ACP Deva. Deva asks JP to bring Bheeshma to him to teach him a lesson as he believes Bheeshma is a \"loser\" since he lives his life as a meme creator. JP then tells Bheeshma's father, Anand Prasad, that Bheeshma is serving a punishment with Deva and the flashback is that Anand and Deva were classmates and Bheeshma touched his daughter when they were little causing a split between both of them. \n Release Bheeshma starts off by cleaning and serving tea to the officers. One day, Bheeshma is driving and after he drops off Deva, on the way back he sees that Chaitra needs assistance as her vehicle got into a crash. He introduces to her as ACP Bheeshma as he is in a police vehicle and she introduces herself as an employee of Bheeshma Organics. He decides to go with her and he ends up learning about organic farming. Raghavan, the CEO of Field Science, introduces a product called \"Instant\" which produces a six-month yield in four months by the use of chemicals and tries to influence some of Bheeshma's farmers by setting up a live interaction with Bheeshma. After a few hilarious twists and turns, Bheeshma finds out that Chaitra is the daughter of Deva. Deva soon develops a good opinion about Bheeshma but Chaitra does not like him. Bheeshma works for Deva as a driver and takes Chaitra to places where she wants to go. \n Home media Chaitra and Bheeshma go to the interaction and he finds his friend Parimal there and that he works for Field Science. Bheeshma talks about how great organic farming is during the interaction and wins over Chaitra. Suddenly, Deva's constable sends a picture of them hugging and Deva is angry. He goes to Bheeshma's house and is shocked to see Anand as his father. He takes out his gun and decides to shoot Bheeshma saying he is a loser when Anand reveals that Bheeshma is the grandson of Sr. Bheeshma and he is the next CEO of Bheeshma Organics. Deva and Bheeshma are shocked and the media learns about this. When Bheeshma is ready to leave to take care of his grandfather, it is revealed that Anand lied to Deva to try to keep his son alive. Bheeshma is shocked and in the meanwhile, Chaitra calls him saying that her father wants her to marry him since he is the grandson of Sr. Bheeshma and says that he is a liar and that he manipulated her and how she knows that he is not Bheeshma's grandson. \n Soundtrack Bheeshma decides to tell Deva the truth but to his surprise Sr. Bheeshma announces him as an operational CEO of the company for 30 days. Bheeshma is shocked by this decision and Chaitra despises him even more. He also found out that Parimal lost his job at Field Science due to Raghavan learning that Parimal is Bheeshma's friend and he joins as a driver for Bheeshma. Bheeshma is then shown around the office and he quickly wins over the employees. He also saves a village from signing from Field Science enraging Raghavan and also rewins Chaitra's love. Raghavan decides to make sure Bheeshma is not the next CEO by giving a poisonous hybrid plant to Sr. Bheeshma which then hospitalizes him and to become India's #1 agricultural company and also plants chemically made plants in Bheeshma's warehouse to further make the company lose reputation with a police raid. \n Reception Raghavan invites Agricultural Minister Ajay Varma, to launch Instant to the world but to his surprise, Ajay says that the product is made of harmful chemicals and cancels the license of Field Science which confines Raghavan to the hospital. He soon finds out that Sr. Bheeshma is alive and he was only hospitalized due to a high fever. The plant which Raghavan sent was destroyed by Parimal, thinking that the plant was for Jr. Bheeshma when it was actually for Sr. Bheeshma. Jr. Bheeshma then just suggests Parimal to replace the plant with a similar looking plant without the poisonous properties. Bheeshma also reveals that he found Sarah and Ajay in a hotel room and had blackmailed to telecast their relationship to the public in exchange for Ajay to provide a speech about how the chemicals are bad and the police found out about him planting the plants. Bheeshma is then appointed as the full-time CEO of Bheeshma Organics where Chaitra and Bheeshma finally marry.\n Critical response The film was announced on 30 March 2019, by Rashmika Mandanna through social media platforms, coinciding with Nithiin's birthday. The pooja ceremony and the principal photography was done in mid May 2019. Filming was lasted until late December 2019. Kannada actor Anant Nag was signed to play a pivotal role while, Bengali actor Jisshu Sengupta was signed to portray the antagonist. The song \"Hey Choosa\" was shot in Positano, Italy.\n Box office The film initially aimed at 25 December 2019, but was released on 21 February 2020.\n Accolades The film was released on Netflix and Sun NXT  on 9 April 2020 with English Subtitles. The Hindi dubbed version was directly premiered on Dhinchaak TV channel  on 19 February 2022.\n Notes The music was composed by Mahati Swara Sagar.\n References The film opened to positive reviews from critics on the first day of its release with praise for its performances, comedy, songs and dance numbers.\n External links"
}{
    "id": 81512220,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81512220",
    "name": "Urvasivo Rakshasivo",
    "genre": "Dramas",
    "maturity": "U/A 16+ ",
    "duration": "2h 21m",
    "synopsis": "Forced to hide his steamy affair with a coworker, hopeless romantic Sri is heartbroken when his lover isn't interested in a real relationship.",
    "related-genre": [
        "Romantic Comedies",
        "Comedies",
        "Dramas",
        "Romantic Movies"
    ],
    "plot": "\n Plot Urvasivo Rakshasivo  is a 2022 Indian Telugu-language romantic comedy film written and directed by Rakesh Sashii and produced by GA2 Pictures and Shri Tirumala Production. A remake of the 2018 Tamil language film Pyaar Prema Kaadhal, the film stars Allu Sirish, Anu Emmanuel, and Vennela Kishore. The music was composed by Achu Rajamani and Anup Rubens, with cinematography was handled by Tanveer Mir and editing by Karthika Srinivas respectively.\n Cast The film was released theatrically on 4 November 2022.\n Production Sree Kumar  is a middle-class IT employee with a conservative upbringing. He shares a close bond with his parents, especially his mother, who has a heart condition. His parents want to see him married and actively seek a bride. Sree Kumar is in love with Sindhuja , his colleague who is broad-minded. While Sree Kumar pursues her for marriage, she has her eyes set on achieving her dream and prefers a live-in relationship. If they ever reach a common ground in this conflict of ideologies forms the rest of the story.\n Music Speaking with Hanuma Kiran of 123Telugu, Rakesh Sashii has said that the original idea of the film was pitched by producer Allu Aravind, which he later developed further.\n Release The music is composed by Achu Rajamani and Anup Rubens while the latter did the film score.The audio rights were acquired by Aditya Music.\n Reception Initially, the film was titled Prema Kadanta but was changed to Urvasivo Rakshasivo for undisclosed reasons. The film was released in theatres on 4 November 2022. The teaser of the film was released on 29 September 2022. News18 Telugu reported that the film was released in more than 400 movie theaters worldwide. The worldwide theatrical rights were sold for ₹7 crores.\n References 123Telugu rated the film 3.25 out of 5 and wrote: \"Urvashivo Rakshasivo is an urban romantic comedy which is packaged quite cleverly. Solid comedy, romance, and light hearted family drama are the major assets\". Paul Nicodemus of The Times of India rated the film 3 out of 5 stars and called it a \"wholesome light hearted entertainer\" which has equal amounts of \"humour, romance and emotion\", also praised the performances and visually pleasing production values. Arvind V of Pinkvilla gave a rating of 3 out of 5 and praised the work by Sashii and further stated that \"Allu Sirish has had a sputtering phase and it seems the film under review is going to give his career the much-needed boost\". Balakrishna Ganeshan of The News Minute rated the film 2.5 out of 5 stars and wrote \"Urvasivo Rakshasivo is one of those rare films where the female character is portrayed as bold and given equal importance\".\n External links"
}{
    "id": 81512222,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81512222",
    "name": "18 Pages",
    "genre": "Dramas",
    "maturity": "U/A 13+ ",
    "duration": "2h 17m",
    "synopsis": "When a heartbroken Siddhu stumbles upon a two-year-old diary, he finds himself drawn into the enigmatic world of a young woman named Nandini.",
    "related-genre": [
        "Dramas",
        "Romantic Movies"
    ],
    "plot": "\n Plot 18 Pages is a 2022 Indian Telugu-language romantic thriller film written by Sukumar and directed by Palnati Surya Pratap. Produced by GA2 Pictures and Sukumar Writings, the film stars Nikhil Siddharth and Anupama Parameswaran. It received mixed to positive reviews from critics and the general public.\n Cast Siddu's girlfriend cheats on him with another guy which leads him into a depressed state to which he finds a book on the road where he collapses. As he decides to burn all of his memories with his ex-girlfriend, He discovers the book he found on the road and begins to read it. \n Production The book happens to be a diary that belonged to Nandini. Nandini is a strange woman who doesn't use a Mobile Phone, and believes in human interaction. Siddu connects with the diary and develops feelings for the woman. Nandini visited Hyderabad to deliver a letter from her grandfather to a man named Venkat Rao. Through her journey of contacting him, she was attacked by anonymous people and was in deep trouble.\n Music After 18 pages of reading, the diary happened to be empty and at first, he thought she stopped journalling since her task was completed. When he goes to meet her at her hometown, Siddu discovers a shocking revelation from Nandini's grandmother that both Nandini and her friend Sanjana died in a car accident a year prior.\n References Siddu couldn't digest the fact that the woman he loved had died. Through the advice from his grandfather, he decides to complete her unattended tasks to make himself and everyone around feel that Nandini is alive. As he completes those tasks, he gets to know that Nandini may still be alive through a bus conductor who happened to see Nandini in the ICU 2 days after she was believed to be dead. \n External links"
}{
    "id": 81052275,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81052275",
    "name": "Ee Nagaraniki Emaindi",
    "genre": "Independent Movies",
    "maturity": "U/A 16+ ",
    "duration": "2h 13m",
    "synopsis": "In Goa and in desperate need of cash, four childhood friends get another shot at making their long-abandoned dreams of becoming filmmakers come true.",
    "related-genre": [
        "Comedies",
        "Independent Movies"
    ],
    "plot": "\n Plot Ee Nagaraniki Emaindi  is a 2018 Indian Telugu-language buddy comedy drama film written and directed by Tharun Bhascker, and produced by D. Suresh Babu under Suresh Productions. The film stars Vishwak Sen, Sai Sushanth Reddy, Abhinav Gomatam, Venkatesh Kakumanu, Anisha Ambrose, Simran Choudhary, and Galusheya Daria. The music was composed by Vivek Sagar with cinematography by Niketh Bommireddy and editing by Ravi Teja Girijala. The film released on 29 June 2018. It received positive reviews for its humour, performances, writing and dialogues.\n Cast Vivek, Karthik, Kaushik, and Uppi are childhood friends who dream of a career in filmmaking during their college days. But they eventually give up their plans and settle in other jobs. Vivek resigns his job and lives in isolation, still unable to get over his breakup with Shilpa; Karthik works as a manager in a club and plans on marrying his boss's daughter and settling in the US; Kaushik works as a dubbing artist and wants to become an actor; and Uppi works as a wedding editor. Karthik arranges a bachelor's party for four of them, where they run into Shirley, who joins them to conduct a casual promotional contest in which they narrate her their old friendship, their first short film work and Vivek's love story. Shirley invites them to an event in Goa and leaves.\n Soundtrack After a mishap at the party, they all end up in Goa. There they run into Shirley and her friend Dasha, who offer them a place to stay. Karthik loses the engagement ring given by his boss and needs ₹5 lakhs to buy a similar one. So they decide to participate in the Goa short film festival for the prize money. Vivek does not agree to make a romantic comedy film due to his past love failure with Shilpa, but he later agrees as they do not have an alternative. Karthik handles the cinematography, Uppi edits the film, and Kaushik and Dasha act in it.  Unfortunately, Vivek could not get out of his past and gives a sad ending to the film. He later gives up on the project as he fears the negative feedback. At this time, when Vivek drank and slept, the remaining three wanted to change the sad ending, but they were caught by patrolling police and end up in a police station.\n Release The next day while editing the film, Vivek wakes up, gets angry at them for changing his ending and yells at Karthik, who is in an online engagement. He reveals that they actually came to Goa because the drunken Karthik requested him. Karthik realizes that he is losing everything else for the social status, calls off his marriage and reconciles his friendship with Vivek. Kaushik gets the confidence to act in films, and Uppi becomes an editor. Vivek finally gets over his breakup, reflects his feelings on Shirley and becomes a cool person without anger issues. After working on a few short films, they start their first feature film, Pelli Choopulu.\n Box office This film has five songs composed by Vivek Sagar and was released By Aditya Music.\n Critical reception Ee Nagaraniki Emaindi was released worldwide on 28 June 2018.\n References The film has collected $98,136 from the premiere shows in USA held on Thursday night. On Day 1 on Friday, the film has collected $81,127.The total US box office collection was $179,263.\n External links"
}{
    "id": 81597036,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81597036",
    "name": "GodFather",
    "genre": "Dramas",
    "maturity": "U/A 13+ ",
    "duration": "2h 36m",
    "synopsis": "A political leader’s death leads to a power struggle. Amid corruption, greed and deceit, an unlikely opponent steps up.",
    "related-genre": [
        "Crime Movies",
        "Action & Adventure",
        "Dramas"
    ],
    "plot": "\n Plot Godfather  is a 2022 Indian Telugu-language political action thriller film directed by Mohan Raja. It is a remake of the 2019 Malayalam film Lucifer. The film stars Chiranjeevi in lead role alongside Nayanthara, Salman Khan and Satya Dev. It is produced by R. B. Choudary and N. V. Prasad on Konidela Production Company and Super Good Films' banners. In the film, the supreme leader of the ruling party dies, leaving a huge vacuum, not only in the electoral and leadership sphere of the party but also that of the state. In the inevitable succession squabble the thin line that separates good and bad becomes irrecoverably blurred. Who will succeed him forms the plot.\n Cast Principal photography commenced in August 2021 with filming taking place in Hyderabad, Ooty and Mumbai. The music is composed by Thaman S with cinematography handled by Nirav Shah. Godfather was released theatrically on 5 October 2022 and opened to positive reviews from critics. With gross of over ₹108 Crores against a budget of ₹100 crores, it failed at the box office, becoming the third consecutive box office failure of Chiranjeevi's career after Sye Raa Narasimha Reddy and Acharya.\n Production At Interpol's office in France, an officer is handing over his case about Abraham Qureshi who is a mysterious smuggler kingpin and godfather to his junior, stating that it was his only unsolvable case.\n Development Meanwhile, in Andhra Pradesh, CM Padmakant Reddy alias \"PKR\", the leader of the ruling party Jan Jagruti Party , dies in the hospital while getting treated. Taking advantage of the situation and believing that it would benefit the upcoming election, acting CM Narayana Varma sends party workers to riot outside the hospital. Govardhan, a truth-seeker, records a YouTube live stream and condemns those who praise PKR, claiming that he was a puppet, during his final years in the hands of a financial syndicate, which controls the entire Indian political system. He claims that the JJP party has twice the amount of money than the entire state's treasury, and the person who replaces PKR is crucial. He lists four possible candidates during the live stream: Sathyapriya, Jaidev Das, Varma, and Brahma Teja.\n Casting Sathya is PKR's daughter married to Jaidev, a notorious and discreet drug dealer, who mainly deals with real estate and Hawala scams. He is also in contact with drug lords in Mumbai, all unknown to Sathya. Varma declares himself as the most likely successor to PKR due to his seniority in the party and particularly for his lobbying skills. Brahma, meanwhile, is PKR's first child but was kept a secret from the world, as PKR did not want the public to know that he had a son with his first wife. Govardhan describes him as the \"most dangerous\" person from the list and addresses him as Godfather. Brahma's past is unknown but is now known for his contract work for corporations in Chennai, all known from Govardhan's research. Meanwhile, in Mumbai, Jaidev and Varma meet the former's partner, Abdul, and tell him that PKR had given him an ultimatum, a month ago, to stop his immoral activities. With PKR's demise, Jaidev plans to fund the JJP with drug money, by offering money to the present financier. With the help of Abdul, Jaidev cuts a deal with Lukas, who agrees to transfer ₹750 crore , every month, in exchange for importing unchecked drug contraband into Hyderabad, once the JJP wins the election. For the deal to proceed, Jaidev has to first set up a discreet drug factory. Abdul insists that the factory should be on a government-sealed roadside. At the same time, the last rites of PKR are carried out in Hyderabad, where Sathya asks Varma to forbid Brahma from taking part in the ceremony. On Varma's orders, Indrajeet attempts to hinder his way but fails. That same night, Jaidev arrives home, where he gives some malana cream to Sathya's sister Jhanvi and convenes a meeting with the JJP ministers, informing his decision to fund the party and dissolve the current ministry, which will ensure the preponement of the elections. This will allow them to take advantage on the present sympathy wave and nominate himself as the party's next CM candidate. Since the present financier is Brahma himself, Varma advises Jaidev to negotiate with Brahma, but Brahma objects to funding the party with drug money and threatens Jaidev. Enraged, Jaidev assigns Varma to bribe 140 MLAs from the party to nominate him as the CM's candidate.\n Filming Jaidev sends men to set up the drug factory. Upon knowing this, Brahma goes to the factory and kills all of them. Brahma's aide and Jaidev's mole, Koti, witnesses this and reports it to the both of them. Indrajeet is sent to detect evidence from the factory but finds nothing. From Sathya's diary, Jaidev finds out that she resents Brahma because her father gave more care for him, who was brought to their home as a child, and was the cause of a rift between her parents. Koti persuades his lover Renuka to slander Brahma. On public news, she accuses Brahma of abusing her. This creates public outrage against Brahma, who is arrested and imprisoned. In prison, Brahma gets a phone call from his next contractor and Masoom Bhai, his most trusted aide. Jaidev arranges a hit on Brahma, by sending goons into the prison, but the attempt fails.\n Music While transferring the money to bribe the other party members in the JJP, Lukas' containers are sabotaged by Masoom Bhai. Brahma meets Govardhan, where he provides pieces of evidence of the party workers' corruption to Govardhan and also reveals the reasons for him indulging in drug trade, in Chennai. Meanwhile, Koti, who realizes his mistake, along with Renuka, admit that they lied about Brahma, on national news. Brahma is later released from prison. Meanwhile, Jhanvi is hospitalized after a drug overdose. From Jhanvi, Sathya learns of Jaidev's predatory behavior towards her. When confronted by Sathya, Jaidev admits everything and threatens to expose Jhanvi's contacts with drug peddlers. He also threatens to kill her and Jhanvi, like PKR. A changed Sathya, with no other choice, seeks the help of Brahma. Brahma, who reveals his origin to Sathya, vows to protect them. Sathya breaks down after coming to know the true face of her brother's.\n Release Indrajeet blackmails Sathya in exchange for not filing a case against Jhanvi. Brahma kills Indrajeet, with his men, following which, Brahma meets the owners of the NNTV news channel. Brahma clears the channel's debts of ₹45 crore  and gives total control and autonomy of the channel to Sathya. Brahma and Masoom Bhai also blackmail Varma and the other MLAs to ally with him in exchange for their drug habits not getting into the hands of the media. Jaidev kidnaps Jhanvi and blackmails Sathya, from Mumbai, to announce him as the next CM. With the help of Masoom Bhai, Brahma kills Jaidev's associates. They confront Jaidev, where upon seeing Brahma, Lukas reveals that Brahma is in fact, Abram Qureshi aka \"Godfather\". Though taken aback, Jaidev attempts to have Sathya killed in a car accident, but Brahma's men save her. Defeated, Jaidev kills himself. Sathya is elected as the new president of JJP party and CM, while Brahma heads to Paris with Masoom Bhai. After gathering all the major drug lords in the world, Brahma and Masoom Bhai kill all of them.\n Theatrical The Telugu remake of the 2019 Malayalam film Lucifer was announced in April 2020 with Chiranjeevi in the lead role. Sujeeth was signed to direct the project, who had also started working on the script for the Telugu adaptation. Sujeeth opted out of the project in September 2020 due to creative differences. Later, V. V. Vinayak was approached in replace him. In December 2020, Mohan Raja was confirmed as the director, marking his return to Telugu cinema after 20 years. Hanuman Junction  was his first and only Telugu film until then. The film was officially launched in January 2021 with a traditional pooja ceremony in Hyderabad. The film marks the maiden collaboration of Chiranjeevi with composer Thaman S. Nirav Shah was signed as the cinematographer. It was to be produced by Konidela Production Company and Super Good Films. The film's title was unveiled as Godfather in August 2021.\n Home media In September 2021, Nayanthara, Biju Menon and Satyadev entered talks to sign the film. Nayanthara and Satyadev were confirmed to be a part of the film in November and the latter was signed in to play the main antagonist in this film. Gangavva plays a supporting role next to Chiranjeevi in the film. Director Puri Jagannadh had a special role in the film. Bigg Boss 4 contestant Divi Vadthya joined the film as Chiranjeevi promised her a role in the season's finale.\n Reception In August 2021, actor Salman Khan was approached to play a key role in the film. In November, Thaman confirmed that Khan would star alongside Chiranjeevi, in addition to appearing a dance number, thus marking Khan's debut in Telugu cinema. Khan reportedly portrays the role of Zayed Masood  from Lucifer.\n Critical Response Principal photography of the film began on 13 August 2021. The first schedule of the film took place in Hyderabad. The second schedule of the film began in September 2021 in Ooty. Shooting was halted in October as Chiranjeevi underwent a surgery on his right hand which was followed by a 15-day bed rest. He resumed the shoot in November 2021 in Hyderabad. In January 2022, the actor tested positive for COVID-19 and therefore had to quarantine himself. This proceeded to shoot a few crucial scenes that didn't involve him during which Nayanthara joined the production. Chiranjeevi joined the sets back in February following his recovery. Salman Khan completed filming his portions in March 2022 in a week-long schedule at ND Studios, Karjat, Mumbai. Khan also shot for a song alongside Chiranjeevi in Hyderabad under the choreography of Prabhu Deva.\n Box Office The film score and soundtrack album of the film is composed by Thaman S. The music rights were acquired by Saregama. The first single titled \"Thaar Maar Thakkar Maar\" was released on 15 September 2022.\n References Godfather was released in cinemas on 5 October 2022 in Telugu along with a Hindi dubbed version. The film is distributed in India by Konidela Production Company along with PVR Pictures while the overseas distribution is by Sarigama Cinemas through Phars Film. Worldwide theatrical rights of the film were sold at a cost of ₹91 crore. The Tamil dubbed version was released on 14 October 2022.\n External links"
}{
    "id": 81602430,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81602430",
    "name": "Godse",
    "genre": "Telugu-Language Movies",
    "maturity": "U/A 16+ ",
    "duration": "2h 22m",
    "synopsis": "When several high-profile officials are held hostage by a man who calls himself Godse, a police investigator is pulled in to lead a negotiation.",
    "related-genre": [
        "Crime Movies",
        "Thriller Movies"
    ],
    "plot": "\n Plot Godse is a 2022 Indian Telugu-language vigilante action thriller film written and directed by Gopiganesh Pattabhi and produced by C. Kalyan under the banner of CK Screens. The film stars Satyadev and Aishwarya Lekshmi . The film is a remake of the 2018 Korean film The Negotiation. Godse released on 17 June 2022 to mixed reviews from the critics.\n Cast Vaishali, a negotiating officer is assigned to negotiate with a mysterious person named Nathuram Godse, who kidnaps several high-profile businessmen and SP Sameer. Vaishali negotiates Godse, while the police secretly surround his base in a secret island. Godse tells Vaishali to bring Industrial Minister Phani Kumar. After answering many questions, Phani Kumar reveals that the companies are actually called as\nshell companies which are non-existent and only printed on newspaper, which they can use for fraud against jobless men into getting jobs in exchange for profits. \n Production This enrages Godse, who kills Sameer despite threats from DGP. Vaishali leaves after scolding the Home Secretary, where she manages to find that Godse is actually a London-based businessman named Viswanath Ramachandra. Anand Kumar is replaced to negotiate with Godse, but the latter warns him to leave by threatening and kidnapping his minister uncle at knifepoint, and tells that he wants to negotiate with Vaishali only. Vaishali is called back and Godse tells her to call  MP Ajay Sarathy. Godse ask Ajay about killing his pregnant wife Shalini by making it as a robbery case which was negotiated by Vaishali earlier, and also brings the goon who had killed Shalini. \n Release When asked about his purpose, Godse asks Vaishali to bring media baron Punyamurthy, retired Chief Justice Anantha Krishnan and Chief Election Commissioner Lakshmi Narayana. Afterwards, Godse kills the dacoits. Later, it is revealed that Godse was a businessman who arrived at World Business Summit and was proposed a project by Phani Kumar and Ajay Sarathy. Godse refused the project and later arrived at his village for a college reunion, but learns that his best friend Rajaram had committed suicide. Rajaram was an science aspirant who is unemployed and was working as a painter. When Rajaram was insulted and unable to become a scientist, he committed suicide. \n Theatrical Godse decide to shut down his businesses and start a new business firm in India, but was stopped by Ajay, Phani Kumar and the CM by making him to stop the construction and leave back for London. However, Godse decide to stay back and with the help of his hacker friend manages to gather evidence about the CM, Phani Kumar and Ajay's illegal activities and heads to provide these evidence to the Governor, but the CM orchestrates an accident which killed his friends, but Godse manages to escape and also learns about Shalini's death which makes him to take up the part of vigilante justice. Having learnt all this, Godse reveals that he already leaked about the ministers' illegal dealings and qualifications to the media. \n Home media Anand Kumar and his team head to the island, but finds that Godse escaped and accidentally detonated the bomb, which explodes killing Anand and the businessmen. \nGodse arrives at the CM's house with purchased drones and attacks the security, where he meets CM, Ajay and others. He makes an impassioned speech about the sacrifices of parents and students seeking jobs which is not their qualification, along with other aspirant businessmen seeking to do something for the nation. Godse then detonates his bomb jacket, which explodes and kills the CM and others along with him. Vaishali recovers a hard drive which was delivered by Godse's friend, and she submits the hard drive to the Governor, explaining that Godse's actions came due to the corrupt  political system. With this, the Governor takes actions against the politicians.\n Reception The principal photography of the film began on 11 February 2021. The film marks Aishwarya Lekshmi .\n References"
}{
    "id": 81252029,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81252029",
    "name": "Ala Vaikunthapurramuloo",
    "genre": "Dramas",
    "maturity": "A ",
    "duration": "2h 41m",
    "synopsis": "After growing up enduring criticism from his father, a young man finds his world shaken upon learning he was switched at birth with a millionaire’s son.",
    "related-genre": [
        "Romantic Comedies",
        "Action & Adventure",
        "Comedies",
        "Dramas",
        "Romantic Movies"
    ],
    "plot": "\n Plot Ala Vaikunthapurramuloo ) , also known by the initialism AVPL, is a 2020 Indian Telugu-language action drama film written and directed by Trivikram Srinivas. The film stars Allu Arjun in lead role, with an ensemble cast of Pooja Hegde, Tabu, Jayaram, Sushanth, Nivetha Pethuraj, Samuthirakani, Govind Padmasoorya, Sachin Khedekar, Murali Sharma, Rohini, Navdeep, Sunil, Harsha Vardhan, Vennela Kishore, Ajay and Rajendra Prasad play other pivotal roles. It is produced by Allu Aravind and S. Radha Krishna under their banners Geetha Arts and Haarika & Hassine Creations respectively.\n Cast Production of the film began in April 2019, and wrapped up within December 2019. It was filmed across Hyderabad, with songs being shot in overseas. The film's soundtrack is composed by S. Thaman, while cinematography and editing were handled by P. S. Vinod and Naveen Nooli, respectively. After premiering in the United States on 11 January 2020, the film was released theatrically on 12 January, coinciding with Sankranti.\n Production The film opened to well critical acclaim, with critics praising the cast's performances, Thaman's music, and Trivikram's writing and direction. The film was commercially successful and grossed ₹262–280 crore worldwide. It became one of the highest-grossing Telugu films of all time and one of the highest grossing Indian films of 2020. Thaman won the National Film Award for Best Music Direction. The film also won ten South Indian International Movie Awards including Best Film – Telugu. A Hindi-language remake titled Shehzada was released on 17 February 2023.\n Development 1995: Valmiki and Ramachandra start their career as clerks in the company of Ananth \"ARK\" RamaKrishna. Ramachandra, who marries ARK's daughter Yasoda \"Yasu\", becomes wealthy while Valmiki remains poor. On the day of the birth of both their children, Ramachandra's son appears to be dead. When nurse Sulochana informs Valmiki about this, he offers to exchange his baby with the dead one. \n Casting The child, however isn't dead and starts crying ; however, Valmiki wants his son to grow up in a rich household. When Sulochana tries to return the baby, and Valmiki tries to stop her and accidentally pushes her. Sulochana falls from the hospital building and goes into a coma. Valmiki's son is named Raj. Valmiki names Ramachandra's son Bantu and treats him unfairly due to his true parentage.\n Filming 2020: After his MBA was denied by Valmiki, Bantu gets a job at a travel company headed by Amulya aka Ammu, a self-made businesswoman. Eventually, Bantu develops feelings for Ammu where he, Ammu, Shekhar, and Ravindra Reddy go to Paris for a business trip, and shortly after the trip, Bantu and Ammu fall in love with each other.\n Music Meanwhile, Raj returns from abroad, discontinuing his MBA. Ramachandra sends Raj to reject Paidithalli, the son of Appala Naidu, a wealthy, powerful and influential man who offers to buy 50% of their company's shares. Ramachandra watches the deal from the hotel where Ammu and Bantu have a meeting with Sudharshanam, the Investor behind Ammu's firm, who wants to buyback Ammu's travel agency. Ramachandra is disappointed by Raj's hesitance and inability to say no to Paidithalli but is proud of Bantu and Ammu for saying no to Sudharshanam. Following this, Raj is engaged with Ammu on ARK's suggestion, even though Raj is already in love with his cousin Nandini \"Nandu\".\n Marketing Naidu attempts to kill Ramachandra for refusing to sell the shares minutes before Ammu and Bantu arrive to call off the marriage. Bantu saves Ramachandra by taking him to the hospital despite several attempts by Naidu's men to stop them. There he meets Sulochana, who comes out of her coma and reveals Bantu's true parentage. The furious Bantu slaps Valmiki. Bantu then manages to enter Ramachandra's house, named \"Vaikuntapuram\". ARK takes an instant liking to him.\n Release Bantu begins to address the issues plaguing the house by patching up Ramachandra's broken relationship with Yasu , settling the dispute with Paidathalli, and reforming the corrupt family members, Kashiram and Sitaram. \n Theatrical At a party thrown at their house, Yasu witnesses Bantu and Ammu kissing each other. Bantu is ousted out of the house by Valmiki while Ammu's engagement with Raj is cancelled. Naidu uses the situation to his advantage by kidnapping and threatening to kill Nandu unless Ramachandra gives away the shares to Paidithalli. When Valmiki begs Bantu to save Nandu, he refuses but goes anyway. He thrashes the goons, slams Paidathalli, and stabs Naidu. Later, Raj saves Naidu, thus ending his enmity with Ramachandra. Bantu and Valmiki arrive at Vaikuntapuram, where ARK slaps Valmiki and reveals that he overheard the conversation between Sulochana and Bantu right before her death. Bantu unites with his biological father, Ramachandra but asks him not to reveal the truth to Yasu, fearing she might be disheartened to know that Raj is not her real child. Unaware of this, Yasu remarks that Bantu is equal to Raj as he saved Nandu and the family, thereby giving Bantu 50% of its shares. Yasu then asks Valmiki to train Raj for five years to be as competent as Bantu and become the CEO of the company.\n Pre-sale records After arriving at Valmiki's house, Raj, however, feels that Valmiki, with a nurse's help, should have switched the babies 25 years ago so he could've ended up at Valmiki's house and Bantu at Ramachandra's, much to the dismay of Valmiki. The story ends with Valmiki watching hopelessly as Bantu leaves in a helicopter with Ammu.\n Home media It was reported that Trivikram Srinivas, will direct a new film with Allu Arjun, post the release of Aravinda Sametha Veera Raghava . After listening to the script, it was reported that Allu Arjun advised Trivikram to make some changes. The idea of swapping infants was earlier attempted in Vedantam Raghavayya's Inti Guttu , starring N. T. Rama Rao and Savitri.\n Reception On 31 December 2018, coinciding with New Year's Eve, the project was officially announced, thus marking the third collaboration of Trivikram and Arjun after Julayi  and S/O Satyamurthy . It was further reported that Allu Aravind, Arjun's father will co-produce the film under his own banner Geetha Arts, along with S. Radha Krishna's Haarika & Haasine Creations. The film was launched under the tentative title #AA19, before the title Ala Vaikunthapurramuloo, was revealed on 15 August 2019.\n Box office In mid-October 2018, reports surfaced that Kiara Advani will play the female lead opposite Allu Arjun. In January 2019, Sunil was reported to play an important role in the film. In February 2019, Pooja Hegde was reported to replace Advani, as the female lead, thus marking their collaboration with both Arjun and Trivikram, for the second time, after DJ: Duvvada Jagannadham  and Aravinda Sametha Veera Raghava . Veteran actress Nagma was reported to play Allu Arjun's mother in the film, although she was not approached for the role.\n Domestic Followed by the success of Aravinda Sametha Veera Raghava, Trivikram hired S. Thaman, for the second time, as the film's music composer. In March 2019, it was reported that, Tabu was signed in for a significant role, marking her comeback to Telugu cinema, after Pandurangadu . Nana Patekar was reported to play the antagonist role. On 8 April 2019, the lead cast and crew was announced on the occasion of Allu Arjun's birthday.\n Overseas In May 2019, Ketika Sharma was reported to play the second female lead,`however, Nivetha Pethuraj was approached for the role, due to Sharma's commitments in Romantic . The film's cast features Jayaram and Sushanth in pivotal roles. Kajal Aggarwal was reported to appear in an item number, but however it was not confirmed by the makers. Tamil director and actor Samuthirakani was hired to play a negative role, which marked his maiden Telugu film.\n Critical response The film's launch event was speculated to be held on the occasion of Valentine's Day . On 13 April 2019, the film's launch was held at the office of Geetha Arts, the film's production house, with a pooja ceremony attended by the film's team.\n Remake Principal shoot of the film took place on 24 April. Followed by a brief schedule on mid-April, the team took a break, citing the weather conditions, as well as Allu Arjun and his family, went for a short holiday in Switzerland. The makers resumed the film's shoot on 24 May 2019. After wrapping the first schedule, the makers kickstarted the second schedule on 5 June 2019 in Hyderabad, with Pooja Hegde joining the sets. On 14 June, leaked stills featuring Allu Arjun as a corporate employee, went viral on social media. During this schedule the film added Nivetha Pethuraj, Tabu and Sushanth in pivotal roles.\n Impact In mid-October, the team moved to France to film the song ''Samajavaragamana''. Parts of the song was shot at Mont-Saint-Michel in Normandy, France, and the Eiffel Tower, in Paris. The song was also filmed at Lido de Paris, a world-famous cabaret theatre, and became the first South Indian film to shoot there. The makers cost up to ₹5 crore , for the song shoot. The team also shot the song \"OMG Daddy\" in parts of Europe. Later on December 2019, the makers moved to Hyderabad to shoot the song \"Butta Bomma\", for which a huge set was erected at the Annapurna Studios in Hyderabad. The shooting of the film was wrapped up on 28 December 2019.\n Accolades S. Thaman composed the soundtrack album and background score for the film, in his third collaboration with Allu Arjun, after Race Gurram  and Sarrainodu , and second collaboration with Trivikram Srinivas after Aravinda Sametha Veera Raghava . The album which features six tracks, featuring lyrics written by Sirivennela Sitaramasastri, Kasarla Shyam, Krishna Chaitanya, Ramajogayya Sastry, Kalyan Chakravarthy and Vijay Kumar Bhalla, had four of the tracks being released as singles, and went viral upon release. The soundtrack album was released on 6 January 2020, and the songs were performed by Thaman and his musical crew at the AVPL Musical Concert held the very same day, at Yousufguda Police Grounds in Hyderabad. The Malayalam version of the soundtrack album were released on 10 January 2020.\n Film charts It became the first Indian feature film soundtrack to have more than 1 billion-views on YouTube. The song \"Butta Bomma\" went on to become the most viewed Telugu song on YouTube with more than 800 million views as of January 2023. On YouTube's Top 10 Indian Music Videos, both \"Butta Bomma\" and \"Ramuloo Ramulaa\" became the only South Indian songs that have been listed in 2020.\n Notes On 15 August 2019, coinciding with Independence Day, the makers unveiled the first glimpse of the film, revealing its title as Ala Vaikunthapurramuloo. The film's first look poster was released on the eve of Ganesh Chathurthi, 1 September 2019. It features Allu Arjun seen sitting on a dusted stool in a businessman's suit, a security guard lights his cigar , and a shiny luxury car and a gigantic building in the background. Coinciding with the occasion of Dusshera, the makers unveiled a special poster on 7 October 2019, featuring Arjun in an action avatar.\n References The makers revealed a special poster featuring Pooja Hegde on her birthday, 13 October 2019. Sushanth's first look from the film was released on 21 October. Tabu's first look released on the occasion of her birthday, 4 November 2019. On Trivikram's birthday, 7 November, the makers released the first look of the film's Malayalam dubbed version Angu Vaikuntapurathu, through social media platforms. The film's official teaser was unveiled on 11 December 2019.\n External links"
}{
    "id": 81486768,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81486768",
    "name": "Shyam Singha Roy",
    "genre": "Dramas",
    "maturity": "U/A 13+ ",
    "duration": "2h 34m",
    "synopsis": "A budding filmmaker accused of plagiarizing his movie’s story dives deep into his past and discovers a transcendental connection to the source material.",
    "related-genre": [
        "Dramas",
        "Romantic Movies"
    ],
    "plot": "\n Plot Shyam Singha Roy is a 2021 Indian Telugu-language period romantic drama film directed by Rahul Sankrityan. Partly set in the backdrop of Kolkata in the 1970s, it is based on the theme of reincarnation. The film stars Nani in a dual role with Sai Pallavi played a prominent female lead role. In the film, Vasu is an aspiring filmmaker who stalks Keerthy because he wants her to act in his short film. She doesn’t put up with his creepy ways and gives it back. One day, during the shooting of the short film, Vasu gets a rabbit punch during a brawl. From then on, he gets flashes of his past life as Shyam Singha Roy. The film also stars with an ensemble supporting cast includes Krithi Shetty, Madonna Sebastian, Rahul Ravindran, Abhinav Gomatam, Jisshu Sengupta, Murali Sharma, Manish Wadhwa and others.\n Cast The film was announced in February 2020 and principal photography took place from December 2020 to July 2021 in Hyderabad and Kolkata. It was theatrically released on 24 December 2021 and opened to mixed to positive reviews with critics praising the direction, writing, music, editing, cinematography and cast performances  while criticizing the screenplay. It emerged as a success in the box office.\n Production Vasu is an aspiring film director in Hyderabad. To impress a film producer, he starts making a short film and finds Keerthi, a psychology graduate to be the lead. After some resistance, Keerthi agrees to act in the film, and the shoot is completed within a few days. One day while shooting, some goons sexually harass Keerthi leading to Vasu fighting them. In that ongoing fight, a guy hits him on his head, which leads him to ear bleeding and starts suffering from a psychological disorder that temporarily manifest him into a different personality.\n Development Impressed with the short film, the producer green-lights Vasu's feature film. A year later, Vasu releases his film, Uniki, which turns out to be successful. Vasu is offered to remake the film in Hindi but during a press conference for the remake in Mumbai, Vasu is arrested on charges of copyright infringement. A notable publishing house based in Kolkata, SR Publications, alleges that Vasu copied their best-selling novel Astitva written by Shyam Singha Roy fifty years ago. In court, strong evidence is presented against Vasu, and Keerthi's cousin Padmavathi takes up the case. Vasu pleads his innocence and after a successful polygraph test, the court releases him on unconditional bail and gives them 3 days to present their case. Upon Keerthi's suggestion, Vasu undergoes clinical hypnosis with the help of Keerthi's psychology professor, during which he reveals that he was Shyam Singha Roy in a past life and Rosie was his wife.\n Casting In West Bengal in 1969, Shyam Singha Roy is an influential social reformer and revolutionary writer with communist ideologies, who comes from a conservative family. As his family disapproves of his methods, he decides to leave but stumbles upon Maitreyi, a devadasi from Bangladesh who dances in the temple during the Navaratri. Despite being an atheist, Shyam visits the temple every night to see Maitreyi. One night, he asks her to sneak out of the temple with him and she reluctantly agrees. Shyam and Maitreyi fall for each other, and Shyam renames Maitreyi as Rosie. They decide to elope, however, on that night, the temple's high priest Mahant, who sexually preys on devadasis, selects a young girl to sleep with, which Rosie opposes. Mahant physically assaults Rosie in anger and disrespects her by urinating on her. Upon discovering this, an enraged Shyam attacks Mahant in the temple, during the Navaratri festival. After a fight, Shyam leaps onto the statue of Durga, takes the sword, castrates him, and throws him onto burning coal, killing him and removing the necklace on Maitreyi, implying discontinuing her duties as Devadasi.\n Filming Shyam and Maitreyi, having formally changed her name to Rosie, move to Calcutta where he starts working in a printing press. By 1977, Shyam becomes an accomplished yet controversial writer of his time. On Rosie's suggestion, Shyam opens up a trust to rehabilitate devadasis. Shyam's brother, Manoj, requests him to visit their village to see their ailing elder brother. However, upon their arrival, his two elder brothers send Manoj to bring tender coconuts, which turns out to be a ploy to murder Shyam for bringing disrepute to their family by killing Mahant at the temple and marrying Rosie, who is not of their caste. Manoj arrives but is unable to save Shyam, who dies in front of him. The two elder brothers are killed in an accident a few years later and Shyam's nephews now run SR Publications, Singha Roy's publishing house.\n Music In the present, Vasu visits the printing press in Kolkata where Shyam worked. However, he is told that Shyam and Rosie died decades ago, Rosie having left to find Shyam. Padmavathi submits Vasu's hypnosis report as evidence in the court that Shyam Singha Roy is reincarnated as Vasu. However, the prosecution lawyer objects, stating there is no scientific evidence of reincarnation. While the court is about to give its judgment, an 85-year-old Manoj visits the court and declares Vasu to be Shyam's reincarnation. Upon being asked for proof, Manoj explains that Vasu adapted Shyam's short story Varna as his short film Varnam, but that story was never published in the public domain. Manoj submits Shyam's hand-written manuscript of the story as proof and withdraws the case as the chairman of SR Publications. Vasu is acquitted of all charges.\n Release Manoj reveals to Vasu that Rosie is alive and waiting for him. Vasu then visits an aged Rosie, who now runs a dance school named after Shyam. Upon meeting Vasu, both have an emotional reunion and as per her wish, Rosie dies peacefully in his arms.\n Theatrical On 18 December 2019, Rahul Sankrityan narrated a script to Nani, which was considered to be an \"innovative story\". The project was initially reported to be produced under Suryadevara Naga Vamsi's Sithara Entertainments banner, who initially worked with Nani in Jersey . The film was announced in February 2020, with the title Shyam Singha Roy, and was expected to go on floors in May 2020, although the launch was delayed due to the COVID-19 pandemic in India. During March 2020, A. R. Rahman was approached to compose music for the film, and Nirav Shah was in charge of handling the cinematography. Later Anirudh Ravichander was announced as the composer as Rahman apparently did not accept the offer. The film was meant to be Anirudh's third collaboration with Nani after Jersey and Nani's Gang Leader.\n Home media The film was expected to be made on a huge scale, marking the most expensive film in Nani's career. However, producer Naga Vamsi wanted to cut down the budget citing the pandemic, as the estimated cost was much higher; Vamsi wanted to shelve the project, while Nani was completing the shoot of Tuck Jagadish. Due to differences of opinion between Nani and Vamsi, the production was handed over to Venkat Boyanapalli, who would be producing the film under his newly established banner Niharika Entertainment.\n Reception On 25 October 2020, a new poster was launched coinciding with Dusshera, with the inclusion of composer Mickey J. Meyer, cinematographer Sanu John Varghese and editor Naveen Nooli. Director Sankrityan revealed that the film is based on the theme of reincarnation and partially set against the backdrop of Kolkata.\n Box office Sai Pallavi, who also collaborated with Nani in Middle Class Abbayi, was cast in the film. It was reported that Rashmika Mandanna was approached for a lead role, although Krithi Shetty was finalized later. Madonna Sebastian was also confirmed as a lead, marking her come back to the Telugu cinema after Premam . Murali Sharma, Abhinav Gomatam, and Rahul Ravindran were later included in the cast. In March 2021, Bengali actor Jisshu Sengupta was signed to play an important role in the film. This also marked the Telugu debut for Bharatanatyam dancer, Leela Samson.\n Critical response The film was launched at a private ceremony in Hyderabad on 11 December 2020, in the presence of the cast and crew, and Nani's father gave the muhurat shot for the film. Principal photography began on 21 December 2020 in Hyderabad, India. A Kolkata-themed street along with the Kalighat Kali Temple was constructed on a budget of ₹6 crores. In February 2021, the team began filming crucial scenes in Kolkata. Filming was briefly halted due to COVID-19 lockdown in India and was resumed in July 2021. The Kolkata set in Hyderabad was damaged due to heavy rains and was restored by art director Avinash Kolla. Filming was completed on 26 July 2021 and post-production began.\n Accolades The soundtrack album is composed by Mickey J. Meyer and the audio rights were acquired by Saregama. The song \"Pranavalaya\" is set in the popular Carnatic raga \"Shuddha Dhanyasi\" , which became a popular classical dance number.\n Notes Telugu version\n References Tamil version\n External links"
}{
    "id": 81296771,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81296771",
    "name": "Krishna and His Leela",
    "genre": "Telugu-Language Movies",
    "maturity": "A ",
    "duration": "2h 5m",
    "synopsis": "Torn between his past and present girlfriends, a confused bachelor’s indecisiveness spins a web of lies and cheating as he struggles to commit.",
    "related-genre": [
        "Romantic Movies"
    ],
    "plot": "\n Plot Krishna and His Leela is a 2020 Indian Telugu-language romantic comedy film directed by Ravikanth Perepu who co-wrote and co-edited the film with Siddu Jonnalagadda. The film is produced by Suresh Productions and Viacom18 Studios. It stars Jonnalagadda, Shraddha Srinath, Seerat Kapoor and Shalini Vadnikatti. This is Perepu's second film after Kshanam . The music was composed by Sricharan Pakala. The cinematography for the film was handled jointly by Shaneil Deo and Sai Prakash U, whereas Garry BH served as one of the editors. The film was released directly on Netflix on 25 June 2020 globally.\n Cast In Vizag, Sathya breaks up with Krishna and moves to Bangalore. After going through a phase of depression, Krishna decides to move on and meets Radha, and they begin dating. Krishna receives a job offer in an IT firm in Bangalore, and leaves after deciding to maintain a long-distance relationship with Radha.\n Production In Bangalore, Krishna meets his sister Arya’s roommate Rukhsar, and forms a close friendship with her. He also meets and reconnects with Sathya, and tells Radha about his friendship with Sathya. Radha arrives in Bangalore a fortnight later, and they all take a vacation to Coorg. After returning to Bangalore, Radha leaves back to Vizag. Over the next few weeks Krishna and Sathya get closer, and the former begins to drift apart from Radha. This leads to their eventual breakup. One night, while spending the night with Sathya, Krishna ends up sleeping with her, and they reconcile, starting a relationship again.\n Soundtrack However, Radha returns to Bangalore, telling Krishna she became pregnant after their trip to Coorg, but was able to take contraceptives in time. A guilt-ridden Krishna lies to Radha that he is not in touch with Sathya, and reconciles with her, simultaneously dating the two girls. Arya’s marriage is fixed, and despite Krishna’s reluctance, their estranged father is invited to the wedding. During the wedding, Krishna struggles to manage Sathya and Radha, fabricating several lies, and his plight is understood by his father. The latter advices Krishna to be practical and make a choice between the two girls, a mistake he himself had committed during Krishna’s childhood. Krishna pays heed to the advice and confesses to the two girls that he has been cheating on them, and they both leave him.\n Release On Rukhsar’s advice, Krishna takes a road-trip and writes a book about his misadventures with Sathya and Radha, and publishes the book under the title Krishna and His Leela. The book is a success, and during a meet and greet, reveals that he maintains a good friendship with the two girls, Radha having settled abroad and Sathya getting married the following month. At an after-party following the marriage, Krishna approaches Rukhsar and asks her to marry him, to which she looks back in shock.\n Reception In March 2017, Rana Daggubati was reported to collaborate with Ravikanth Perepu , by presenting his upcoming project. Rana decided to present the project after  Perepu narrated the script to the former and got impressed with the storyline, although the details were undeciphered. In May 2017, it was reported that Shraddha Srinath and Seerat Kapoor will play the female leads, opposite Siddhu Jonnalagada  as the protagonist. While no details were revealed about the project, on August 2019, the makers announced the film's title as Krishna and His Leela, and the makers also wrapped the shoot in Kashmir.\n References \nThe music is composed by Sricharan Pakala with lyrics written by Pakala, Kittu Vissapragada, Pranav Chaganty, Rohit Roe Pediredla, Murtuza Abbas Qurasani, Ananth Srikar and Vedala Hemachandra. External links"
}{
    "id": 81412246,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81412246",
    "name": "Virata Parvam",
    "genre": "Dramas",
    "maturity": "U/A 16+ ",
    "duration": "2h 30m",
    "synopsis": "Captivated by the poems of a renegade warrior on a lethal mission, a naive yet defiant young woman follows her heart into the depths of a revolution.",
    "related-genre": [
        "Dramas",
        "Romantic Movies"
    ],
    "plot": "\n Plot Virata Parvam  is a 2022 Indian Telugu-language period romantic action drama film written and directed by Venu Udugula, and produced by Suresh Productions and SLV Cinemas. The film stars Sai Pallavi and Rana Daggubati while Priyamani, Nandita Das, Naveen Chandra, Zarina Wahab, Easwari Rao, and Sai Chand play supporting roles. Set in Telangana region in the 1990s amidst the Naxalite movement, the film tells the story of Vennala , a young woman who is in pursuit of her love with Ravi Shakar , a Naxal leader.\n Cast Principal photography began in July 2019 and ended in December 2020, with filming locations including Vikarabad, Warangal, and Hyderabad in Telangana, and Kerala. The film has music composed by Suresh Bobbili with cinematography by Dani Sanchez-Lopez and Divakar Mani. Initially scheduled to release on 30 April 2021, it has been postponed due to the COVID-19 situation in India. Virata Parvam was released theatrically on 17 June 2022. Despite positive reviews from critics, the film performed poorly at the box office, grossing ₹12 crore against a budget of ₹15 crore.\n Production Vennela was born in 1973 in Warangal district, amidst a cross-fire between the Naxals and the police. She grows up listening to the poetry of her father and is later inspired by the writings of Ravi Shankar , a Naxal leader who uses the pen name Aranya. Vennela becomes obsessed with Ravi's works, therefore admiring and loving him.\n Development In 1992, the state police probes her village under suspicion that the villagers are sympathetic to the Naxals. They thrash Vennela's father severely as he objects to their actions. Vennela scolds the police in retaliation but they harass her. Ravi's troop arrives and ambushes the police. Ravi assures the safety of the villagers, impressing Vennela.\n Casting Vennela calls off the wedding with her cousin by telling him that she is deeply in love with Ravi, much to the dismay of her parents. She leaves her house the following day in pursuit of Ravi and writes to her parents not to search for her. Vennela meets Vidyadhar Rao in Karimnagar who publishes Ravi's books. She requests him to give Ravi's address but Rao declines to help her. He gets arrested by the police as she leaves the place. Vennela enquires and finds out Ravi's house. She meets his mother who tells her that Ravi left the place seven years ago and she has been waiting for him ever since. Vennela promises to deliver her letter to him and bring him back.\n Filming Vennela continues her search and learns that she can find Ravi at the Bhupalpally degree college. However, Vennela is frisked by the police who suspect her to be a Naxal sympathizer. The police bring her to the college to confirm her identity, only to engage in a shootout with Ravi's troop. Unable to meet him there, Vennela reaches out to Shakuntala, a human rights activist, and confesses her love for Ravi. Shakuntala arranges Vennela's meeting with Ravi but Ravi politely declines her proposal by saying he doesn't believe in love.\n Soundtrack Meanwhile, the police arrive at that place and surround the building. Vennela helps to set up the explosives so that Ravi's troop can escape, however, she gets caught by the police. Ravi rescues her later that night and shelters her at Shakuntala's home. Vennela then decides to join the Naxals in the forest against Shakuntala's advice. Sammaiah, a senior party leader appreciates her spirit and recommends her to Ravi's troop. While Ravi initially rejects her recruitment, he lets her join based on Bharathakka's suggestion. Vennela takes up the arms and earns the party's appreciation for her humanitarian approach to the Naxal movement.\n Release Sometime later, Sammaiah is caught by the police who threaten to expose his fraud of using the Naxal movement for financial benefits. He rejoins Ravi's troop to act as a covert agent of the police. Meanwhile, Vennela handovers the letter to Ravi and requests him to meet his mother. Based on a tip by Sammaiah, the police attack Ravi while he's meeting his mother. Ravi and Vennela fend off the police and escape. That night, Sammaiah kills 11 members of Ravi's troop by launching an assault on them and escapes. Sammaiah publicly claims that the Naxal movement has lost its ideals, therefore, it is infiltrated by his coverts who would work for the police.\n Theatrical Police send a false message from the party to Ravi which instructions him to weed out the covert in his troop. Raghu who was always wary of Vennela tells that she is the covert as she was Sammaiah's recruit. Bharatakka seconds him by proving that Vennela entered their troop using a string of lies. Bharatakka beats up Vennela asking for her confession but she pleads innocence. Vennela tries to submit her lost diary as proof of her innocence, only in vain. Regardless, Bharatakka confirms to Ravi that Vennela is the covert.\n Home media Ravi takes Vennela to a secluded place in the forest. Ravi confesses his love for Vennela but feels that she betrayed him. Angry and resentful, Ravi shoots Vennela into the adjoining waterfalls. Raghu and Bharatakka rush to Ravi and tell him that the message was fake. Distressed Ravi retrieves Vennela's body from the waters and sobs in grief, as do others.\n Reception In June 2018, Venu Udugula stated that his second directorial venture would be a period love story set in the backdrop of the 1990s, and it would be a \"commercial entertainer\" focusing on politics and action, apart from being centered on romance. Sai Pallavi and Rana Daggubati were signed to play the lead roles in November 2018. The film was launched in June 2019 in Hyderabad.\n Critical reception The film is set during the Naxal movement which happened in Telangana in the 1990s. Udugula wrote the story from the events he witnessed from his childhood in Warangal.  Pallavi's character Vennela is based on Thumu Sarala, a 16-year-old girl from Warangal district. Sarala quit her studies in 1992 and enrolled herself in the Peoples War Group to join the naxalites in their cause. However, Sarala was killed by the naxals a month later under mysterious circumstances. Udugula felt the need to bring this story onto the screen, depicting the incident and the politics behind it. The plot, however, follows a fictional storyline and characters written by Udugula. Following the film's release, Pallavi, Daggubati and Udugula met Sarala's family to express their condolenses.\n Box office The film is titled Virata Parvam, based on the fourth book of the Indian epic Mahabharata. The film is not related to the epic but Udugula stated that it shares several elements from that episode. “As my film has elements such as politics, conspiracy, love, vendetta and positivity, we felt that it would be an apt title,” Udugula added.\n Notes Daggubati is cast in the role of Dr Ravi Shankar alias Comrade Ravanna. For his role, Daggubati reduced his weight in order to look lean for the film. Gopichand was Udugula's first choice for the lead before Daggubati was finalised.\n References In May 2019, Priyamani was cast as Comrade Bharathakka, a Naxalite, and documentary filmmaker Sai Chand was also appeared for a supporting role in the very same month. Tabu was initially cast in the film, but due to schedule conflicts she was subsequently replaced by Nandita Das in August 2019. The film marked Nandita Das' return to Telugu cinema, whose last appearance in a Telugu film was Kamli . Naveen Chandra, Zareena Wahab and Easwari Rao, and are cast in supporting roles. Actress Nivetha Pethuraj is signed to play a crucial role in the film.\n External links"
}{
    "id": 81614454,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81614454",
    "name": "The Ghost",
    "genre": "Telugu-Language Movies",
    "maturity": "A ",
    "duration": "2h 14m",
    "synopsis": "A former agent with a troubled past unleashes his lethal skills to protect his sister and her daughter from kidnappers, rivals and death itself.",
    "related-genre": [
        "Crime Movies",
        "Action & Adventure"
    ],
    "plot": "\n Plot The Ghost is a 2022 Indian Telugu-language action thriller film written and directed by Praveen Sattaru. The film stars Nagarjuna and Sonal Chauhan while Gul Panag, Anikha Surendran, Manish Chaudhari, Ravi Varma, and Srikanth Iyengar play supporting roles.\n Cast Principal photography of the film began in February 2021 and ended in August 2022 with filming taking place in Hyderabad, Ooty and Dubai. The Ghost was released worldwide on 5 October 2022 and received mixed to negative reviews from critics where it was declared as a box-office bomb.\n Production Vikram Naidu is an Interpol field agent, in Dubai, who suffers from anger management and nightmares, about a riot that took place in 1984 in New Delhi, in which his mother was killed, when he was 10 years old. During a mission to save an Indian business mogul's son, along with Priya, Vikram's steadfastness in the mission causes the boy to get shot and killed. After this incident, Vikram develops a guilt complex and becomes wild with rage. He eventually breaks-up with Priya, as a result. \n Music 5 years later, Vikram has retired from the Interpol, and works as a freelance agent, occasionally helping the Interpol with their missions. During a session with his psychiatrist, Dr. Iyer, he reveals that post their break-up, Priya moved back to India and joined the NCB, in Mumbai. He also reveals to her that he received a call from his estranged sister and corporate businesswomen, Anupama 'Anu' Nair, who runs the business conglomerate, Nair Group, after 20 years. Vikram leaves to Ooty and reminisces his life of getting adopted by Anu's father, Nagendra Naidu, who was a colonel in the Indian Army, and saved him from getting killed in the riots. Years later, Anu got separated from the both of them, as Naidu denied her relationship with the business mogul, Ashok Nair. As a result, Naidu's health deteriorated. On his deathbed, he made Vikram promise to him, that he will protect and look after Anu. \n Release After reaching Anu's estate in Ooty, Vikram meets Anu, who reveals that she was receiving death threats and fears that her daughter, Adithi, is in danger, as her personal bodyguards are also not trustworthy. Anu requests Vikram to protect Adithi, where Vikram tells her to appoint him as Adithi's bodyguard. Vikram begins his investigation by checking into Ashok Nair's family, while Anu leaves for a business trip. Vikram slowly begins to change Adithi's behaviour and habits. Adithi and her friends divert Vikram and leave for a trip to Goa. While partying with her friends, Adithi and her friends are sedated and kidnapped, but Vikram, having learnt of their location, narrowly saves them. Later, Adithi reveals that she knows about Vikram. One day, Vikram and Adithi are attacked in a bomb blast, which was meant for Adithi, at Anu's estate. Anu gets killed in a car accident. \n Home media It is revealed that after the mission in Dubai, Vikram went on a killing spree and had vanquished many gangsters and criminals in the underworld, where he was referred to as the Ghost. The remaining gangsters and criminals began to get scared of Vikram's rampage and later surrendered to him, who spared them. Having survived the blast, Vikram and Adithi escape with Priya, where they also learn about Anu's death. Having joined the NCB in Mumbai, Priya reveals that the attack was orchestrated by Scorpion, who runs a business of human trafficking, assassinations, and narcotics. Vikram and Priya suspect Pankaj Nair, Anu's brother-in-law, of hiring Scorpion and hack his phone, only to learn that the company's  shareholder, Harish, and Siran Group heir, Siddhant Nair, were the ones who were involved in the attacks on Adithi and Anu. \n Reception Having guessed that Anu's shares in the company will be nominated to Adithi and that 70% of the board of directors would transfer the shares to Siran Group and merge the company with them, Vikram makes Adithi reveal herself, of being alive, and manages to cancel the meeting. Scorpion learns about Vikram's past from his father, Lala, whose family became his victims, during his rampage. Vikram, Adithi, and Priya interrogate Harish and learn about Scorpion's farmhouse in Narsapur, Karnataka. Priya heads to Scorpion's farmhouse, while Vikram heads to Siddhant's house, with Harish. Having learnt of Vikram's identity, Siddhant attacks Vikram, where Harish is killed in the cross-fire. After an intense combat, Vikram manages to subdue and kill Siddhant. However, he is surrounded by Lala's right-hand man, Sadhu, and his men. But, Lala tells them to leave Vikram, as he received a video of Scorpion getting tortured by Priya. \n References Lala arrives at the church, in Goa, where Scorpion is kept and begs Vikram to release him. He reveals that Anu is alive and had survived the accident. He kept her alive, as a bargaining chip, knowing fully that the need will arise. Lala's men bring Anu to the church, while Vikram throws Scorpion's severed head to him. Enraged and distraught, Lala launches a full-on assault, on Vikram and Priya. However, both Vikram and Priya gain the upper-hand, and kill Lala and his men. Anu reunites with Adithi and rejoins the company, by merging Siran Group into Nair Group. She appoints Pankaj as the chairperson of Nair Group. Afterwards, Vikram and Priya are seen riding in a helicopter, speaking to Adithi, as she is now admitted in Cambridge University.\n External links"
}{
    "id": 81412247,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81412247",
    "name": "Most Eligible Bachelor",
    "genre": "Dramas",
    "maturity": "U/A 16+ ",
    "duration": "2h 23m",
    "synopsis": "Harsha is a smart, successful expat ready to marry whomever his parents choose... until he falls for a candid stand-up comedian they don’t approve of.",
    "related-genre": [
        "Romantic Comedies",
        "Comedies",
        "Dramas",
        "Romantic Movies"
    ],
    "plot": "\n Plot Most Eligible Bachelor is a 2021 Indian Telugu-language romantic comedy film written and directed by Bhaskar and produced by Bunny Vas and Vasu Varma on GA2 Pictures. It stars Akhil Akkineni and Pooja Hegde with music composed by Gopi Sundar, cinematography by Pradeesh Varma and editing by Marthand K. Venkatesh.\n Cast The film follows the love story of NRI Harsha and stand-up comedian Vibha. It was released on 15 October 2021 after being repeatedly postponed because of the ongoing COVID-19 pandemic. The film opened to positive reviews with critics praising casts performances , story and music. The film was commercially successful and grossed ₹51 crore worldwide.\n Production A couple drives along the road. All of a sudden, they hit a flock of lamb. The couple get a shock on noticing a man among the flock. The man is introduced to be Harsha . They asked why he was there and he starts narrating his story.\n Development Harsha is an NRI who lives in New York with aspirations to get married as soon as possible. His family then sets up a marriage for him that has to be completed within 20 days. Excited, Harsha buys himself a house and flies to India for his marriage. In India, he is set to meet 20 prospective brides and he ends up liking the first one he meets. However, his family insists on meeting more to see which one is the perfect match for him. Meanwhile, Harsha's mother tells him to drop a certain bride's details off since their horoscope did not match. Harsha opens the envelope to see that it is Vibha  but he still goes to her father and gives back the details. He then realizes that Vibha's father is Subbu  with whom he had a horrible interaction earlier. On top of this, he loses Vibha's picture so Subbu holds his friend captive. In an attempt to find the picture, he meets Vibha at her stand-up comedy show and asks her for her picture. Vibha then asks a series of questions that disrupt Harsha's mentality about marriage. By being with Vibha, he realises that he wants to marry her.\n Casting Unexpectedly, Harsha has his marriage set with another girl. In an attempt to get together with Vibha, he goes to Subbu to convince him. However, in a turn of events, Subbu files a case against Harsha for being vulgar in each of his meetings with the brides. Vibha realizes that it was her words that affected Harsha and convinces Subbu to take back the case. Harsha, wanting answers, goes to Vibha and admits to liking her but she says she rejected him over twenty days ago as his mentality about marriage is not the same as hers. An enraged Harsha leaves for New York and tries to understand what went wrong. After attending Ganesh's 25th wedding anniversary and talking with his brother-in-law , he discovers that their marriage is toxic and that he shouldn't compromise at all.\n Filming Nine months pass by and Harsha is a completely changed man with a new mindset. In an attempt to merge his and Megha's companies, he makes her fall for him. Megha's parents want her to marry Harsha even though Harsha still likes Vibha. With his marriage in 20 days, he decides to leave for India early so that he can see Vibha again. On returning to India, he finds out that Vibha does not want to get married due to a painful experience she has. So anonymously, Harsha tries to get Vibha to change back to her old lifestyle and manages to make her fall for him. However, Harsha's parents find out and make him leave Vibha while Subbu simultaneously lets Vibha know that Harsha is getting married and to give up. At his wedding, Vibha shows up to do a stand-up show and Harsha is shocked to see her there. She then narrates her experiences in life with Harsha and then sadly leaves. Megha, who knows all of this, allows Harsha to reunite with Vibha and he manages to convince everyone. In the end, Harsha and Vibha get married and go back to New York.\n Soundtrack In February 2019, director Bhaskar teamed up with Akhil for GA2 Pictures production under Bunny Vasu. In May 2019, the film was officially launched at Film Nagar Temple, Hyderabad with a pooja ceremony. The music is composed by Gopi Sunder while V. Manikandan and Marthand K. Venkatesh were signed as the cinematographer and editor respectively. Manikandan later replaced by Pradeesh Varma, due to the former's exit citing schedule conflicts. Director Vasu Varma is co-producing along with Bunny Vas. The title was announced as Most Eligible Bachelor in February 2020. The film is presented by Allu Aravind of Geetha Arts.\n Release The film's casting crew auditioned over 100 actresses and models for leading actress role. Pooja Hegde and Eesha Rebba were finalized as the leads in August 2019. Murali Sharma, Vennela Kishore, Jayaprakash, Pragathi and Aamani were cast in supporting role Akkineni's role was Harsha, an NRI  while Pooja Hegde featured as a stand-up comedian named Vibha. In an interview with The Indian Express, Akhil told about the film that \"We tried perfecting it more and more, and it has come to where it is today because of the time we had. I am so happy that finally after two years I am having a release\".\n Home media The principal photography of the film began in July 2019 in Hyderabad. Hegde joined the sets in September 2019. The film is shot extensively in major portions of New York in mid-January 2020. Filming took place in Hyderabad in mid-March 2020, however, came to a halt after Akkineni was injured in the sets. Filming was further delayed due to the COVID-19 pandemic lockdown in India. Filming was resumed in  September 2020. Akkineni and Hegde joined the shoot the same month. The filming was completed in March 2021.\n Reception The music was composed by Gopi Sundar, who earlier collaborated with Bhaskar for the 2016 Tamil film Bangalore Naatkal. On 2 March 2020, the film's first single titled \"Manasa Manasa\" sung by Sid Sriram and written by Surendra Krishna was unveiled on social media platforms. Less than a year later, on 13 February 2021, the second song \"Guche Gulabi\" sung by Armaan Malik and written by Ananta Sriram and Sri Mani was released. On 5 April 2021, a third song \"Ye Zindagi\" sung by Haniya Nafisa and Gopi Sundar and written by Ramajogayya Sastry was released. On 15 September 2021, the fourth song \"Leharaayi\", written by Sri Mani and sung by Sid Sriram was released. On 11 October 2021, four days before the film's release, the fifth song \"Chitti Adugu\" was released. The song is written by Sirivennela Seetharama Sastry and sung by Zia Ul Haq.\n Critical response Original Non-film Track List\n Box office All music is composed by Gopi Sundar. References Most Eligible Bachelor's release was scheduled for 2 April 2020, during Sri Rama Navami, but was delayed due to the COVID-19 pandemic. It was pushed back to January 2021, then to April 2021. In February 2021, the film's release date was announced as 19 June 2021. With the second wave of COVID-19 pandemic impacting India and shutting down cinemas again, the release was again delayed. In August 2021, the film was scheduled to be released on 8 October 2021.\n External links"
}{
    "id": 81605073,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81605073",
    "name": "Krishna Vrinda Vihari",
    "genre": "Telugu-Language Movies",
    "maturity": "U/A 13+ ",
    "duration": "2h 18m",
    "synopsis": "The son of a deeply religious and traditional family tells an elaborate lie to win their permission to marry a woman who cannot have children.",
    "related-genre": [
        "Romantic Comedies",
        "Comedies",
        "Romantic Movies"
    ],
    "plot": "\n Plot Krishna Vrinda Vihari is a 2022 Indian Telugu-language romantic comedy film directed by Anish R. Krishna and produced by Usha Mulpuri under the banner of Ira Creations. The film stars Naga Shaurya and Shirley Setia. \n Cast After being postponed multiple times, the film was released on 23 September 2022.\n Production Krishna Chari  is from a restricted and strict Brahmin family who gets a software job in Hyderabad. The moment he sees Vrinda  in his office, he falls for her. But she is quite stubborn and does not accept his love due to an issue. When Krishna further persaudes her she tells she cannot bear children due to some defect . But Krishna understands her situation and agrees. Finally wins her love but he is quite confused as to how to convince his orthodox family. After a while, he somehow manages to persuade them by playing a trick and marries Vrinda. This makes him land in big trouble. What is this trouble? How did Krishna manage it? That forms the story.\n Music The film was officially announced on 16 October 2020. The film was formally launched on 28 October 2020. The film was tentatively titled as NS22 and IRA4. On 22 January 2022, the film's official title was unveiled as Krishna Vrinda Vihari. Principal photography of the film began on 9 December 2020.\n Release The music composed by Mahati Swara Sagar collaborating with Naga Shourya for the fourth time after Jadoogadu, Nartanasala and Chalo. The audio rights were bagged by Saregama. The first single titled \"Varshamllo Vennella\" was sung by Adtiya RK and Sanjana Kalmanje and it was released on 9 April 2022.\n Reception The second single titled \"Emundi Ra\" was sung by \"Haricharan\" and it is released on 4 May 2022.\n References Krishna Vrinda Vihari was released on 23 September 2022. Earlier, the film was scheduled to be released in theatres on 22 April 2022. It was pushed back to 20 May and later 24 June 2022 but was not released.\n External links"
}{
    "id": 81504459,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81504459",
    "name": "Ranga Ranga Vaibhavanga",
    "genre": "Dramas",
    "maturity": "U/A 13+ ",
    "duration": "2h 19m",
    "synopsis": "Reunited after a decade-long fight, love blooms between Rishi and Radha. Now, they must resolve the discord brewing between their once-close families.",
    "related-genre": [
        "Romantic Comedies",
        "Comedies",
        "Dramas",
        "Romantic Movies"
    ],
    "plot": "\n Plot Ranga Ranga Vaibhavanga is a 2022 Indian Telugu-language romantic drama film written and directed by Gireeshaaya. The film is produced by B. V. S. N. Prasad under the banner Sri Venkateswara Cine Chitra. The film featured Panja Vaisshnav Tej and Ketika Sharma in lead roles with the music composed by Devi Sri Prasad. The film opened to negative reviews criticizing the lackluster and cliche story. The film ended up a box-office failure, the second in a row for Vaisshnav Tej.\n Cast Rishi and Radha are children of best friends Ramu and Chanti. They fall in love at the age of 14. They share a common gift watch with each other on their birthday. However, Rishi witnesses Radha being harassed by their classmate Rakesh and warns Radha to avoid him. While Radha abides by Rishi's words, Rakesh hatches a plan to trick her into talking to him. This invokes Rishi's fury, and he starts beating up Rakesh which prompts Radha to slap him and in return Rishi slaps her. With this event, they both vow that they do not talk to each other until one of them first breaks the silence. Ten years later, Rishi and Radha are medicos and are still in love but do not talk to each other.\n Production On the other hand, their families get close to each other and share the same neighbourhood. Radha has an elder sister and an elder brother Arjun Prasad. Arjun is an aspiring politician for Samaja Seva Party. The party has a youth leader Rana who uses the influence of his father to become youth president when his plans are thwarted by Arjun who exposes his drug scam. Now the entire family of Rishi and Radha plan to go for Tirupathi leaving the pair and Arjun. While Radha prepares for her studies at her friend's home. Rishi arrives to distract her with loud music. So, Radha decides to leave her home when she gets caught by Rana. While Rana and his associates including Fish try to molest her, Rishi arrives to save her, and Radha kisses him passionately breaking the silence between the two and uniting them.\n Development Meanwhile, Arjun's friend Siva arrives from the US and is the son of the Minister. Arjun decides to give the hand of his elder sister to his friend while his sister reveals she is in love with Rishi's brother. This infuriates the minister who publicly demeans Arjun. Losing his prestige in the colony, Arjun picks a fight with Rishi's family and orders his family members to stay away from them.\n Filming Radha and Rishi attend a medical camp. Radha is assigned to a guardian, the village sarpanch. One day there appears to be an accident to the auto in which Rishi was travelling, and Radha rushes to the hospital to see Rishi doing well. She breaks the silence one more time, and the couple unites again for a second time. The pair decides to unite their family the way they got united. So, they make a plan to bring the mothers of both families to a temple. At the temple, the mothers get united after having a conversation with the daily opera. Now they get both their fathers to a theatre that plays Yamagola. The fathers who were friends earlier get united quickly. Now Rishi tries to help Arjun Prasad gain prominence in his party by supporting a local MLA to win a bye-election. However, there appears to be an accident of a Cobra bite to a kid nearby and Rishi and Arjun try to help their family. While Rishi carries the kid to the hospital, Arjun gives some money to the mother for hospital expenses. The local MLA wins the election despite Rana planning to do some rigging and Rishi thwarting his plans.\n Soundtrack However, Rana utilises this as an opportunity to show the party committee members that Arjun bribed the public for a vote and used his family to rig the elections. While the committee plans to take action against Arjun, the minister Nagababu arrives and shows the bribe is a made-up story by Rana and saves Arjun. Now Arjun rushes home, however on the way Rishi and Radha confront him together and show him that their families have united, and he is all alone. Arjun is furious at this and confronts his family when Ramu explains to him that Chanti is his friend even before he got married and kids were born and questions his morality bringing change in Arjun's behaviour. Arjun realizes his mistake and apologizes to both the families and unites Rishi's brother with his elder sister Shuba and Rishi with his younger sister Radha. Both couples get married.\n Release The film was announced on 2 April 2021 under the tentative title #Vaisshnav3 with Gireesaaya directing marking his Telugu debut. On 24 January 2022, the film's title was revealed as Ranga Ranga Vaibhavanga.\n Reception Principal photography began on 2 April 2021.\n References \nThe soundtrack and score of the film is composed by Devi Sri Prasad. The audio rights were acquired by Sony Music India. External links"
}{
    "id": 81512223,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81512223",
    "name": "Pakka Commercial",
    "genre": "Dramas",
    "maturity": "U/A 16+ ",
    "duration": "2h 29m",
    "synopsis": "When an unscrupulous lawyer takes on a notorious client, the case pits him against his morally-minded father, an ex-judge with a past of his own.",
    "related-genre": [
        "Comedies",
        "Dramas"
    ],
    "plot": "\n Plot Pakka Commercial  is a 2022 Indian Telugu-language legal action comedy film written and directed by Maruthi and produced by UV Creations and GA2 Pictures. The film stars Gopichand and Raashii Khanna. It was released on 1 July 2022, and received mixed reviews from critics and audience.\n Cast Suryanarayana is a dutiful lawyer, who resigns after being unable to deliver justice to Amulya, who was threatened and blackmailed by the rich man named Vivek and ultimately committed suicide. While he works hard at his shop to provide for his family, his son Ramchand \"Lucky\" finds his law books and coat, sparking an inspiration to become a lawyer. Years later, Lucky becomes an advocate, who embodies the opposite principles of his father, settling cases outside of the court for his personal profits, which Suryanarayana is unaware. One day, Jhansi an actress whose character, a lawyer in a serial, was killed off to save money requests Lucky so that she can sue the studio. Although their case is rejected, Lucky is impressed by Jhansi's knowledge and qualifications in real-life law and they fall in love with each other.\n Production Afterwards, Lucky defends a gangster, who killed a lawyer despite extensive evidence against him while Suryanayarana helps a couple file a case against a corrupt developer and politician who is actually Vivek. When Suryanarayana refers the case to him, he instead meets Vivek and agrees to work with him for substantial rewards. Vivek also kidnaps the husband, who exposed his corruption. On the second hearing for the gangster's murder case, Jhansi, who has gotten closer to the family, unexpectedly brings Suryanarayana to the courtroom, forcing Lucky to honestly argue and leading to a guilty verdict for the gangster. Watching through a secret camera, Vivek is impressed by his performances and reaches the court. Vivek's arrival brings all the truths to light, and Suryanaryana is ashamed by Lucky's actions, where he decides to fight for the couple himself.\n Music Jhansi decides to join Suryanarayana after seeing his drive for justice. At home, they work on the case, splitting the house into halves which they title themselves as  Commercial  and Non-Commercial .  Lucky uses various tricks to hamper Suryanaryana and Jhansi, slanders the couple's names, claiming that he had actually gone to Dubai and had affairs, and nearly gets Suryanaryana disbarred. Meanwhile, Lucky keeps getting gifts from Vivek. Lucky's search for the disappeared husband, ends to no avail and Vivek plans to kill him by putting him in a pillar and casting concrete inside. Lucky also meets a mysterious woman also named Amulya, who is Vivek's wife. Ultimately, Lucky gets a seat as an MLA in Vivek's political party.\n Release As Vivek prepares to be sworn, the news breaks about the body of a cab driver that Vivek had murdered earlier being found at his farmhouse. It is revealed that Amulya is actually Saira Banu, the cab driver's wife. In retaliation, Vivek kidnaps Suryanarayana and asks Lucky to cover his bail. However, Lucky instead saves Suryanarayana from Vivek's goons and reveals that he had planned everything all along to seek vengeance on Vivek, ever since he saw Suryanarayana's sufferings as a child following his resignation, and had enlisted Saira Banu to seduce and distract Vivek. Vivek attempts to appeal, but his lawyer deserts him after revealing that Lucky used his gifts and conversations to collect his evidence and biometric traits. Finally, Vivek becomes insane and requests the court to provide him a death penalty.\n Theatrical In January 2021, sources claimed that director Maruthi will collaborate with Gopichand for a new film. The official announcement of the film and its title were announced in February 2021. Principal photography of the film began in March 2021.\n Home media In January 2021, Sai Pallavi was in talks to play the female lead, however, Raashi Khanna, who paired up with Gopichand in Jil , and Oxygen , was cast in the  female lead in February 2021. The film marks the third collaboration between Gopichand and Khanna, and also second collaboration between Maruthi and Khanna after Prati Roju Pandage . Eesha Rebba was rumored to be playing second female lead. Anasuya Bharadwaj was roped in for a role. The film shooting has started in Hyderabad in March 2021. In April, due to the second wave of COVID-19 pandemic, the film shooting is postponed. Filming was resumed in August 2021.\n Reception The music rights of the film are sold to Aditya Music. The music of the film is composed by Jakes Bejoy.\n References The film was initially planned for a theatrical release on 1 October 2021, but due to the second wave of the COVID-19 pandemic, the filming was delayed, and the film's release was initially planned to 24 February 2022, and pushed to 20 May 2022,  but eventually postponed and then finally released on 1 July 2022. The total worldwide theatrical distribution rights of the film were sold at a cost of ₹19.20 crore.\n External links"
}{
    "id": 81217737,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81217737",
    "name": "Guna 369",
    "genre": "Dramas",
    "maturity": "A ",
    "duration": "2h 22m",
    "synopsis": "A pampered but kind-hearted average joe ditches his romancing and peacekeeping ways when he’s framed for a murder he didn’t commit.",
    "related-genre": [
        "Action & Adventure",
        "Dramas"
    ],
    "plot": "\n Plot Guna 369 is a 2019 Telugu-language action drama film written and directed by Arjun Jandyala and stars Kartikeya and Anagha. Anil Kadiyala and Tirumal Reddy produced the film under the banner \"SG Movie Makers\". The soundtrack was composed by Chaitan Bharadwaj, who also composed Kartikeya's RX 100. The film is based on a true story and was released on 2 August 2019 to mixed reviews from critics.\n Cast Gaddala Gunta Radha gets revenge on a villager who killed a member of Radha's gang by assaulting the man's parents. He then warns nearby villagers that anyone who disrespects him will suffer the same consequences.\n Soundtrack Then, a man walks into a medical shop to purchase condoms. The shop owner takes a photo of the man and his girlfriend leaving on a scooter and sends it to Sashi's gang, who later tracks the couple down and rapes the girl.\n Reception Guna is a non-violent man who works with his closest friend Battu at a granite factory. While riding a scooter to attend to his B. Tech exams, Guna meets Geetha and falls in love with her at first sight.\n References Guna repeatedly causes his phone to malfunction to see Geetha, who works at a phone store. Guna gives Geetha compliments, who eventually reciprocates his love.\n External links"
}{
    "id": 81258622,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81258622",
    "name": "Miss India",
    "genre": "Dramas",
    "maturity": "U/A 7+ ",
    "duration": "2h 16m",
    "synopsis": "Uprooted to America, an aspiring Indian entrepreneur confronts disapproval, sexism and rivalry as she draws from her culture to start a tea business.",
    "related-genre": [
        "Dramas"
    ],
    "plot": "\n Plot Miss India is a 2020 Indian Telugu-language business drama film written and directed by Narendra Nath.  It stars Keerthy Suresh, Jagapathi Babu, Rajendra Prasad, Naresh, Nadhiya, and Naveen Chandra. The plot follows Manasa Samayuktha , a girl from a middle-class South Indian family, who dreams of having her tea business in the US. The film received negative reviews.\n Cast The film has been produced by Mahesh S. Koneru under East Coast Productions. Dani Sanchez-Lopez and Sujith Vaassudev handled the cinematography, while S. Thaman composed the music. The film was planned to be released on 17 April 2020 but has been postponed due to the COVID-19 pandemic. The film is released on Netflix on 4 November 2020 in Telugu along with dubbed versions in Tamil and Malayalam.\n Soundtrack Manasa Samyuktha , a woman with big goals from a middle-class family, moves to the USA after her brother Arjun  got a job. She dreams of starting up her own tea business as promised to her grandfather  to continue his legacy but her family does not agree due to financial problems. On the way to becoming a successful businesswoman, she is forced to deal with sexism, criticism, and rivalry with Kailash Sivakumar  . KSK is a dangerous rival coffee manufacturer who tries to put her down, saying that a woman can never be successful, especially in business. Manasa decides to beat him and show him that a woman can be anything she aspires to be. The story revolves around her journey and the problems she faces while she attempts to start up her business.\n Release The music is composed by S. Thaman and released by Aditya Music. The first single, \"Kotthaga Kotthaga\" written by Kalyan Chakravarthi and sung by Shreya Ghoshal and S. Thaman, was released on 7 February 2020. The next single \"Lacha Gummadi\" was sung by Srivardhini and released on 28 October 2020. The third single \"Theme of Miss India\" was sung by Harika Narayan and Sruthi Ranjani and was released on 29 October 2020. The album was released on 2 November 2020.\n References The film was released on Netflix on 4 November 2020 in Telugu along with dubbed versions in Tamil and Malayalam Languages.\n External links"
}{
    "id": 81473277,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81473277",
    "name": "Thimmarusu",
    "genre": "Dramas",
    "maturity": "U/A 13+ ",
    "duration": "2h 4m",
    "synopsis": "Eight years after a young man is framed for murder, an up-and-coming lawyer re-opens the case, beginning a tricky mission to find the real culprit.",
    "related-genre": [
        "Crime Movies",
        "Dramas"
    ],
    "plot": "\n Plot Thimmarusu: Assignment Valli is a 2021 Indian Telugu-language crime thriller film directed by Sharan Koppisetty and produced by Mahesh S. Koneru and Yarabolu Srujan under the production company East Coast Productions and S Originals. The film stars Satyadev, Priyanka Jawalkar and Ajay in lead roles. The film is the remake of 2019 Kannada film Birbal Trilogy Case 1: Finding Vajramuni, which itself is based on the 2017 Korean film New Trial. The music is composed by Sricharan Pakala. The film is named after Mahamanthri Timmarusu of the Vijayanagara Empire. The film was released on 30 July 2021.\n Cast The film begins with a man handing taxi driver Aravind, a police informant, a video of suspicious activity. Later that night, a man named Vasu drives across the road to see Aravind dead. Vasu is arrested by corrupt cop Bhupati Raju, who beats him up and frames him.\n Production 8 years later, once Vasu gets out on parole, Ramachandra, a lawyer takes up his case.\n Themes and influences Producers Mahesh S. Koneru and Yarabolu Srujan announced the film in early September 2020. It is Sharan's second directorial after Kirrak Party . Principal photography of the film was started in October 2020. The producers of the film announced in December 2020 that filming was nearing completion as they were projecting a release in January 2021. In an interview to Eenadu, Satyadev said that the filming was completed in 39 days within a single schedule . The film's original story writer M. G. Srinivas was constantly in contact during the production.\n Music Sangeetha Devi Dundoo felt that, in the story, Rashomon effect was used by the character Ramachandra, by which he tries to look at the crime from different points of views. In an article published by Firstpost, Hemanth Kumar wrote that the filmmaker draws parallels between historic figures  and present-day lawyers. Sibi Jeyya felt that the protagonist of the film, Ramachandra, has similar characteristic features, when compared to Sherlock Holmes. He further said that Sharan Koppisetty has taken much inspiration from the canon of Sherlock Holmes, written by Arthur Conan Doyle.\n Release Soundtrack album and film score is composed by Sricharan Pakala. The music rights were sold to Mango Music label. First single of the album, \"The Thimmarusu\", was released on 16 July 2021. The song was written by Kittu Vissapragada and features vocals of Raghu Dixit, Jyotsna Pakala, Ambika Sashittal and Yamini Ghantasala.\n Theatrical The film was earlier scheduled to release on 21 May 2021, which later was postponed due to COVID-19 pandemic in India. On 8 July 2021, it was announced that the film will be releasing on 30 July 2021. The same month, the film was certified by the Central Board of Film Certification for its release in India.\n Home Media The film's digital rights were sold to Netflix and the film is set to premiere on 28 August 2021.\n Reception Praising the performance of various actors, Sangeetha Devi Dundoo of The Hindu wrote that \"‘Thimmarusu’, the Telugu remake of the Kannada film ‘Birbal’, is tauter and leverages the strengths of its lead man, Satya Dev\". The Indian Express called it a \"convoluted thriller\" and commented that \"the storyline doesn’t always hold up or hold your interest all through as the narrative feels inconsistent and never fully satisfying. At times snail-paced and repetitive, the story takes its own sweet time to unfold\".\n Critical reception Writing for The Times of India, Sravan Vanaparthy stated: \"Thimmarusu is an earnest attempt and thrills in most parts, but is otherwise let down by a contrived screenplay and a hurried climax\" and gave a rating of three out of five. The Hans India too rated the film 3 out of 5 and wrote that \"Satyadev's performance, Brahmaji's humor, story, and twists are major highlights of this film\". A critic of Deccan Chronicle praised the film's cinematography, editing and music. He further added that the is a decent crime thriller with a unique backdrop and engrossing screenplay.\n Box office Pinkvilla wrote that \"With better writing, 'Thimmarusu' would have been a winner.\"\n References In its opening day, the film collected a distributors' share of ₹ 0.56 crore.\n External links"
}{
    "id": 81016194,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81016194",
    "name": "Spyder",
    "genre": "Telugu-Language Movies",
    "maturity": "U/A 16+ ",
    "duration": "2h 19m",
    "synopsis": "When an Intelligence Bureau officer’s phone-tapping day job leads him to a serial killer, he must track down and thwart the murderer’s next steps.",
    "related-genre": [
        "Action & Adventure"
    ],
    "plot": "\n Plot Spyder is a 2017 Indian action thriller film written and directed by A. R. Murugadoss and produced by N. V. Prasad. It is filmed simultaneously in Telugu and Tamil, and stars Mahesh Babu, S.J. Suryah and Rakul Preet Singh. Murugadoss wrote the Tamil dialogues while the Paruchuri Brothers wrote the Telugu version. The film was edited by A. Sreekar Prasad, with cinematography by Santosh Sivan, and the music composed by Harris Jayaraj. The movie follows Shiva, an Intelligence Bureau officer, who sets out to save the people of Hyderabad when he realizes that a psychopath is on the loose.\n Cast This film marks the Tamil debut of Mahesh Babu, after a failed attempt for a simultaneous release in Tamil for Brahmotsavam . Originally, the film was rumoured to be titled as Abhimanyudu and Sambhavami, before finalizing Spyder as the official title on 18 March 2017. The film began production in July 2016, followed by the commencement of the principal photography. Shooting mainly took place in Chennai, with some portions in and around Hyderabad and Vizag, while the songs were filmed overseas, before wrapping up in August 2017.\n Production Spyder was released theatrically worldwide in Telugu, Tamil, Arabic and Malayalam on 27 September 2017 and was also released in US and Gulf countries on 26 September .   The film received mixed reviews from critics and audience who praised for its cast performances , action sequences and direction but criticism for its writing and pace. It grossed ₹90 crore - ₹150 crore against the budget of ₹120 crore and the film was consequently a box office bomb due to the high production costs.\n Pre-production Shiva is an I.B. officer who spies on people's calls and messages to help them if needed. He developed a software to listen to the needy by tracking their phones. On the night of March 16, he listens to Charlie/Shalini talking about her wish on getting 98% in her exams from 96% to get a USA scholarship with her friend. In order to do that, she decides to go on a blind date with a guy believing it will help her concentrate on her studies. Shiva follows her and both start to fall for each other. However, he finds it hard to focus on his love life because of his job. On the night of 28 April, Shiva listens to a young girl asking her friend for help as she is alone in her house and scared, due to unavailability of electricity in her house, whilst everyone else on her street has the availability. \n Development Alarmed, Shiva sends his constable friend Renuka, to the girl's address as her aid. However, the next day, news headlines report about the gruesome death of the two women. Shiva visits the crime scene and resigns from the IB, due to guilt, but his father encourages him to find the killer. Shiva sets out to spy the girl's chats and whereabouts, where he finds out that a guy followed her at a café. Through Facebook, Shiva is able to track down another person who knew the stalker. With the provided information, he travels to the village where the stalker grew up and begins his search. From an elderly villager, Shiva finally learns about the man's past. Sudalai/Bhairavudu lived with his mother, father and a younger brother at a cemetery. \n Casting Sudalai/Bhairavudu's father had to do funeral rites for the dead to feed his family, but this occupation leads to Sudalai/Bhairavudu suffering from S.P.D. and develops an unusual desire to kill victims and watch the victims's families grieving. One day, a village kid witness him killing someone, where he reveals this to the villagers. The infuriated mob decided to burn Sudalai/Bhairavudu's house, killing his parents. Enraged, Sudalai/Bhairavudu left the village to continue his killing spree along with his younger brother. After a roller coaster chase in Wonderla, Shiva catches Sudalai/Bhairavudu and interrogates him in a dense hideout, but learns that he is actually Sudalai/Bhairavudu's brother. Sudalai/Bhairavudu comes on Live  and reveals he killed 23 people and hid their corpse in 23 pillars of a metro bridge, and threatens the citizens to leave his brother unscathed and also reveals that he plans to destroy a hospital. \n Filming Shiva kills Sudalai/Bhairavudu's brother in front of the 23 people's families, including an enraged Sudalai/Bhairavudu, who is hiding in the crowd. An upset Sudalai/Bhairavudu plans to kill Shiva's family, but Shiva finds out when his mother calls him and tells him she is scared because there is no electricity at their house whilst everyone else on the street does, exactly the same way as what the deceased girl had said earlier. With the help of his team members, Shiva is able to save his family; However, Shiva himself becomes Sudalai/Bhairavudu's next target, where he tries to kill Shiva on his way home, who is impaled on a truck. Shiva slowly recovers and resumes the search for Bhairavudu/Sudalai as he had shot him before he fell unconscious. Shiva deduces that Sudalai/Bhairavudu has hidden himself in a house where he can heal, but has imprisoned the owners. \n Music Through the use of technology and local ladies, Shiva finds Sudalai/Bhairavudu and arrests him, but Sudalai/Bhairavudu tells him that he had already planned a rock fall in the city. Shiva manages to stop the big rock whilst Sudalai/Bhairavudu escapes from police custody and continues with his plan to destroy a hospital. Charlie/Shalini learns about the targeted hospital, but refuses to tell Shiva due to a misunderstanding. Shiva tracks down her taxi, and she tells him about the hospital. Shiva rushes to the hospital and starts to evacuate the people inside, where he could save as many people as he could, but couldn't save some patients, which leaves him heartbroken. Sudalai/Bhairavudu sees Shiva's grieveness and becomes delighted. Shiva and Sudalai/Bhairavudu fight where Shiva overpowers and kills Sudalai/Bhairavudu and tells the media about the importance of helping others.\n Release Originally, Mahesh Babu planned to make his direct debut in Tamil, after the dubbed Tamil version of Srimanthudu , titled Selvandhan, received a decent response from audiences. He officially announced that his next film with Srikanth Addala titled Brahmotsavam , and produced by PVP Cinema, will be a bilingual shot simultaneously in Telugu and Tamil with the same title. After opining that the script has the potential to be commercially successful in both the languages without making many changes, Mahesh accepted the proposal of a Telugu-Tamil bilingual. However, the plan was later dropped.\n Distribution In November 2015, Mahesh Babu had announced for his next project directed by A. R. Murugadoss, which would be a Tamil-Telugu bilingual, marking Mahesh's first direct Tamil debut, as well as A. R. Murugadoss' return to Telugu cinema industry, a decade after his last film with the Chiranjeevi-starrer Stalin .\n Marketing The project was expected to kickstart the following year, with Santhosh Sivan, who worked with Murugadoss in Thuppakki , will be the cinematographer, and Harris Jayaraj, who scored music for Murugadoss' earlier films, Ghajini, 7aum Arivu and Thuppakki.\n Home media It was reported that Mahesh Babu will play the role of a police officer in the film, although reports claimed that Mahesh will play the role of a RAW agent. The title of the film was also rumoured to be Abhimanyu. However, in December 2016, the makers announced the tentative title of the film as Sambhavami, which received mixed response from fans. On 18 March 2017, the film's title was revealed to be Spyder.\n Reception In March 2016, Parineeti Chopra was initially signed to play the lead actress, making her debut in South Indian cinema. However, her non-availability of dates after she was finalised in the Sushant Singh Rajput-starrer Takadum , meant that the creators approached Rakul Preet Singh in the leading role. S. J. Surya, was hired to play a negative role for the first time after featuring in lead roles, marking his second collaboration with Mahesh Babu after directing him in Naani , although an actor this time. It is noted that Murugadoss was a former assistant of S. J. Surya in the films Vaali and Kushi. Tamil actor RJ Balaji, was signed in for the film, playing the role of Mahesh Babu's friend. In December 2016, Bharath was signed on to play a negative role.\n Critical reception Twin stunt choreographers Anbariv, were eventually roped in for the film to choreograph action sequences, although Peter Hein was roped in for the film. R. C. Kamalakannan, who supervised visual effects for Baahubali 2: The Conclusion , was roped in as a part of the technical crew. Kamalakannan claimed that the film has heavy visual effects, and a Russian principal studio was working on the film. Nayanthara was initially claimed to do a crucial role in the film, although Murugadoss denied it.\n Tamil version The film's principal photography commenced on 29 July 2016. Rakul Preet Singh joined the sets in August 2016, where the creators filmed a fresh schedule, focusing on the romantic scene between Rakul and Mahesh. The second schedule of the film, took place in mid-September 2016, in Pune and Bangalore, after the Chennai schedule was wrapped up. On 21 October 2016, Rakul Preet received a minor injury on her left hand, while shooting for an action episode. Although, the actress, who is advised to rest for a day, resumed shooting immediately. The third schedule of the film was kickstarted in Hyderabad in November 2016, with filming took place for three weeks. After wrapping up the shoot on 22 November, the team headed to Ahmedabad and Surat, for the fourth schedule. Mahesh extensively shot the schedule for two weeks. After a brief break, the makers resumed the shoot in Mumbai in January 2017, where the introductory scenes featuring Mahesh Babu, was being shot. During March 2017, Chiranjeevi made a visit to the sets of the film. More filming occurred in Vietnam between late March and early May. Some of the action scenes were shot there with local stunt artistes, such as the rollercoaster chase.\n Telugu version The final schedule of the film was expected to take place on 20 April 2017 in Hyderabad, although shooting started on 4 May 2017. Art director Rupin Suchak revealed to a source that 98% of the film was shot in Chennai, with the backdrop being changed to Hyderabad through computer graphics for the Telugu version. Mahesh did the film's stunts by himself without using body doubles. In some of the more intense scenes, he continued to perform his own stunts despite sustaining various injuries, leading to a physiotherapist being posted on set permanently for him, and eventually he \"couldn’t get up for a week after the shooting schedule\". On 16 May 2017, a source claimed that the makers planned for a climax sequence with high-octane action scenes, instead of a normal climax, which was originally scheduled to be shot at the NIMS Hospital in Bibnagar, Hyderabad, however, due to legal issues, the makers shifted the location to Chennai.\n Box-office As of May 2017, the makers had completed the talkie portions of the film, and only two songs were pending, the makers had started the post-production works. The entire filming was about to be completed by 2 June 2017. But, the final schedule was helmed on 13 June 2017, where the talkie portions will be filmed, and it is considered to be a minor schedule, with shooting to last for only four days. In July 2017, the makers filmed a song sequence in Hyderabad for ten days. The last song of the film was shot abroad on 2 August, and the principal shoot was wrapped following its completion.\n See also The film's soundtrack is composed by Harris Jayaraj, with lyrics for the Tamil version was written by Madhan Karky. Initially, Karky, was expected to pen the songs for its Telugu-dubbed version, thus marking his debut in the Telugu industry, however, Ramajogayya Sastry penned the songs in Telugu. In late June 2017, Brijesh Shandilya recorded one song for the film, which is touted to be \"ä desi romantic number\". While the Tamil version of the soundtrack, features only five tracks. The Telugu version has a sixth track named as \"Akkada Vunnavadu\". The film features a lead single \"Boom Boom\" from the soundtrack album, which was released on 29 July 2017 in Tamil and Telugu. The full soundtrack album was launched on 25 August 2017, at Kalaivanar Arangam in Chennai. The album was also released in Telugu the same day.\n Notes Indiaglitz rated the album 3 out of 5, and summarised that \"There is a strong Tamil flavour in all of the songs, with even traces of Harris' past works eminently noticeable.\" 123Telugu gave a positive verdict stating that \"Spyder’s audio album attracts the class audience and stands as a different album in Mahesh’s career.\" Karthik Srinivasan of Milliblog stated that the album is \"a predictable Harris Jayaraj package with two good-enough songs.\"\n References For the soundtrack of the Tamil version, Behindwoods rated the album 2.5 out of 5, saying, \"Though there is nativity missing for Tamil listeners, the album has Harris' usual western style music with superior sounding.\" Sharanya CR from The Times of India reviewed that \"Except for two songs, Harris doesn’t really up the magic quotient for SPYder.\" Moviecrow rated the album 3 out of 5 stating that \"Harris Jayaraj delivers an engaging album filled with the composer’s signature sounds throughout the soundtrack.\" Siddharth Srinivas from Sify gave 3 out of 5 stating \"Spyder is a lightweight, frothy soundtrack from Harris that's high on style but not too much on substance.\"\n External links"
}{
    "id": 81408627,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81408627",
    "name": "Red",
    "genre": "Dramas",
    "maturity": "U/A 16+ ",
    "duration": "2h 23m",
    "synopsis": "A murder investigation leads police to a photo of a suspect, but when two men are found with faces that match the picture, the case gets doubly tricky.",
    "related-genre": [
        "Crime Movies",
        "Dramas"
    ],
    "plot": "\n Plot Red is a 2021 Indian Telugu-language crime thriller film directed by Kishore Tirumala and produced by Sri Sravanthi Movies. It stars Ram Pothineni in a double role with Nivetha Pethuraj, Malvika Sharma and Amritha Aiyer. A remake of the Tamil film Thadam , it follows a murder investigation involving a civil engineer and his lookalike as prime suspects.\n Cast The film was announced in October, had its principal shoot commenced in November 2019 and ended in March 2020. Most of the film was shot in Hyderabad, except for two songs that were shot in Italy. Red has music composed by Mani Sharma while Sameer Reddy and Junaid Siddiquii performed the cinematography and editing, respectively. The film was released on 14 January 2021, coinciding with Sankranthi, after being delayed from its initial release date of 9 April 2020, due to the COVID-19 pandemic.\n Production Siddharth is an IIT graduated civil engineer running a successful building firm, while his lookalike, Aditya, is a gambling thief who deceives people along with his sidekick, Vema. Siddharth is in love with Mahima, while Gayathri loves Aditya, unaware of his real identity. One day, Aditya tries to help Vema pay his debt by extracting money from Gayathri through lies, but she helps him in spite of knowing the truth. After taking the money, Aditya is enraged, and so is Siddharth after a party. That night, one of them breaks into a house and attacks the owner, Akash, stabbing him to death.\n Development The next day, Aditya frees Vema by paying his debt and wins Gayathri's trust by returning her money and telling her the truth. As the investigation of Akash's murder proceeds, a selfie clicked by a couple nearby is found with either Siddharth or Aditya in it. Both of them are brought in and interrogated without knowledge of the other's presence. CI Nagendra, who shares an old rivalry with Siddharth, tortures him. Siddharth's alibi is that his car broke down, and as his car doesn't have the repair kit, he called a taxi driver to help him. Sub-inspector Yamini handles Aditya, who on the other hand, cites various laws to escape torture. She reaches out to Akash's friend and shows him the photograph of Siddharth/Aditya, but he refuses to recognize him. She also questions Vema and orders him not to leave the city without permission, but he secretly escapes.\n Filming Yamini then learns of the rivalry between Siddharth and Nagendra; Siddharth helped Nagendra's daughter elope with her lover against her father's wishes. The forensic expert informs Yamini about a hair sample recovered from the crime scene and how it doesn't match anyone else in Akash's home. At the police station, Siddharth tries to escape but is interrupted by Aditya. The two violently fight, hurting everyone and vandalizing the station in the process.\n Soundtrack Aditya and Siddharth are revealed to be identical twins after their DNA is found to be the same, and both confess their pasts: The twins parted ways in their childhood when their parents divorced. Aditya lived with his mother, who developed a gambling addiction to cope with her grief and anger over her difficult family and marital life, but wouldn't refuse anyone who asked for help. One day, Aditya's mother promised to give up gambling, but instead committed suicide. Aditya was then taken in by his father, who showed no love to him. As a result, he ended up developing the gambling addiction. One day, his father spotted him gambling and took him by force, whe got into a fight with him and Siddarth.  The twins then spent one year in a mental development institution due to anger management issues.\n Release Later, Aditya became interested in studying law but eventually left school due to his lack of college ethics. The duo separated once their dad died. Recently, when Aditya came home one day and left in front of Siddharth, his ring for Mahima went missing. Siddharth reported his brother to the police, who beat him up. Aditya himself told Siddharth where the ring was, causing Siddharth to realize his mistake. Aditya had actually come home for a photo of their mother, and vowed to seek revenge.\n Reception Nagendra still wants to frame Siddharth for Akash's murder, but the taxi driver who helped Siddharth confirms he was really stuck on the night of the murder. It is also proved that Aditya paid Vema's debt with gambling money he won after playing all night. The court acquits both Aditya and Siddharth in order to protect the innocent one from punishment. Nagendra voluntarily retires without getting his revenge. A disappointed Yamini later calls Akash's friend to inquire about a girl he was infatuated with, and is shocked to learn it was Mahima. Siddharth is finally revealed to have murdered Akash for drugging, kidnapping and raping Mahima to death out of a childhood lust. Akash had also bribed the police to avoid charges. When Aditya found out about the murder, he helped Siddharth by getting arrested as well to throw off the police.\n Critical response Later, Aditya meets with Siddharth and explains how Yamini can't reopen the case since she created a fake witness to help Siddharth and could get herself arrested, having been suspended once for doing this. Siddharth gives Aditya a photograph of them with their mother and says he is going to Mumbai, and later to Copenhagen, never to return. Having sold all of his property in India, Siddharth gives a 50% share to Aditya as a tribute. After his marriage to Gayathri, Aditya realizes his lack of trust in his mother, coupled with her family's, prompted her to kill herself. He promises to do better with his wife.\n References Seven months later, some of the investigating officers agree to appear in a documentary about the murder. One of the officers calls the case unprecedented, before a filmmaker tells him that similar cases occurred in other countries as well.\n External links"
}{
    "id": 81408626,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81408626",
    "name": "Amigos",
    "genre": "Telugu-Language Movies",
    "maturity": "A ",
    "duration": "2h 16m",
    "synopsis": "When a man discovers his two doppelgängers online, he finds new connections in life and love — but danger lurks when a hidden criminal past emerges.",
    "related-genre": [
        "Crime Movies",
        "Action & Adventure",
        "Comedies"
    ],
    "plot": "\n Premise Amigos is a 2023 Indian Telugu-language action-thriller film written and directed by Rajendra Reddy. The film features Nandamuri Kalyan Ram in a triple role as Siddharth, Manjunath Hegde, and Michael . The movie is directed by debutant Rajendra Reddy and produced by Mythri Movie Makers. Kalyan Ram plays the leading role while Ashika Ranganath and Brahmaji play supporting roles. \n Cast Following that the film was announced in August 2022, principal photography commenced in 27 August 2022 with filming taking place in various locations across India, including Hyderabad, Bangalore, Kolkata, and Goa. The soundtrack is composed by Ghiban  with cinematography by Soundararajan. Amigos was released on 10 February 2023, and received mixed reviews from critics.\n Music Siddharth Chiguluri finds about his doppelgängers Manjunath Hegde and Michael due to a website Doppel.com, where he calls them to meet each other at Goa. After introducing each other, the trio become friends and all goes well until Manjunath is suddenly encountered and subsequently detained by the NIA. It later appears that Manjunath was actually an international firearms and possible terrorist. It is revealed that Michael is Bipin Roy, a drug lord wanted by the NIA. Miachel used this doppelganger service to create the facade that he actually died, although he was actually planning to replace Siddarth entirely. Siddarth also learn about Michael's plan to use them as scapegoats and decides to foil his plans.\n Release The film score and soundtrack is composed by Ghibran. The first single titled \"Enno Ratrulosthayi\" was released on 31 January 2023. Original composition for the song was done by Ilaiyaraaja. Another single titled \"Yeka Yeka\" was released on 19 January 2023.\n Theatrical The film was released in theaters on 10 February 2023. \n Home media The satellite and digital rights of the film were acquired by Netflix and Gemini TV respectively. The film was digitally premiered in Netflix on 1 April 2023.\n Reception Amigos received mixed reviews from critics.\n Critical response Sangeetha Devi Dundoo of The Hindu  wrote \"Kalyan Ram does try to shoulder the proceedings, but had the writing been better, this could have been a gripping thriller drama. Ghibran’s soundtrack adds some drama but ultimately, Amigos ends up as an interesting idea that does not take off.\" Paul Nicodemus of The Times of India gave 3 out of 5 stars and wrote \"Overall, Nandamuri Kalyan Ram’s acting prowess and presence, with a touch of action and comedy, make this action thriller work in parts. His portal of Bipin stands out. It’s not a perfect film, but it has enough to keep the viewer engaged.\"\n References 123Telugu gave 2.75 out of 5 stars and wrote \"Amigos works to an extent and highly benefits from the excellent performance of Kalyan Ram. Ashika, Brahmaji, and others justified their roles. The film actually had more scope but it wasn’t utilized to the full extent. The film has a decent second half and a below-par first half.\"\nLatha Srinivasan of India Today gave 2.5 out of 5 stars and wrote \"At the outset, the storyline is interesting and, seeing the success of playing dual roles in Bimbisara, Kalyan Ram has gone the extra mile and played a triple role in this Amigos. Director Rajendra Reddy has tried to give all three men – Manju, Michael and Siddhu – different characterisations, but he has succeeded the most only with Michael, who has come scope for performance.\"\n External links"
}{
    "id": 81242575,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81242575",
    "name": "Major",
    "genre": "Dramas",
    "maturity": "U/A 16+ ",
    "duration": "2h 25m",
    "synopsis": "This biopic follows the life of Indian Army officer Major Sandeep Unnikrishnan, from his childhood to his heroic actions during the 2008 Mumbai attacks.",
    "related-genre": [
        "Movies Based on Real Life",
        "Action & Adventure",
        "Dramas"
    ],
    "plot": "\n Plot Major is a 2022 Indian biographical action drama film directed by Sashi Kiran Tikka with story and screenplay by Adivi Sesh. The film focuses on the life of Major Sandeep Unnikrishnan who was martyred in the 2008 Mumbai attacks, it stars Sesh as Unnikrishnan and co-stars Prakash Raj, Sobhita Dhulipala, Saiee Manjrekar, Revathi, Murali Sharma, and Anish Kuruvilla. Major is produced by G. Mahesh Babu Entertainment, Sony Pictures International Productions, and A+S Movies\n Cast Filmed simultaneously in Telugu and Hindi languages, it follows the personal and professional life of Sandeep Unnikrishnan. Principal photography began in February 2020 and ended in December 2021. Filming experienced delays owing to the COVID-19 pandemic. Made on a budget of ₹32 crore, it was shot in 120 days and was filmed in over 75 locations.\n Production Major had limited theatrical release on 24 May 2022 in selected cities across India and it was released worldwide on 3 June 2022. The film received positive reviews from critics.\n Development It became a commercial success grossing ₹64−66 crore worldwide and is one of the highest grossing Telugu films of 2022. The Hindi version is featured at the 53rd International Film Festival of India in the Indian Panorama section.In addition to being filmed in Telugu and Hindi, the film was also dubbed in Malayalam.\n Filming The movie starts with Sandeep Unnikrishnan entering the POK, which the Pakistani Army considers a threat and orders him to retreat. When questioned by the Indian Army Officials on why he did it and that the area belongs to Pakistan, he replies \"It is ours\". Young Sandeep grows up with his sister, Sandhya, and his parents K. Unnikrishnan and Dhanalakshmi, in Yelahanka, Bangalore. As a child, he was very curious about the world around him. When Unnikrishnan took him to see a Navy ceremony with military airplanes flying in the sky Sandeep developed an early fascination with the life of a soldier. In his later years as a secondary school student, Sandeep falls in love with his classmate, Isha. Sandeep applied to join the Indian Navy without telling his parents, much to the fury of Unnikrishnan. However, the Navy rejected Sandeep's application, causing Sandeep to ultimately join the army. As the years progressed, Sandeep rises  ranks to become an NSG training officer.\n Music In 2008, Sandeep is well established in his career as a training officer for the 51 Special Action Group of the NSG and is married to Isha, but their marriage is in trouble. Sandeep asks for leave to try and save his marriage. On the same day as Sandeep's leave though, Pakistani terrorists arrive in Mumbai by boat and they proceed to orchestrate deadly attacks in the city. Desperately crowds start heading to the Taj Hotel for safety but the terrorists also enter the hotel and start shooting at staff and guests spontaneously. The local police are called to the scene but they are ill-equipped to deal with the threat. Upon discovering the terrorist attacks in Mumbai, Sandeep requests Commander Shera to allow him to participate in the NSG mission to neutralize the terrorist threat. They leave for Mumbai and commence the military counterterrorism operation: Operation Black Tornado, but the NSG encounters numerous obstacles and problems upon arriving at the scene. They lack surveillance cameras to discover the number of people inside the building.\n Release The terrorists have installed deadly booby traps and trip wires with bombs throughout the premises. Several hotel staff and guests end up crowded together in a locked room, all bound and gagged on the floor. To make matters worse there is an intrusive media circus swarming outside the hotel reporting the NSG's known operations and movements, information which the terrorists use. Meanwhile, a guest named Pramoda Reddy, who is trapped on the fifth floor, manages to keep herself hidden from the gunmen. She ultimately takes responsibility to rescue British tourist's young daughter, named Shirley. Sandeep talks to Isha over the phone. She is applying for divorce and scolds Sandeep for not being there with her when she had a miscarriage, but she is horrified when she discovers that Sandeep is at the Taj Hotel. As the NSG rescue more hostages  and starts closing in on the remaining terrorists, Pramoda calls the downstairs lobby using a walkie-talkie from one of the dead security guards.\n Theatrical Sandeep ultimately decides to go to the 5th floor to save them, saying that he would never be able to forgive himself if he did not save her. His colleagues subsequently use tear gas and Sandeep races up to the 5th floor. He ultimately rescues Pramoda and Shirley and heroically kills some of the terrorists. However, when his CO asks him whether he needs reinforcement or not, he refuses. His last words are \"Do not come up, I will handle them.\" But as fate would have it, he is killed in action, laying down his life for his country. Major Sandeep's parents watch in horror as the news coverage shows that Sandeep was killed in action. They had thought that since Sandeep was a training officer he was not involved in the rescue mission at the Taj Hotel. After his death, there is a large military funeral and a crowd of well-wishers gather to mourn Sandeep's passing. Isha is devastated at Sandeep's death and discovers that he never signed the divorce papers. Later, a 10-year commemoration ceremony in 2018 honoring the lives taken during the attack is held at the Taj Hotel. During the commemorations, Pramoda is reunited with Shirley whose life she had saved. Mr. Unnikrishnan gives an impassioned speech in which he says that Sandeep should be remembered not for how he died, but for how he lived.\n Home media As Unnikrishnan recalls during his speech, a flashback shows the continuation of the beginning of the movie. It is shown that Sandeep was playing cricket with the children from Pakistan, and when he was called back, he waves goodbye and promises the children that he would come to play another time.\n Reception Sony Pictures Entertainment has registered two titles, Major and Major Sandeep with the producers' association, in their endeavour to make a biopic on his life. The studio entered talks with the family of Major Sandeep in January 2019 to get the rights with an aim to pay tribute to the soldier's life. The film was announced in February 2019, with Adivi Sesh in the lead role. The film is produced by actor Mahesh Babu under his studio G. Mahesh Babu Entertainment, in a collaboration with Sony Pictures International Productions and A+S Movies. Major is shot simultaneously in Telugu and Hindi languages. Despite consisting of a predominantly Telugu cast and crew, director Sashi Kiran Tikka said that they opted to shoot the film in Hindi as well since the film is set in North India where Hindi is the dominant language.\n Critical reception Principal photography began in February 2020. But the filming was put on hold in March 2020 due to the COVID-19 pandemic in India. By September 2020, more than 50% of the film had been shot, and further shooting is planned to take place in Hyderabad in October 2020. Sobhita Dhulipala filming completed her portions in November 2020. In August 2021, Sesh began filming the final schedule of the film. In December 2021, the shooting of the film was completed and the post-production work began with Sesh dubbing for the Hindi version. Major was shot in 120 days and was filmed in over 75 locations.\n Box office The film score and soundtrack album of the film is composed by Sricharan Pakala. The music rights were acquired by the Zee Music Company. The first single titled \"Hrudyama\" was released on 6 January 2022. The second single titled \"Oh Isha\" was released on 18 May 2022.\n References \n External links"
}{
    "id": 81643804,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81643804",
    "name": "Hushaaru",
    "genre": "Telugu-Language Movies",
    "maturity": "U/A 16+ ",
    "duration": "2h 22m",
    "synopsis": "Four best friends make the most of their youth — until an unexpected hospital bill forces the group to turn their love of drinking into a profit.",
    "related-genre": [
        "Comedies"
    ],
    "plot": "\n Plot Hushaaru  is a 2018 Indian Telugu-language coming of age adult comedy film written and directed by Sree Harsha Konuganti. It stars Tejus Kancherla, Tej Kurapati, Dinesh Tej, Abhinav Medishetti, Rahul Ramakrishna, Daksha Nagarkar, Priya Vadlamani, Hemal Ingle and Ramya Pasupuleti.\n Cast Four engineering graduates from middle-class families Arya, Chay, Dhruv and Bunty are clueless about their lives but enjoy being in each other's company, making the most of their energy. Just when things are going smooth, a personal setback hits them hard. How they rise above it and help their friendship stand the test of character and time is the story of Husharu.\n Soundtrack The songs were composed by Sunny M.R., Radhan, and Varikuppala Yadagiri.\n Release The film was scheduled to release in August 2018 before being postponed to December of that same year. Raj Surya is directing the Kannada remake of the film starring Chandan Achar, Anup Revanna and Shrimahadev.\n Reception The Times of India gave the film a rating of three out of five stars and wrote that \"Hushaaru is mostly refreshing, captures the humorous side to friendships with zest\". Asianet News Telugu gave the film 2.5 of 5 and appreciated the film's screenplay. 123Telugu also gave 2.5 out of 5 and wrote that \"Husharu is a routine youthful drama which has a few likable moments.\"\n Critical reception The film grossed ₹5 crore in five days, and ran for 50 days in theatres.\n Box office"
}{
    "id": 81075235,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81075235",
    "name": "Sarkar",
    "genre": "Dramas",
    "maturity": "A ",
    "duration": "2h 41m",
    "synopsis": "A ruthless businessman’s mission to expose electoral fraud brings him into a heated and dangerous political conflict with two corrupt ministers.",
    "related-genre": [
        "Action & Adventure",
        "Dramas"
    ],
    "plot": "\n Plot Sarkar  is a 2018 Indian Tamil-language political action film written and directed by A. R. Murugadoss, and produced by Kalanithi Maran of Sun Pictures. The dialogues were co-written by Murugadoss and B. Jeyamohan. The film stars Vijay, Keerthy Suresh and Varalaxmi Sarathkumar while Yogi Babu, Radha Ravi, and Pala. Karuppiah play supporting roles. It follows Sundar Ramaswamy, an NRI who arrives in India from US to cast his vote in the election, only to find that his vote has already been recorded as cast. Sundar raises awareness against electoral fraud among the masses and decides to contest as a non-partisan politician in the elections amidst several attempts made on his life and reputation.\n Cast Principal photography for Sarkar began in January 2018. Murugadoss collaborated with Vijay for a third time with Sarkar, which was the latter's 62nd film and given the tentative title of Thalapathy 62. In early December 2017, Sun Pictures agreed to produce the film. While Girish Gangadharan handled the cinematography, A. Sreekar Prasad served as the editor. In August, a few scenes were shot at Las Vegas. Filming was completed by September 2018. The film's soundtrack was composed by A. R. Rahman with lyrics written by Vivek.\n Production After various complications, including protests and allegations of plagiarism, Sarkar was released on 6 November 2018, during the week of Diwali. It received mixed to positive reviews from critics and audience. Post-release, the film involved in controversies with  reference to J. Jayalalithaa in the audio track and other sequences from the film led to protests by members of the All India Anna Dravida Munnetra Kazhagam. After lawsuits were registered against the makers, the said allusions were muted. Sarkar has grossed  ₹243.4−250 crore  worldwide in its entire run, and emerged as a commercial success.\n Development Sarkar became Vijay's third film to collect $1 million at the US box office, following Theri and Mersal. As a result of the film's success, the Election Commission of India created awareness regarding Section 49P of the Conduct of Elections Rules, 1961 that allows a voter to have the right to get back his/her ballot back and vote if someone else voted in that individual's name. Sarkar was screened at Grand Rex, France. It was also screened in Japan.\n Casting Sundar Ramaswamy is a highly successful NRI businessman based in US, referred to as a corporate monster due to his ruthless business dealings. He arrives in Chennai to cast his vote in the Tamil Nadu Legislative Assembly election. However, he finds that someone else had already voted in his place. Sundar approaches the Tamil Nadu State Election Commission and demands a stay on the election result for his constituency, an annulment of the fraud elector's vote, and the ability to legitimately cast his vote, to which they agree. He raises awareness among the public regarding fraud voting and finds that many people too faced a similar problem to his when trying to vote. M. Masilamani, the previous C.M of Tamil Nadu, is re-elected, his daughter Komalavalli, and fellow politician and brother Malarvannan \"Rendu\" celebrate.\n Filming Sundar visits his family, whilst rekindling with Nila, who is his brother's estranged sister-in-law. Meanwhile, Masilamani receives suitcases full of black money, as he discovers a journalist, Muthukumar, hiding inside the suitcase, to record evidence of his corruption, and Masilamani kills him and buries the case. Sundar's actions bring him into conflict Masilamani and Rendu. Although Masilamani's party wins the elections, the Election Commission annuls the result based on Sundar's plea to recount the votes, and fresh elections are scheduled to take place within the next 15 days. After many assassination attempts on him by Rendu's henchmen, Sundar decides to contest the election against Masilamani as an Independent candidate and resigns from his company to avoid any conflict-of-interest. Initially unpopular among the masses due to his corporate background, Sundar delivers a speech detailing his rise from a humble fisherman background to a businessman and his struggle from poverty to riches, gaining massive support.\n Music Sundar and his supporters gatecrash an event involving the merger of Masilamani's party with the opposition. After Sundar confronts Masilamani regarding his silence on district-related issues, the police brutally beats up Sundar and his supporters. At this juncture, he realises that the entire political system in the state and country needs reform, so he decides to contest in all constituencies in Tamil Nadu along with his supporters. Sundar acquires video evidence wherein people who had attempted to expose Masilamani's corruption were killed under mysterious circumstances, and he plans to reveal it to the media to discredit Masilamani and have him arrested. Meanwhile, Masilamani's daughter Komalavalli, based in Canada, arrives in Chennai after finding out that her father and uncle have lost support due to Sundar. She decides to spoil Sundar's reputation and frame him as a corrupt and power-hungry person.\n Marketing and Release Komalavalli orchestrates a car accident, planting a case of money, which is stolen by a mysterious person, blaming Sundar for the accident, which causes him to lose considerable public support. She furthers her agenda by killing her father with an overdose of diabetic tablets so that her party will gain sympathy votes. These crimes ensure that Komalavalli, the new Chief Ministerial candidate for her party, would likely win the election. On Election Day, Twitter messages generated from Muthukumar allege that Sundar has stashed black money in various locations, which further degrades Sundar's reputation. However, unknown to anyone, the tweets were sent by Sundar himself, as Muthukumar was one of those activists killed by Masilamani. Further messages lead to Muthukumar's decomposed body being found, exposing Komalavalli's lies.\n Box office Meanwhile, Komalavalli finds out that her mother has decided to expose her role in Masilamani's death at the latter's memorial in front of the media later in the day. She arrives at the memorial with her henchmen to stop the expose, but Sundar subdues her henchmen, and her mother's confession is live-streamed, which ensures that the public support is back with Sundar. Sundar and his supporters win the election, while Komalavalli and Rendu are arrested for their various crimes. However, Sundar decides against becoming the Chief Minister, and instead chooses one of his supporters, an honest collector, to be the next Chief Minister.\n Reception Real-life activists such as Kalki Subramaniam, Piyush Manush and Fatima Babu made cameo appearances as themselves in the song \"Oru Viral Puratchi\".\n Political controversies Following the successful ventures, Thuppakki and Kaththi, AR Murugadoss was confirmed to be the director of the 62nd film of actor Vijay. The project, tentatively titled Thalapathy 62 , was slated to enter production once Vijay completed Mersal and Murugadoss completed Spyder. In early-December 2017, T. Santhanam was confirmed as the art director of the film, and following this, it was made official that Sun Pictures was producing the film. Girish Gangadharan was chosen in as the cinematographer. A. Sreekar Prasad, who had previously edited Thuppakki and Kaththi, was the film's editor. B. Jeyamohan was recruited as writer, and shooting began in January 2018. The title Sarkar was revealed on 21 June 2018, ahead of Vijay's birthday.\n Plagiarism allegations In mid-November 2017, it was reported that actor Yogi Babu was in talks to play a role in the film, and actress Nayanthara was in talks to be the female lead. Jaswanth Khanna, son of comedian Ramesh Khanna, who had worked as an assistant director, made his acting debut with this film. Keerthy Suresh was later signed to play the female lead role, marking her second collaboration with Vijay after Bairavaa . Varalaxmi Sarathkumar was also confirmed, playing a pivotal role.\n Awards and nominations Principal photography began in January 2018. The team had successfully completed the first and second schedules of the shoot, and they began their third schedule in Las Vegas in early August. Shooting wrapped in early September.\n Impact The music and score of the film are composed by A. R. Rahman with lyricist Vivek penning the songs. The full audio album was launched on 2 October 2018 at Sai Leo Muthu Auditorium, Sri Sai Ram Engineering College, Chennai. The album consists of five songs, all penned by lyricist Vivek. The team launched the very first single, \"Simtaangaran\", which received mixed reviews, on 24 September, followed by \"Oru Viral Puratchi\" on the last day of the same month of September, which too received positive reviews. The album in its entirety was made available for download in digital on 2 October. The promotional music event featured dance performances for the songs in the background. The soundtrack album was released and bagged under the Sony Music record label. After a few days, the single track was released.\n In popular culture Sarkar is Rahman's fourth collaboration with actor Vijay, after Udhaya, Azhagiya Tamil Magan, and Mersal. The audio release event of the film was conducted in a much peculiar way, where for the very first time, the audience were given the privilege of launching the music album online by the means of the production company's website. The audio launch event held a live telecast aired on Sun TV, and on their exclusive paid service called SunNXT. Indiaglitz gave a 4 out of 5 star rating but cited: \"Sarkar though rich in techno and electronic treatment, finds a winning combo with its amazing lyrics\". Studioflicks mentioned \"A mix of local and western flavour from A. R. Rahman\", giving it a rating of 3.25 out of 5. Behindwoods gave it 2.75 out of 5 stars and stated: \"A. R. Rahman goes full-on techno for Sarkar \".\n Notes The film's teaser was released on October 19, 2018 and gained one million views within one hour of its release and \"broken several records and turned out to be the fastest promo video to touch the one million mark\".\n References Sarkar was released on 6 November 2018, during the week of Diwali. The film released in an unprecedented way for a Tamil film by releasing on a Tuesday. The film opened in 3,400 screens worldwide. Additionally, the film released to the Tamil speaking Indian Diaspora in 80 countries with 1,200 international screens. The film's overseas distributors have ensured that the film releases in as many as new markets such as Poland, Mexico, Philippines, New Zealand, Ukraine, Russia, and several countries in the African continent. The Kerala fans of the actor erected a 175 feet tall cut-out of the actor, the tallest cut-out for a film actor in Kollam. After its theatrical premiere, the film was made available for streaming on Sun NXT and Netflix.\n External links"
}{
    "id": 81258580,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81258580",
    "name": "Saakini Daakini",
    "genre": "Telugu-Language Movies",
    "maturity": "U/A 13+ ",
    "duration": "1h 55m",
    "synopsis": "Awkward situations abound when two women become cadets at a male-dominated police academy, but the crime they uncover may be their biggest test of all.",
    "related-genre": [
        "Crime Movies",
        "Action & Adventure",
        "Comedies"
    ],
    "plot": "\n Plot Saakini Daakini is a 2022 Indian Telugu-language action comedy film directed by Sudheer Varma and produced by Suresh Productions, Guru Films, and Kross Pictures. An official remake of the 2017 South Korean film Midnight Runners, it stars Regina Cassandra and Nivetha Thomas. The film has music composed by Mikey McCleary.\n Cast Principal photography took place from March 2021 to August 2021, entirely in Hyderabad. Saakini Daakini was released theatrically on 16 September 2022.\n Production Shalini and Damini, two police trainees from differing backgrounds, become fierce rivals after their induction into the academy and their placement in the same room. Their conflict eventually escalates into a full-blown brawl that nearly leads to their suspension. However, after Shalini helps an injured Damini during a forest run challenge when no one else does, their conduct is commended and they become best friends.\n Release One day, they witness a kidnapping of a girl on their way back from the club at midnight. The local police station's missing persons department, however, is busy with the kidnapping of a son of a businessman at the time and is unable to investigate the case. Knowing that they are in the critical hours after a kidnapping, they embark on their amateur investigation.\n Theatrical When Shalini and Damini catch up with the kidnappers, it appears that the gang is running an unfertilized egg harvesting ring and there are many more girls locked up at their hideout. Shalini and Damini tries to save them but are instead beaten and locked up. After escaping their captors, they return the next day to an empty hideout and a cold trail. As they are not acting police officers, their professor tells them not to pursue the case any further. Unable to wait for the bureaucracy to resolve the case, they once again embark on their own investigation.\n Home media They undergo heavy physical training and manage to track the kidnappers down, with the help of CCTV footage, to a fertility clinic. Armored up with weapons, the duo venture in to liberate the girls by themselves, this time much more prepared. They successfully take down all the kidnappers and their boss and save all girls. However, due to some among the disciplinary committee believing that they had done the right thing morally, they are instead held back a year in their studies and start training from beginning.\n Reception In January 2020, producer Suresh Babu acquired the remake rights of the South Korean film Midnight Runners in a collaboration with the Seoul-based Kross Pictures. Director Sudheer Varma was signed to helm the remake in the same month. Actress Regina Cassandra and Nivetha Thomas were signed to play lead roles in August 2020. The film has music  composed by Mikey McCleary.\n References The film commenced its principal photography in March 2021 but was halted due to the COVID-19 pandemic. Final schedule resumed in July that year with shoot wrapping up in August 2021. The film's title was confirmed as Saakini Daakini in November 2021.\n External links"
}{
    "id": 81231988,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81231988",
    "name": "Uppena",
    "genre": "Dramas",
    "maturity": "U/A 16+ ",
    "duration": "2h 24m",
    "synopsis": "The son of a fishing community falls for a village head's daughter, but they face violent opposition from the girl’s doggedly old-fashioned father.",
    "related-genre": [
        "Dramas",
        "Romantic Movies"
    ],
    "plot": "\n Plot Uppena  is a 2021 Indian Telugu-language romantic drama film written and directed by debutant Buchi Babu Sana. Produced by Mythri Movie Makers and Sukumar Writings, it stars debutants Panja Vaisshnav Tej and Krithi Shetty alongside Vijay Sethupathi in a prominent role. Set in Kakinada, the plot follows fisherman Aasi, who falls in love with Bebamma. Her father Raayanam is an influential zamindar, who fiercely protects his daughter to safeguard his family's honour.\n Cast After a launch ceremony in January 2019, the makers commenced the principal shoot in May 2019, with film being shot in Kakinada, Hyderabad, Puri, Kolkata and Gangtok and wrapped up in January 2020. The music is composed by Devi Sri Prasad, with cinematography and editing by Shamdat and Naveen Nooli respectively. The film was originally slated to release on 2 April 2020, but was postponed due to the COVID-19 pandemic. The film is released theatrically on 12 February 2021 and was commercially successful at the box office. Uppena emerged as the highest-grossing Telugu film for a debut actor, surpassing the record of Chirutha .\n Production Set in 2002 in the village of Uppada near Kakinada, Raayanam is an influential zamindar who goes to any extent to safeguard his family's honour. His daughter Sangeetha, fondly called Bebamma is a college student whom he fiercely protects. Raayanam plans to build a shipping yard in his village by razing fishermen's houses on the coast. Aasi is the son of one such fisherman Jalayya, and is a Dalit Christian. He falls head over heels for Bebamma. Bebamma also begins to like Aasi after watching him fight in the bazaar. Aasi follows Bebamma daily en route to her college on the bus. One day, the bus breaks down and the driver asks Aasi to drop Bebamma, the only passenger of the bus, at college. Later, the couple begins to meet daily at the beach and soon fall in love with each other.\n Development Meanwhile, the breeding season of the fish arrives and no one is allowed to venture into the sea for over a month and a half. Bebamma, however, asks Aasi to take her into the sea, which he obliges. As the boat runs out of fuel, they get stuck in the sea. On the same night, Raayanam orders to raze the houses on the coast but he is worried that his daughter hasn't returned home. Raayanam secretly meets Jalayya and asks him to find his missing daughter, in exchange, his house will be spared. Aasi and Bebamma spend the night together on the boat intimately. Jalayya finds them the next morning and admonishes Aasi. He returns Bebamma to her father but lies that she was found alone on the boat.\n Casting Raayanam, however, is determined to find Bebamma's partner. He finds a shirt in Bebamma's wardrobe by which he tracks him down as Aasi. Raayanam's men attack Aasi and his father at the village mela, and Jalayya dies in strife. The following day, Bebamma runs away from her house and asks Aasi to elope with her. He reluctantly agrees, and they board a train to Odisha escaping Raayanam's men. From there, the couple travels to Kolkata, and later to Gangtok. Aasi picks up odd jobs and keeps Bebamma in a hostel until they move in together.\n Filming Several months pass by. Raayanam has promised his sister that her son shall be married to Bebamma within six months. All the days when Bebamma is away, Raayanam and his men pretend as if she was there to save his family's honour. Nearly six months after they elope, Aasi promises to marry Bebamma and takes her to a railway station. There, Raayanam's men kidnap Bebamma and bring her back to her father. Bebamma confesses to Raayanam that she had sex with Aasi that night on the boat and pleads to let her go. But Raayanam doesn't budge saying he would never let his daughter marry a lower caste, which he considers a dishonour. He says it was Aasi who disclosed their location to him. Raayanam also reveals that he physically emasculated Aasi by chopping his penis off and his father dying of a heart stroke by seeing that the night before Bebamma and Aasi eloped. Raayanam believes she would not go back to Aasi because he has lost his manhood. However, Bebamma loves Aasi as a person, regardless of what he did to him. She says neither Raayanam nor Aasi is the one who can judge the manhood of a person. Bebamma adds that manhood is not related to any organ but to a man's personality. Raayanam is moved and lets her go. Bebamma and Aasi reunite.\n Music In mid-October 2018, Sukumar decided to back the project of the untitled film, helmed by his former assistant Buchi Babu Sana, in his directorial debut. Mythri Movie Makers, eventually collaborated with Sukumar Writings, the director's home banner, to co-produce the film. The makers roped Panja Vaisshnav Tej to play the lead role, marking his debut in film industry, and Sukumar's regular collaborator Devi Sri Prasad, was roped in to score music for the film.\n Themes and influences The film is reportedly set in backdrop of Kakinada, Andhra Pradesh, and deals with the issue of honor killings, with Vaisshnav Tej, essaying the role of a fisherman. On 6 May 2019, the makers revealed the film's title as Uppena. Initially, it was speculated that the film would be titled Jalari, the title Uppena was finalised and registered in the Film Chamber.\n Release In an interview, director Buchi Babu revealed that he wrote the story with an empty mind. Then, he decided to bring in Vaishnav Tej as he wanted a newcomer for the film and chose Vijay Sethupathi as he wanted someone who would take the film pan-India.\n Distribution In March 2019, Vijay Sethupathi was roped in to play the antagonist, in his second Telugu film after Sye Raa Narasimha Reddy. In April 2019, the production house confirmed his inclusion in the film. Sethupathi was reported to play the heroine's father in the film. In July 2019, sources claimed that Sethupathi walked out of the project, and the reason was not disclosed. However, the rumours turned out to be false.\n Home media Initially, debutant actress Manisha Raj was announced as the lead actress during the film's launch event. However, the makers approached another teenage debutant Devika Sanjay , to play the lead role opposite Tej. In May 2019, the makers roped in Mangalore-based Krithi Shetty, to make her debut through this film.\n Marketing The launch event of the film was held on 21 January 2019, at the office of Mythri Movie Makers, with Vaisshnav Tej's relatives, including actors Chiranjeevi, Nagendra Babu, Allu Aravind, Allu Arjun, Sai Dharam Tej, Varun Tej, Niharika Konidela, among others, attending the event. Four months later, the principal photography of the film started on 25 May 2019. The film was shot for 35 days in Kakinada. On 21 August 2019, Vijay Sethupathi joined the sets and it was reported that 40 percent of the film was completed. The film was later shot in Hyderabad, which was completed in late-September 2019. The second schedule took place in October 2019 for 90 days at Puri, Kolkata and Gangtok. Few scenes were shot at Jagannath Temple, Puri. In January 2020, the makers completed the shooting of the film and started post-production work.\n Reception After Tamil actor Sethupathi deciding not to dub for his character in Telugu language citing his voice might not suit the character, director Buchi Babu Sana hired P. Ravi Shankar for the dubbing of the character. He completed the dubbing work in three days in Hyderabad. Majority of the post-production work was completed by June 2020.\n Critical reception The soundtrack album and background score is composed by Devi Sri Prasad in his eighth collaboration with Sukumar. needed] The soundtrack album was released on 17 February 2021 during the success meet of the film at Rajahmundry, Andhra Pradesh. The album was a huge hit, especially \"Nee Kannu Neeli Samudram\" and \"Jala Jala Jalapaatham Nuvvu\" tracks received wide response and were featured in national music charts.\n Box office The film showcased many social issues that were common in India, like, honor killings, casteism, economic inequality, etc. A reviewer of TeluguCinema described that \"'Uppena' talks about two things in particular – paruvu  and magatanam . At the very beginning of the story, Babyamma’s teacher explains the true meaning of a being man. When the girl students laugh at the picture of a male organ, the lecturer gives a new definition of manliness.\" Another reviewer from IndiaGlitz stated \"The 'magathanam' reference is integral to the story of the film. Many are of the view that the film is going to spark a change in the way masculinity is projected in Telugu movies. A number of Netizens have felt that toxic masculinity will give way to healthy masculinity in our movies now that 'Uppena' is on its way to becoming a blockbuster.\"\n Accolades Director Buchi Babu Sana in an interview to The Indian Express said – \"We might not talk about it or put it across in as many words, but casteism is an intrinsic part of our lives. You can see it in the way people interact with others who are from a different caste. The whole idea of Uppena is to drive home the point that love is beyond all these boundaries of casteism and class.\"\n Remake Priyanka Kanoj of International Business Times asked about film's story being similar to 2016 Marathi film Sairat, to which Tej replied – \"Sairat is one of the most amazing movies I've watched. The actors, the establishment of roles, etc can be termed as brilliance. I would definitely not draw any comparison between Sairat and Uppena. Of course, there are a number of movies with the same storyline, dealing with love and honor killing. But, the audience will definitely know that Uppena is a genuine story.\"\n Notes Uppena was originally scheduled for a theatrical release on 2 April 2020, on the occasion of Rama Navami. But the release was postponed due to the COVID-19 pandemic lockdown in India. In May 2020, the makers reported that the film would not be released through OTT platforms, although digital rights of the film were sold to Netflix. After theatres began operating with 50% occupancy, the makers announced a release date of 12 February 2021, which falls on the Valentine's Day weekend.\n References Initially, in March 2020, the total pre-release business of the film was reported to be ₹15 crore. Later, in February 2021, the total pre-release business of the film was reported to be around ₹20.5–22 crore. The theatrical rights in Nizam, Ceded and Uttarandhra regions were acquired for ₹6, ₹3 and ₹10 crore respectively, with an overseas and the rest of India were at ₹1.5 crore together. Dil Raju–owned Sri Venkateswara Creations distributed the film in the Nizam region. Great India Films have acquired the theatrical distribution rights in the United States.\n External links"
}{
    "id": 81500352,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81500352",
    "name": "Tughlaq Durbar",
    "genre": "Dramas",
    "maturity": "U/A 13+ ",
    "duration": "2h 25m",
    "synopsis": "A budding politician has devious plans to rise in the ranks — until an unexpected new presence begins to interfere with his every crooked move.",
    "related-genre": [
        "Comedies",
        "Dramas"
    ],
    "plot": "\n Plot Tughlaq Durbar  is a 2021 Indian Tamil-language political satire film written and directed by Delhi Prasad Deenadayalan, on his directional debut, with screenplay and dialogues written by Balaji Tharaneetharan. The film stars Vijay Sethupathi, Raashii Khanna, R. Parthiban, Manjima Mohan, Karunakaran, Bagavathi Perumal and Rajkumar. The music of the film is composed by Govind Vasantha, with Manoj Paramahamsa and Mahendiran Jayaraju handling the cinematography and R. Govindaraj edited the film.\n Cast The film had a direct-to-television premiere on Sun TV during Ganesh Chaturthi  and released on Netflix, the following day to mixed reviews.\n Production In 1986, Rayappan, a Tamil Nadu MLA of the ruling party, is delivering a speech at J.K. Nagar, an impoverished suburb in Chennai, where one of the attendants, a pregnant woman, goes into labour. As a publicity stunt for creating sympathy, Rayappan orders his men to help the woman by lending their dhotis. The woman gives birth to a boy, whom Rayappan christens as Singaravelan, or \"Singam\" on the stage. Singam grows up as an orphan as his mother had died shortly after the birth of his younger sister, Manimegalai, followed by the death of his father due to overdrinking. Singam's relationship with Manimegalai is quite fraught and strained as the former blames her for their parents death and the latter disapproves of the former's obsession towards Rayappan, for whom he even sold her mother's only nosepiece for party promotions. This led them to not be on talking terms for 20 years.\n Music In 2021, Rayappan, now a powerful and influential politician, begins scouting for a suitable candidate to work as a councillor for J.K. Nagar. Vying for attention, Singam strives to seek Rayappan's consideration by performing a media stunt by drinking poison in front of press during Rayappan's arrest and gains his trust, much to the irritation and dismay of Mangalam, Rayappan's right-hand man, who is also vying for the position. Singam manages to emerge as Rayappan's favorite within a short span of time by employing hilarious techniques and his friend Vasu's ideas. Frustrated at being sidelined, an infuriated Mangalam brandishes a bottle at Singam's head; he is subsequently expelled from the ruling party for his ruthless behavior.\n Release Shortly after the incident, Singam develops an alter ego, presumably from his injuries who does quite the opposite of Singam's doings. The next day he gets nominated for the counsellor chair, but beforehand, Rayappan asks for 50 lakhs as a deposit for his post, which he got from duping Kamatchi, a wealthy daughter of a moneylending businessman who Singam initially kidnapped with Vasu as a pawn for extorting money from her father with the help of Vasu's hired goons, only to be saved by his alter ego who first resurfaces by thrashing the goons and saving her. During elections, both Singam and Mangalam try various corrupt tricks to lure the voters and increase their vote bank. Initially, Singam is lagging behind in public opinion and votes due to the lack of money power but manages to gamble on the sympathy by intentionally carrying a pregnant woman Shanti in front of the people to gain voters recognition and trust of the people, much to the horror and dismay of Vasu, but Singam ultimately beats Mangalam to become the new counsellor of J.K Nagar.\n Reception Now enters Damayanthi and Mayor into the fray, who run an illegal construction and money laundering firm for corporate companies under the pretext of NGO named Aashirvaad Foundation. They initially sign a contract with Singam under Rayappan as a mediator for evacuation and demolition of J.K Nagar and offer 50 crores as advance as a bribe. But in the wake of the night, Singam's alter ego again resurfaces and leaks the document to media framing Rayappan, Singam and the ruling party under corruption case. An agitated Rayappan calls for an urgent party meeting to catch the culprit but is shocked to see the vigilante masked in CCTV. He then orders Singam to check the whereabouts of the money hideout, only to find the mask used by the vigilante in there. Now begins the cat and mouse game between Singam and vigilante Singam who flunks out what corrupt Singam's plans to do using various tactics and even causes a distrust with Vasu, who leaves him after seeing his evil intentions and Rayappan questioning his loyalty.\n References Finally, after getting convinced by the evidence found against Singam, Rayappan deduces that Singam is the masked vigilante who has conked all his wrongdoings and orders his henchmen to abduct him, only to be caught red-handed by the income tax department while exchanging money due to the intelligence of the vigilante Singam. After investigations, it is found that Singam handed over only 1/5th of the money. After being bailed out by Kamatchi, who comes across the truth about him and breaks up with him angrily for playing with her emotions. Meanwhile, an angry and denounced Rayappan orders his henchmen to kill Singam in his own area as a statement for betrayal, only to be saved by Lakshmi  and his area people, but not before passing out due to fatal injuries sustained.\n External links"
}{
    "id": 70125781,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70125781",
    "name": "Ready",
    "genre": "Telugu-Language Movies",
    "maturity": "U/A 13+ ",
    "duration": "2h 52m",
    "synopsis": "A young man finds romantic misadventure when he tries to help his pal’s girlfriend escape an arranged marriage — and rescues the wrong bride.",
    "related-genre": [
        "Romantic Comedies",
        "Action & Adventure",
        "Comedies",
        "Romantic Movies"
    ],
    "plot": "\n Plot Ready is a 2011 Indian Hindi-language masala film directed by Anees Bazmee. Produced by T-Series Films, Rawail Grandsons Entertainment and Software Pvt. Ltd., Sohail Khan Productions and Eros International, the film is the official remake of the 2008 Telugu film of the same name directed by Srinu Vaitla. The film stars Salman Khan and Asin Thottumkal in their second film together after London Dreams. Ready was distributed by Wave Cinemas and One Up Entertainment. Khan also narrated the film, while the story was written by Gopimohan and Kona Venkat.\n Cast Principal photography commenced in June 2010. The film was shot in Sri Lanka, Bangkok and Mumbai. First look poster was launched on 5 April 2011. Theatrically released worldwide on 2 June 2011, Ready broke all the records for a non-holiday film  It grossed ₹120 crore net in India against its ₹30 crore budget, and the lifetime global collection was ₹180 crore. The film received mixed reviews from critics, with praise for its music, humor and Khan's performance, but criticism for its length and script.\n Special appearances A spiritual sequel titled Ready 2 was announced in July 2018. Owing to Asin's retirement from films after her marriage, it has been confirmed that she wouldn't be returning to the sequel.\n Production Prompt-witted, Prem helps his friend Khushi elope with her lover Raju. This angers her father Abhinav and the Kapoors. Prem pacifies his family who fix his marriage with a woman, Pooja. Sanjana, who just ran away from her wedding hears Prem telling his uncle about ditching Pooja. As the Kapoors haven't met her yet, Sanjana poses as her and stays with and soon wins over the Kapoors. Her maternal uncles Amar and Suraj search for a groom to get her still married.\nSuraj's son Aryan lapses into coma due to Prem who finds out Sanjana's identity, but they fall in love.\n Release Suraj takes Sanjana away. Despite of the truth, the Kapoors still want her as Prem's wife. Promising Sanjana that he will find a way to marry her, Prem poses as the nephew of Balli, a chartered accountant who serves Amar and Suraj. Soon the Kapoors trick Chaudharys to let Sanjana marry Prem. Aryan recovers and reveals about Prem who then explains how Sanjana's late mother Geeta wanted their union and get her married. Amar and Suraj realise their mistake and are forgiven. In the end, Prem and Sanjana get married and click away their wedding pictures.\n Critical response The film was originally to be shot in Mauritius. However, on the request of Salman Khan, the location was changed to Sri Lanka. Khan described his decision to choose Sri Lanka as its proximity to India and its suitable landscape for Indian productions.\n Box office Shooting started on 20 June 2010 in Colombo. The first schedule of shooting lasted for over 27 days at locations in Colombo and the neighbouring Bentota, during which approximately 40% of the filming was completed.\n India The second schedule of shooting was slated to start in October 2010 but was delayed due to eye problems faced by Salman Khan. The lead actor requested Anees Bazmee to delay the shoot until his condition improved. Shooting started again in Mumbai from 3 November 2010. Portions of Ready were shot at Film City in Mumbai and Cherish Studios at Madh Island in the north of Mumbai.\n Overseas The final schedule of shooting started in February 2011 in Bangkok. According to reports, actors Ajay Devgan, Sanjay Dutt and Kangana Ranaut, who were shooting in Bangkok for David Dhawan's film, Rascals were called by Salman Khan to become part of the movie. The trio shot for a day doing cameo appearances. Arbaaz Khan and Zarine Khan were also confirmed to have shot for small cameos in the film. The final schedule of shooting was completed in March 2011. Two songs from Ready, \"Character Dheela\" and \"Dhinka Chika\", which were filmed in Bangkok were re-shot in Mumbai's Film City studios. According to producer Bhushan Kumar, \"the whole  team felt that the visuals didn't suit the song.\" The song \"Character Dheela\", which features Salman Khan and Zarine Khan  is a tribute to veteran actors Raj Kapoor, Dilip Kumar and Dharmendra.\n Theatrical rights Ready’s release date was first set as 27 May but was later pushed back to 3 June. Advance bookings were opened on 29 May  in several multiplexes. It became the first Indian film to release on at least 1000 UFO digital prints and almost 1900 prints in all. The advance at single screens matched that of Dabangg and even bettered it at places. The world premiere took place at Grand Cineplex, Dubai on 1 June 2011.\n Awards and nominations The film received mixed reviews from critics. Nikhat Kazmi of The Times of India gave it three stars out of five saying, \"The film is an unabashed ode to Salman Khan, the entertainer rather than the actor. And yes, it works at that level.\" Taran Adarsh of Bollywood Hungama awarded the movie four out of five saying, \"On the whole, Ready is strictly for the masses and for those who relish typically formulaic masala entertainers. The film prides itself with super music , gags and gimmicks aplenty and of course, Salman Khan, the beloved of the masses and the mainstay of this film.\" Filmfare also awarded four stars out of five, while commenting, \"When it comes to a Salman Khan or a Rajnikant film, their performance is not important. It's the audience performance that counts.\" Komal Nahta of Koimoi.com gave it a rating of three and a half stars and stated, \"Ready will score at the box-office, thanks to a great start, super-hit music, Salman Khan and entertainment in a good dose.\"\n Soundtrack Anupama Chopra of NDTV Movies awarded two stars while commenting, \"Thankfully, Ready isn't in the same soul-sucking category as director Anees Bazmee's last two movies: Thank You and No Problem. But it still falls very much into his special brand of brain-dead, anything-for-a-laugh comedy.\" Raja Sen of Rediff.com awarded the film one and a half stars saying, \"Ready doesn't even try to make sense and therefore falls flat.....only it's more extortionate than value for money.\" Sonia Chopra of Sify awarded two and a half stars while commenting, \"The film is unabashedly Salman-centric. He's doing it all: the wise-cracks, gregarious dancing, beating the bad guys, and romancing the girl. All this with his characteristic drawl and swagger.\" Kunal Guha of Yahoo! Movies gave the movie one star and stated, \"...the movie refuses to end, as unnecessary confusions and complications pile up and you wonder if there's enough reel left to clear it all up.\" Rajeev Masand of CNN-IBN awarded the movie one and a half stars out of five, commenting \"'Ready' is strictly for die-hard Salman Khan fans  who're willing to forgive the fact that this tasteless, senseless film has no plot to speak of, yet lazily unfolds over two hours and thirty minutes... Salman Khan deserves better than this.\" Shubhra Gupta from The Indian Express gave the film one star and said \"What really kills this film is that its nonsense is neither inventive nor high energy.\"\n Reception Khaleej Times awarded the film three stars commenting, \"Bazmi's script, a shoot off of a Telugu hit, accommodates more characters than Goa during the tourist season. Every character is over-dressed and over-the-top.\" Mayank Shekhar of Hindustan Times gave two stars stating, \"Salman's re-grounded masala  is still novel for the time being. He walks into Gaiety to briefly say hi to his audiences... It's a pop-cultural experience all right, and fully worth it.\" Shubha Shetty-Saha of Mid-Day rated it with two and a half stars saying, \"The best thing about the movie, of course is Salman Khan. His fans will not be disappointed and yes, they will get to see him topless in the climax.\" Shalini Saksena of The Pioneer gave the film six out of ten saying, \"Believe it or not but Salman Khan is on a roll. After the success of films like Wanted and Dabangg, he is ready with Ready which has his stamp all over it... Though there is nothing spectacular about the storyline, it manages to make you laugh.\" Preeti Arora from Rediff gave a score of two out of five and said \"Ready isn't a tribute to Salman Khan. It's a vehicle which showcases the 'Best of Salman' one has seen over the last twenty years. It entertains in bits.\"\n See also In India, Ready opened to an overwhelming response at the box office and packed cinema halls with single screens reporting nearly 95%–100% occupancy, while multiplexes reported 60% to 100% occupancy, depending on session times. The film collected ₹130 million  nett on its first day of business, thus becoming the second highest opening-day grosser across India after Dabangg. On its second day of business, it went on to collect ₹124 million , therefore taking the two days nett total to ₹254 million . The opening weekend collections of the film have been around ₹423 million  nett, making it the second highest opening weekend ever as well as the biggest non-holiday weekend ever. It showed steady collections on Monday with more than ₹70 million  nett, and Tuesday with around ₹65 million  nett, taking the first week nett to ₹695 million  nett. The film collected ₹200 million  nett over its second weekend, taking the ten-day total revenue to ₹898 million  nett. In the second week, the film collected ₹323 million , taking the two-week total to ₹1,015 million . Ready thus became the fifth in Bollywood history to collect more than ₹ 1 billion in the domestic market. During the third week, the film fetched a further ₹ 185.5 million bringing the three-week total to ₹1,181 million . Ready collected ₹100 million  nett in its fourth week, taking the nett collections to ₹1,286 million . In its fifth week, the film collected around ₹19.6 million , taking the nett collections to ₹1,306 million .\n References The film grossed ₹1.80 billion  worldwide and managed an all-India distributor share of ₹646 million , the third highest ever at the time of its release. Box Office India declared it to be a 'Blockbuster'.Ready held the record for the eighth highest grossing Bollywood film ever made domestically after its theatrical run.\n External links"
}{
    "id": 81643806,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81643806",
    "name": "Jaya Janaki Nayaka",
    "genre": "Telugu-Language Movies",
    "maturity": "U/A 16+ ",
    "duration": "2h 24m",
    "synopsis": "With fists of fury, a righteous man vows to save his true love and her family from the fallout of a corrupt highway deal gone bad.",
    "related-genre": [
        "Action & Adventure",
        "Romantic Movies"
    ],
    "plot": "\n Plot Jaya Janaki Nayaka is a 2017 Indian Telugu-language action drama film directed by Boyapati Srinu and produced by Miryala Ravinder Reddy, under Dwaraka Creations. It stars Bellamkonda Sreenivas, Rakul Preet Singh and Jagapathi Babu, while Sarath Kumar, Suman and Tarun Arora play other pivotal roles. Pragya Jaiswal appears in an extended cameo appearance. The music was composed by Devi Sri Prasad. The film was released on 11 August 2017 and garnered mixed reviews from critics and audience.\n Cast Sweety is a college-going student, who meets his co-student Gagan when he saves her friend from being harassed by Vikram Verma, the son of the Central Minister who makes it a point to take down Gagan and his family. Gagan lives with his businessman father Chakravarthy and brother Pruthvi. The trio enjoys their life from drinking alcohol to eating roadside foods and beating up wrongdoers in society. Sweety gets attracted to Gagan and start to hang out, and she comes to house and makes a change in their lifestyle for their own sake, for which Chakravarthy happily agrees. Sweety learns about Pruthvi's love failure and ends up reconciling with the would-be bride's parents, and the marriage is conducted in a grand manner. Chakravarthy, upon seeing the happiness and joy in the atmosphere,  realizes that Sweety is the reason behind everything and asks Gagan to always be by her side.\n Soundtrack Meanwhile, Ashwith Narayana Varma is a prestige-driven corporate businessman, who kills his daughter's would-be groom in an accident. When the groom finds a video of Narayana's daughter romancing another guy that she liked before the engagement. He leaves a gun on the table, and forces his daughter to kill herself, to which she does. Narayana's company plan to build a highway that would make his company as the most successful company, but his son Veerendra reveals that the project has competition in the form of Arjun Pawar, who is the biggest liquor baron in North India. Arjun is supported by his two brothers and has bought off all of Narayana's close associates and subordinates except for JP, who is the Highway authority director. Arjun threatens JP, stating that if he does not agree to his terms, that he would kill his daughter. JP agrees out of fear. However, Narayana retaliates and sends Veerendra where he kills Arjun's brother.\n Production Sweety realizes that she is truly in love with Gagan and expresses her feelings towards him. Gagan is delighted, and they leave for Sweety's house to meet  her father, who is JP. JP insults Gagan, after realizing his lifestyle and the reputation that Chakravarthy has in society, then proceeds to insult Sweety. Enraged, Gagan slaps JP, but Sweety, who cares for her father's life more than anything sends Gagan away and tells him to never come back. \n Development Heartbroken, Gagan drives and tries to forget Sweety, where he gets into a car accident. Fearing for his life, Chakravarthy and his uncle sends him away with known relatives in Vizag. Gagan's uncle's daughter Falguni arrives at the airport and Gagan realizes that her lifestyle is young, wild, and free. Falguni, however, has no interest in Gagan. While driving back after a party on the beach, Gagan witnesses Narayana's family being attacked by Arjun's brother where he proceed to save them. Narayana's family pleads with Gagan to save them and their daughter-in-law. Gagan saves the daughter-in-law, who happens to be Sweety. Shocked, Gagan is then shot and left for dead. However, Gagan survives with Narayana's help. Narayana's wife reveals that Narayana and JP decide to get Veerendra married to Sweety. At the wedding, Veerendra is shot and killed by Arjun's men and kidnap everyone to kill them. Since Veerendra died at the hands of Arjun, JP has no choice, but to let Sweety away from the Narayana family. However, Narayana's sister calls Narayana and tells him that they need Sweety, since she is almost married to Veerendra and decided to adopt Sweety as their daughter-in-law. Since her would-be husband is dead, Sweety becomes a poor widow with no family emotions.\n Casting Gagan then vows to protect Sweety. Narayana's sister arrives and tells that the family must perform a ritual at the Hamsala Devi river area. However, in reality has made a deal with Arjun to get Sweety and leave her family alone. As Narayana and the rest of his family perform the pooja, they are attacked by Arjun's men. As they are about to attack Sweety, Gagan arrives along with Chakravarthy and Pruthvi and kills everyone. He takes Sweety along with him, and Narayana feels that his prestige has once again been damaged. Mahendra Varma enrages both Narayana and Arjun on Gagan, so they both join hands with each other in eliminating Gagan once and for all. In the attack, Chakravarthy and Pruthvi are seriously injured, and Narayana kidnaps Sweety. Gagan arrives at the hideout where Sweety is being kept and kills everyone, except Narayana. Gagan tells that Narayana lost his prestige when he joined hands with Arjun, who killed Veerendra just to kill Sweety. As Narayana is listening to this, he shoots himself and dies. Thus, Gagan reunites with Sweety.\n Filming The music was composed by Devi Sri Prasad. Music released on Junglee Music.\n References Bellamkonda Suresh selected director Boyapati Srinu to direct his son Bellamkonda Sreenivas' third film. It was confirmed by the director later when the script work was in its final stages. The film was officially launched at Annapurna Studios in Hyderabad on 27 August 2014. Devi Sri Prasad was declared as the music director, Arthur A. Wilson was declared as the cinematographer, A. S. Prakash was declared as the art director while the story and dialogues were written by M. Rathnam. The film was said to be on the lines of Boyapati Srinu's debut film Bhadra and the script work was complete by then. Nallamalupu Bujji was reported to replace Bellamkonda Suresh as the film's producer due to the latter's financial crisis. However, Sreenivas confirmed that his father would produce the film and it has been delayed due to story discussions but not due to financial problems.\n External links"
}{
    "id": 81643833,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81643833",
    "name": "Seethamma Vakitlo Sirimalle Chettu",
    "genre": "Dramas",
    "maturity": "U/A 7+ ",
    "duration": "2h 38m",
    "synopsis": "When a rift occurs between them, two radically different brothers must work together to restore their family's image and find their way in life and love.",
    "related-genre": [
        "Dramas"
    ],
    "plot": "\n Plot Seethamma Vakitlo Sirimalle Chettu , also known by the initialism SVSC, is a 2013 Indian Telugu-language family drama film written and directed by Srikanth Addala. It was produced by Dil Raju's Sri Venkateswara Creations, and stars Venkatesh, Mahesh Babu, Anjali and Samantha, while Prakash Raj, Jayasudha, Rao Ramesh, Kota Srinivasa Rao, Abhinaya and Rohini Hattangadi play supporting roles.\n Cast In addition to directing the film, Addala worked on the script for three years after the release of his directorial debut, Kotha Bangaru Lokam . He wrote the screenplay, and Ganesh Patro wrote the film's dialogue. Mickey J. Meyer and Mani Sharma composed the soundtrack and score, respectively. Marthand K. Venkatesh edited the film and K. V. Guhan was its cinematographer. Production began on 6 October 2011 in Hyderabad; principal photography began on 18 January 2012 in Visakhapatnam, and finished on 24 December. In addition to Hyderabad, scenes were filmed in coastal Andhra Pradesh, Tamil Nadu and Kerala.\n Production It was considered the first major multi-starrer film in Telugu cinema at the time after a gap of twenty to thirty years. Seethamma Vakitlo Sirimalle Chettu was released worldwide on 11 January 2013 to generally positive reviews. The film was commercially successful, earning a distributor share of ₹51 crore on a budget of ₹40 crore, and was the second-highest-grossing Telugu film of the year . It received seven nominations at the 61st Filmfare Awards South and eleven nominations at the 3rd South Indian International Movie Awards, winning two awards at each: Best Actor Male — Telugu  and Best Playback Singer Female — Telugu . The film won four Nandi Awards, including the Award for Best Home-viewing Feature Film.\n Development A kind-hearted man addressed as Relangi Mavayya by his near and dear after his hometown Relangi lives with his close-knit family comprising his wife, mother, and three children—two sons Peddodu  and Chinnodu  and a daughter Chinni, niece Seetha who is the daughter of Relangi Mavayya's late sister and her husband. Peddodu is in an introverted person who lives life on his own terms while Chinnodu is a talkative, flirtatious and brilliant person. Peddodu resigns from his job at the company of a relative Brahmananda Rao for being insulted due to his stubborn attitude. Everyone thinks that Seetha and Peddodu would marry and Seetha to have hidden feelings for Peddodu but is unhappy with the fact that Peddodu has never addressed her with the name and rather addresses her as \"Hey\" and \"Oye\".\n Casting After attending the wedding of Geetha's elder sister, Chinnodu falls for Geetha, younger daughter of Seetha's paternal uncle who is a highly self-centered personality and constantly denigrates the economic status of Relangi Mavayya and unemployment of his sons. Geetha's elder sister recommends a marriage proposal to Chinni with relatives of her in-laws. At the wedding, Peddodu and Geetha's father argue over the latter's sarcasm further intensifying the tensions between families. Days later, Peddodu and Chinnodu leave for city to find employment and Geetha invites Chinnodu for lunch in a restaurant, hiding the fact that her whole family is there. Chinnodu receives a lukewarm welcome and argues with Geetha's father when he demeans Peddodu and Relangi Mavayya. When Geetha tries to cool Chinnodu, Peddodu spots them together and feels upset about their relationship. He leaves to his village and Chinnodu's relationship with Geetha is ruined.\n Filming Geetha's father finds her a proposal but her grandmother refuses to let her marry until Seetha is married. When Relangi Mavayya visits them, Geetha's father discourages his interest in getting Peddodu married to Seetha and finds a proposal for the latter. Seetha is pressured to accept her marriage but the alliance gets spoiled. Relangi Mavayya is injured in an accident while protecting a young boy and gets hospitalized but survives with minor injuries. As the young boy is the nephew of Brahmananda Rao, the latter offers job to Peddodu for second time. Peddodu and Chinnodu's rift widens.\n Post-production Relangi Mavayya attends the annual Kalyanam of Rama and Sita in Bhadrachalam with his family where to their surprise, Geetha and her family too arrive. The guest of honour, A MLA requests Relangi Mavayya to lead the procession having had a good impression of him in their last meeting surprising Geetha's father. A short circuit takes place and people at the place panic. Setting their differences aside, Peddodu and Chinnodu rescue Geetha's family and other devotees who attended the Kalyanam from danger. Relangi Mavayya praises the brothers and remind them of their love for each other and tells them about the importance of adjusting, brotherhood and family. This changes their attitude and they reconcile. Geetha's father who overheard their conversation realizes his mistake. Peddodu addresses Seetha by her name indicating that he is ready to marry her.\n Themes Geetha's father gets them married and plan to get Chinnodu married to Geetha. Peddodu and Chinnodu, having secured jobs buy their paternal grandmother bangles as she desired earlier.\n Soundtrack After the release of his directorial debut, Kotha Bangaru Lokam , Srikanth Addala worked for three years on Seethamma Vakitlo Sirimalle Chettu's script. After Vedam's release, in June 2010 Dil Raju began planning a film directed by Addala and featuring Venkatesh and Pawan Kalyan as the male leads. Scripting began, and the film's title was announced in September. When the project stalled, Addala approached Mahesh Babu with its script in June 2011.\n Release Babu agreed to act in the film after Addala met him to read the script during pre-production for Dookudu . He and Venkatesh cited the script's emotional depth and realistic approach as the reason they signed for the film. Addala approached Ganesh Patro in Chennai to write the film's dialogue. Patro used the dialect spoken in the Godavari region of Andhra Pradesh, edited by Addala. It was his final project as a dialogue writer before his death in January 2015. K. V. Guhan, who worked on the previous Babu films Athadu  and Dookudu, was signed as Seethamma Vakitlo Sirimalle Chettu's cinematographer.\n Marketing Mickey J. Meyer, who worked with Addala on the director's debut, composed the film's soundtrack and Mani Sharma composed its score. Sharma had composed the score for Raju's 2011 production, Oh My Friend, whose soundtrack was composed by Rahul Raj. Although production began in Hyderabad on the eve of Vijayadasami  with a launch ceremony, Venkatesh and Babu did not attend due to previous film commitments. \"Simple but beautiful\" was announced as the film's advertising slogan in June 2012.\n Pre-release revenue Seethamma Vakitlo Sirimalle Chettu is considered the first Telugu star-studded film in the last two or three decades. After listening to Addala's narration, Venkatesh felt that they could work more on the film's script and the director agreed. The actor agreed to the film because he considered it a safe bet which would appeal to a family audience. Raju was interested in casting Babu as the lead for two reasons: the film, revolving around two brothers, required two popular actors as the leads and the producer again wanted to work with the actor after Murari , Takkari Donga , Okkadu  and Athadu. Guhan told The Hindu that Venkatesh's and Babu's unnamed characters would simply be called Peddodu and Chinnodu, respectively. The film is considered to be the first multi-starrer of Telugu cinema in recent decades.\n Home media Samantha Ruth Prabhu was signed to play Babu's love interest in the film, and Raju asked her to allow 40 days for shooting. After Trisha, Bhumika Chawla and Anushka Shetty were considered for the other female lead, Amala Paul was signed in mid-December 2011. After a photo shoot and the beginning of principal photography, Paul left the project in late January 2012 and Raju replaced her with Anjali.\n Reception Prakash Raj was cast in a principal role as the brothers' father. When he failed to join the film unit in Kutralam, it was rumoured that he had walked out of the film due to differences with Raju but Raju denied the reports. Jayasudha and Rohini Hattangadi were signed for supporting roles, and Hattangadi said that she would play the brothers' grandmother. Rao Ramesh played Samantha's father in the film.\n Critical reception Miss Dabur Gulabari 2011 second runner-up Tejaswi Madivada was signed for a supporting role in her acting debut, and Abhinaya was cast as Babu's sister in the film. Rama Prabha, Tanikella Bharani, Kota Srinivasa Rao, Brahmanandam and Ahuti Prasad later joined the film's supporting cast. Traditional and formal costumes were supplied by the clothing chain Kalamandir.\n Box office \"For the SVSC set, the director and I spent a few days in East and West Godavari districts and saw the houses... the front and back yards, where they plant flowers etc. We planted big coconut trees which we took from Kadiyam village near Rajahmundry.\"\n Accolades  —A. S. Prakash in an interview with Deccan Chronicle in October 2015.\n Notes Principal photography began on 18 January 2012 in Visakhapatnam, where several of Venkatesh's scenes were filmed near the Andhra University campus and on the Ramakrishna Mission Beach. The next shooting schedule began in Kutralam, Tamil Nadu, on 6 February 2012 and filming continued in Hyderabad during March. In Sanathnagar a crowd disrupted shooting, and the film's crew chose an undisclosed location to resume. Samantha joined the film unit on 28 March. After shooting was disrupted three times in Hyderabad by crowds, Babu suggested that Raju move production to Chennai . Rain increased production costs.\n References Part of the song \"Yem Cheddaam\" was shot at the Sabarmati Riverfront in mid-April, the riverfront's first appearance in a Telugu film. In addition to the riverfront, scenes were filmed over a fifteen-day schedule in shopping malls and gardens around Ahmedabad. Addala chose the city for its developing infrastructure, friendly people and climatic similarity to Hyderabad. On 31 May 2012, Raju told the media that 35 percent of Seethamma Vakitlo Sirimalle Chettu's filming was completed and the next shooting schedule would begin at Ramoji Film City. A house set worth ₹10 million was built at the studio under the supervision of A. S. Prakash. Venkatesh and Anjali began a four-day shooting schedule at Ahobilam on 4 July. After several key scenes were filmed in Relangi, near Tanuku, a new schedule began in Bhadrachalam on 16 July.\n External links"
}{
    "id": 81045069,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81045069",
    "name": "Neevevaro",
    "genre": "Dramas",
    "maturity": "U/A 16+ ",
    "duration": "2h 11m",
    "synopsis": "When a blind chef’s girlfriend goes missing, his unnerving search for her leads him to find there's more to her disappearance than what meets the eye.",
    "related-genre": [
        "Mysteries",
        "Crime Movies",
        "Dramas",
        "Thriller Movies",
        "Romantic Movies"
    ],
    "plot": "\n Plot Neevevaro  is a 2018 Telugu language romantic action thriller film directed by Hari Nath and produced by Kona Venkat and M.V.V. Satyanarayana. The film stars Aadhi, Taapsee Pannu and Ritika Singh. This film is a remake of 2017 Tamil film, Adhe Kangal, directed by Rohin Venkatesan.\n Cast Kalyan , a blind chef, owns a restaurant in Hyderabad and is very successful. He has a loving family and is well-respected by his workers. His childhood friend and neighbor Anu  is in love with him. His routine includes spending time in his restaurant playing the guitar after it closes and taking a walk back to his house. One night while he is about to close up and leave, Vennela  shows up in the restaurant requesting to help feed a homeless person. Kalyan is impressed with her in their first meeting. Vennela visits his restaurant regularly for the same reason, and Kalyan gradually falls in love with her. He proposes to her one day, but to his shock, Vennela cries upon hearing his proposal, saying that she loves him too, but she came here to bid farewell. Vennela says she borrowed two million rupees from a gang a few years ago for her father's heart surgery, and now she cannot repay it. The gang has threatened her family several times, and warned her they would abduct her if she cannot repay her debt the next day. Kalyan, who is in love with Vennela, agrees to repay her debt.\n Soundtrack On his way home the very night, Kalyan encounters a car accident which makes him unconscious for three weeks, but also coincidentally, returns his sight. Waking up, Kalyan is shocked to learn that three weeks have passed, which means Vennela could be in danger. He starts to look for her through clues she left while with him, but ends up finding nothing. Meanwhile, Kalyan and Anu's parents want the two to marry each other. To please his mother, Kalyan agrees to marry Anu, though he loves Vennela. The night before Kalyan and Anu's wedding, Vennela's father visits Kalyan's restaurant to ask for help, saying that the gang abducted Vennela as threatened because Kalyan did not repay her debt. The gang now threatens to kill her if he cannot repay the debt the next day. Kalyan agrees again to repay the money, to save Vennela.\n Reception The next day, Kalyan escapes from his wedding to save Vennela. He and Vennela's father arrive at the appointed place, where they see the gang pointing a gun at blindfolded Vennela. Immediately after Kalyan hands over the money to them, the police arrive on the scene. The gang is angered and thinks Kalyan brings not only the money, but the also police, so they shoot Vennela's father, hit Kalyan until he is unconscious, and take away Vennela. Before leaving, they threatened Kalyan they will kill Vennela if he tells anything to police. Kalyan wakes up later at the same place to find nobody beside him, not even Vennela's father's dead body or the police, making him very confused. Upon returning to his wedding, an upset Anu says that she should have already learned that Kalyan did not agree to marry her out of his own choice, but only as an obligation to please his mother. She starts to hate him.\n Critical reception Kalyan later sees the news that Vennela's father is killed in a car accident in Visakhapatnam, and police are calling anyone who knows him to claim his body as they cannot identify him. Kalyan is now more confused, thinking how can someone that had died in front of him die again. He visits the Vizag to find out what happened. Meanwhile, Anu also goes to the same city for a job assignment.\n References With the help of a police Constable Chokka Rao  in that city, Kalyan finds Vamsi , a clay artist whose car caused the accident that killed Vennela's father. To their shock, Vamsi is blind and cannot drive. After some twists, Vamsi confesses that his girlfriend Jyothi a NRI drove his car and killed a old man. Vamsi bribed an inspector with three million rupees to save Jyothi, who later left him out of fear. They somehow find a photo of Jyothi but are all shocked to learn that it is Vennela. After observing a state award for specially-abled received by Vamsi, Kalyan observes there is a common point between them . He now realizes that the Vennela he knew is a con artist that swindles money, especially from blind men who received the same state award. He thought he was her lover, but now he knows that he is just one of the victims of her cons. Kalyan, Anu, and Chokka decide to get the scammer at any cost.\n External links"
}{
    "id": 81509785,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81509785",
    "name": "Maha Samudram",
    "genre": "Dramas",
    "maturity": "U/A 16+ ",
    "duration": "2h 32m",
    "synopsis": "Two best friends with contrasting moral principles find their beliefs and relationship challenged when circumstances involve them with the underworld.",
    "related-genre": [
        "Crime Movies",
        "Action & Adventure",
        "Dramas"
    ],
    "plot": "\n Plot Maha Samudram ) is a 2021 Indian Telugu-language romantic action drama film written and directed by Ajay Bhupathi. It is produced by Ramabrahmam Sunkara under AK Entertainments. It stars Sharwanand, Siddharth, Aditi Rao Hydari, and Anu Emmanuel. The music is composed by Chaitan Bharadwaj. The film is set in Visakhapatnam of Andhra Pradesh. The film released on 14 October 2021.\n Cast Vijay and Arjun are thick friends. Vijay, an ambitious civil service aspirant with corrupt plans, is an orphan and has a girlfriend named Mahalakshmi aka Maha, who is a dance teacher. Vijay lives with Arjun and Maha. He is not serious about his relationship with Maha and lives in Arjun's house. Arjun lives with his widowed mother, who praises Vijay for being ambitious and hard-working despite being an orphan, unlike Arjun. Arjun has an uncle Chunchu Mama, who is a fisherman. Unlike Vijay, Arjun plans to start a business from his father's money accumulated before his death. Arjun meets Smitha, who misunderstands him, but realizes her mistake and they start hanging out with each other and fall in love.\n Production One day, Vijay brings Arjun to a factory of illegal drugs and explains that the factory belongs to a smuggler named Dhanunjay, who has a handicapped elder brother Gooni Babji, who created an indestructible crime syndicate. Seeing their smuggling activities, Arjun appreciates Vijay and tells him to start the investigation against them, but Vijay reveals that he joined the police force to become an influential person and involve in illegal activities to earn money. Enraged, Arjun argues with Vijay and has a serious argument. Vijay follows Dhanunjay and ends up in their godown, where he accidentally stabs Dhanunjay. A shocked Vijay meets Arjun and Chunchu, revealing the incident. Chunchu tells him to leave for his safety. Arjun tells him to leave for the railway station and will bring Maha. After they reach, Vijay abandons them. It is revealed that Maha is pregnant with Vijay's child. Arjun brings her to his home, who along with his mother looks after her. Chunchu advises Arjun to be a smuggler to escape Babji's wrath. With much hesitation, Arjun becomes a smuggler and is blamed for Vijay's mistake. Meanwhile, Maha gives birth to a girl and names her Pooja.\n Soundtrack Four years later, Arjun becomes the leading smuggler with Chunchu as his right hand. Maha and Pooja live with Arjun and his mother, and Maha does not reveal about Vijay to Pooja. Maha develops feelings for Arjun. Arjun arrives at the court for his case against Babji where he meets Smitha, a successful lawyer, and they start to hang out. Arjun brings Smitha to introduce her to his mother. Seeing Smitha, Maha gets disappointed thinking she wants to marry him. One day, Smitha understands that Maha is in love with Arjun, who tells him to marry Maha for the sake of Maha and Pooja's happiness. Meanwhile, Vijay arrives back to see Maha, where he finds her with Pooja, Arjun, and his mother. When Vijay sees Arjun, Pooja, and Maha together, he misunderstands the situation where he meets Babji and finds out that Dhanunjay has not died, but does not handle their business. \n Release Babji manipulates Vijay about his friendship with Arjun. Vijay finds out Arjun's location and goes to meet him and asks him about his family, to which Arjun says he does not need to explain to him. A war erupts with Arjun where Vijay joins forces with Babji. He kidnaps Pooja and Chunchu, where Chunchu reveals that Pooja is Vijay's daughter and Arjun became a smuggler due to Vijay's mistakes. Heartbroken from hearing the truth, he frees Chunchu and hugs Pooja. Vijay calls Arjun and tells him that he wants to meet him, not as an enemy but as his old friend, and will hand over Pooja to him. Arjun agrees but meets with an accident caused by Babji and loses consciousness. On the other side, Babji arrives with his henchmen and shoots Vijay after learning that Arjun and Vijay are reconciling together and takes Pooja with them. Arjun regains consciousness and finds Vijay dead. He leaves for Babji's factory and rescues Pooja by killing Babji with Chunchu's help. Arjun, Maha, and Pooja are found on a beach having a good time where Arjun proposes to Maha, to which she accepts wholeheartedly & they live together happily ever after.\n References In 2019, Ajay Bhupati confirmed the film with Bellamkonda Sreenivas in the lead. However, in early 2020, the bilingual film starring Sharwanand and Siddharth is announced. Naga Chaitanya  and Samantha Akkineni were also considered for the lead roles, but it did not materialize.\n External links"
}{
    "id": 81643815,
    "tag": "Telugu-Language Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81643815",
    "name": "Konda Polam",
    "genre": "Dramas",
    "maturity": "U/A 7+ ",
    "duration": "2h 22m",
    "synopsis": "After failing every job interview, a shepherd’s son finds his courage and calling protecting his flock from tigers and bandits in the forest.",
    "related-genre": [
        "Movies Based on Books",
        "Action & Adventure",
        "Dramas"
    ],
    "plot": "\n Plot Konda Polam  is a 2021 Indian Telugu-language action thriller film directed by Krish Jagarlamudi. Produced by First Frame Entertainments, it stars Panja Vaisshnav Tej and Rakul Preet Singh while Sai Chand, Kota Srinivasa Rao and Nassar play supporting roles. The film is an adaptation of the eponymous novel by Sannapureddy Venkata Rami Reddy. Konda Polam was released on 8 October 2021 and ended up as a commercial failure.\n Cast Kataru Ravindra Yadav \"Ravi\" has passed the Indian Forest Service exam conducted by UPSC with top marks. During the interview, he is asked why he wants to join the Indian Forest Service?\n Production In the past, Ravi was the only educated man in his village of shepherds, but he couldn't find a job despite searching for 4 years in Hyderabad due to his lack of confidence. Finally, after his grandfather insistence he decided help his father's profession because his father not allowed his elder brother because he was newly married so instead to come with them he need to spend sometime with his wife. So he allowed Ravi to come with him. In the drought times the situation forces them to take the sheep to forests for pastures to feed the sheep and water to drink for 40 days . At first, he is a scared fish out of water amidst the shepherds in the forests and hills they travel through. However, he meets Obulamma \"Obu\", a fearless and kind young orphan woman, who helps him learn about shepherding and nature along with the other shepherds. Their journey is hazardous as they face tigers, sandalwood smugglers, goat thieves, limited food and water supplies, and the risk they might not find a suitable environment for the goats to graze. Ravi learns quickly and uses his newfound skills to fight these threats. Eventually, Ravi and Obu fall in love, but Ravi's father insists that he stay away from her due to his unemployment, so he rejects her advances. Finally, Ravi comes faces to face with the tiger and, reflecting on his previous lack of initiative, bravely stands up to it and makes it flee.\n Soundtrack Back in the interview, Ravi explains that his experience with the tiger gave him a confidence that wasn't in his life before, and later he got the corporate job he dreams for but he was not satisfied with the job he got and he resigns it prepared for IFoS because he wants to serve in the Forest Service to help his village and solve their problems and to protect Forest. Leaving the interviewers impressed, he is made a DFO and returns to his village amidst pomp and splendor. He then declares his love for Obu and the two embrace.\n Reception Konda Polam novel recommendation given to Krish by other Director Mohan Krishna Indraganti. After reading this novel he decided made a film on this in 2020, Krish Jagarlamudi acquired the rights of novel Konda Polam by Sannapureddi Venkata Ramireddy. He adapted the novel to make it a theatrical extravaganza, casting Panja Vaishnav Tej and Rakul Preet Singh in the lead. In September 2020, it was reported that Rakul Preet Singh resumed the shooting of the film which is being shot in Vikarabad, Telangana forest. This film is major part had shot on lockdown 1 under biobubble with the limited cast and crew.  In an interview Krish, the director of the film said, “During famines, many people from the shepherding community go to forest areas along with their sheep for their livelihood. This process is called 'Konda Polam'. We will be showcasing this adventurous journey very clearly in this film.” In the novel there is no character called Obulamma, he wrote the character for the film to get into a commercial template he added.\n References The soundtrack is composed by M. M. Keeravani and lyrics are penned by M.Keeravaani, Chandrabose and Sirivennela Seetharama Sastry. \"Obulamma\" first track of the soundtrack was released on 27 August 2021 by Mango Music. \"Shwaasalo\" the second song was released on 30 September.\n External links"
}