[{
    "genre": "Action",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Dramas",
        "Comedies",
        "Action & Adventure"
    ],
    "id": 81595543,
    "tag": "Action Movies",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABaAIKXB-pGekT_AK5YyKKbPSgbl2VOXV-nGARkGDhpybvTvQYwJ8JlPCZcqtDoHu1tEagfNGhAIl_pMLwIKvCN6yswYJBCBVazQ.jpg?r=9f9",
    "source": "https://www.netflix.com/in/title/81595543",
    "index": 38,
    "name": "Shehzada",
    "maturity": "U/A 13+ ",
    "duration": "2h 22m",
    "synopsis": "After realizing he was switched at birth by a conniving father, a rakish Bantu’s life is upended when he becomes the heir to a billionaire.",
    "year": "2023",
    "spoilers": "\n\nRating 8: Valmiki and Randeep start their career as clerks in the company of Aditya Jindal.\n\nRating 8: Randeep, who marries Jindal's daughter Yashoda \"Yashu\", becomes wealthy while Valmiki remains poor.\n\nRating 10: On the day of the birth of both their children, Randeep's son appears to be dead.\n\nRating 3: When nurse Sulochana informs Valmiki about this, he pities Randeep and offers to exchange his baby with the dead one since the Jindals have done so much for him.\n\nRating 8: After switching them, however, Randeep's child begins to cry, having not died after all.\n\nRating 10: Valmiki, sensing that his son would have a better life growing up in a rich family, prevents Sulochana from switching the babies back and accidentally pushes her off a ledge.\n\nRating 10: Sulochana goes into a coma, keeping Valmiki's secret from coming out.\n\nRating 10: 25 years later, Raj, raised at Jindal's house, is timid and innocent while Bantu, raised by Valmiki, is street-smart and outspoken.\n\nRating 10: Valmiki, who favours  his own son Raj, treats Bantu badly.\n\nRating 10: Bantu gets a job at a law firm headed by Samara, who is impressed by his knowledge and quick-wittedness.\n\nRating 8: Meanwhile, Raj returns from his studies abroad.\n\nRating 4: Jindal sends Raj to reject Sarang, a powerful man who offers to buy their company's shares but deals with drugs.\n\nRating 8: Randeep watches the deal from a restaurant where Samara has a meeting.\n\nRating 10: When the client misbehaves with Samara, Bantu interferes.\n\nRating 8: Randeep is disappointed by Raj's inability to say no to Sarang but beams at Bantu and Samara when they defend themselves against the rowdy client.\n\nRating 10: Following this, Raj becomes engaged to Samara\n\nRating 8: but she and Bantu have fallen in love.\n\nRating 8: Sarang attempts to kill Randeep for getting in his way.\n\nRating 8: Bantu saves Randeep; at the hospital, he meets Sulochana, who has come out of her coma.\n\nRating 10: She reveals Bantu's true parentage before dying.\n\nRating 5: Bantu denounces Valmiki as his father.\n\nRating 10: Aditya Jindal, Bantu's true grandfather, is fond of Bantu for saving Randeep and hires him.\n\nRating 3: Bantu begins to address the issues plaguing the house by patching up Randeep relationship with Yashu, which had been strained since Randeep's affair seven years ago.\n\nRating 10: He also settles the dispute with Sarang and reforms the corrupt family members.\n\nRating 7: He and Samara tell Raj about their relationship; Raj calls off his marriage with Samara and confronts his parents, telling them he should be allowed to make his own decisions rather than have everything handed to him.\n\nRating 10: Sarang kidnaps Yashu and threatens to kill her unless Randeep gives him money.\n\nRating 10: Bantu saves Yashu.\n\nRating 6: Jindal reveals that he knew all along who Bantu was, which is why he brought him home; he had overheard the conversation between Sulochana and Bantu right before her death.\n\nRating 10: Bantu unites with Randeep but asks him not to reveal the truth to Yashu, fearing she might be disheartened to know that Raj, who she dotes on so much, is not her real child.\n\nRating 8: Yashu remarks that Bantu is like her son, as he saved her and the family.\n\nRating 6: Yashu asks Valmiki to train Raj to be as competent as Bantu and become the CEO of their company.\n\nRating 10: Bantu forgives Valmiki and mends his relationship with him."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Action & Adventure"
    ],
    "id": 81672761,
    "tag": "Action Movies",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABW8oaUjhggl8CMsts1Om0LmNK79aRi8JotMgVeTeq2vpBXYIvL3z_w827AUS34hFXUcxDnwcDsWARDbwTCX6vF4iQnBoGcZTBo8.jpg?r=357",
    "source": "https://www.netflix.com/in/title/81672761",
    "index": 39,
    "name": "Thunivu",
    "maturity": "U/A 16+ ",
    "duration": "2h 23m",
    "synopsis": "A major bank heist takes an unnerving turn when a mysterious interloper known only as Dark Devil begins to hijack the operation.",
    "year": "2023",
    "spoilers": "\n\nRating 8: Radha, a dreaded gangster, and his men plan a heist at \"Your Bank\", one of the biggest privately-owned bank in Chennai, with the support of ACP Ramachandran.\n\nRating 8: They plan to rob ₹500 crore on 21 May, coinciding with the Governor's party event at his residence.\n\nRating 10: On the day of the heist, Radha and his men hijack the bank, only to discover that the bank is already hijacked by a mysterious man nicknamed Michael Jackson and his accomplice, Kanmani.\n\nRating 10: The commandos arrive inside the bank, but get defeated.\n\nRating 6: Jackson later makes a deal with Radha to help him rob ₹5000 crores, in exchange for a share of the money, for which Radha and his men reluctantly agree.\n\nRating 10: When Radha finds that the bank locker contains only ₹1,510 crores, they decide to kill Jackson, only to be defeated.\n\nRating 8: Jackson insists that Antony alias Anto, a police constable to be the negotiator, much to Ramachandran's ire.\n\nRating 8: He uses a voice changer of Michael Jackson, tricking the people and the media into referring him as Michael Jackson.\n\nRating 10: Ramachandran tries to kill Jackson with a sniper, only for him to make an explosion in a car parked nearby the bank using a bomb.\n\nRating 3: With the events being leaked to the media, city commissioner Dayalan is called in to handle the situation.\n\nRating 8: While inspecting the bank, Jackson finds explosives, disguised as fire extinguishers, and deduces that a third team has also entered the bank, without him knowing.\n\nRating 7: The police tracks a van where Kanmani is guiding Jackson, but Kanmani destroys the van, and escapes.\n\nRating 3: Ramachandran sends his men to trace Kanmani, but she kills them and exposes Ramachandran's involvement in the heist to Dayalan, who interrogates him, and he confesses that he along with his childhood friend Shyam, the Tamil Nadu Branch Head of Your Bank, planned the heist.\n\nRating 8: Ramachandran tried hiring Jackson, who goes by the name \"Dark Devil\", for the job, but he refused.\n\nRating 8: Ramachandran later hired Radha's gang for the job, without revealing that they will be killed after the heist.\n\nRating 3: Radha and his gang join and assist Dark Devil after hearing Ramachandran's confession through bugs planted on Dayalan's base.\n\nRating 3: Shyam flees from police after they learnt about his involvement, but is captured by Kanmani.\n\nRating 3: Meanwhile, Dayalan finds that Valavan was the one who wired and planted explosives in the drainage, and begins to search for him.\n\nRating 3: He also learns that Dark Devil and his team actually died a few months ago.\n\nRating 10: Ramachandran tries to prove that Dark Devil is alive by detonating a dummy bomb only to get killed when the bomb turns out to be a real one and explodes after the wire in it gets detached.\n\nRating 3: Dark Devil learns from Kanmani that there are ₹25,000 crores available in the bank.\n\nRating 4: Dark Devil tells Dayalan to arrange a meeting between him and chairman of Your Bank, Krish.\n\nRating 6: As Dark Devil deduced, the third team, revealed to be some of the bank's staff, attack Radha and his team in the locker, before assaulting Dark Devil and hold him captive.\n\nRating 5: Krish arrives and reveals that the third team were hired by him and tells them to destroy the bank's chest with explosives with hostage inside.\n\nRating 10: Krish also forces Dark Devil to reveal himself, where Dark Devil reveals that he and his teammates lived happily together like a family.\n\nRating 3: After having committed a heist in Bangkok, Dark Devil's members, Jijo and Achara planned to get married.\n\nRating 9: They all travelled to Araku Valley, Andhra Pradesh to arrange their marriage and celebrate, but they were ambushed by assailants sent by Krish and Shyam, who feared that they would reveal their heist plan to others.\n\nRating 8: Jijo and Achara got killed, but Dark Devil and Kanmani managed to escape and the killers faked their deaths for the rest of their deal money.\n\nRating 7: The duo reached the house of an old couple, who tends their wounds and revealed about his son Kavin, an honest bank official, who wanted to return the money to the people who invested in mutual funds.\n\nRating 10: However, Kavin was killed by Krish, and made it look like a mob did this during a strike.\n\nRating 10: Having learnt about this, Dark Devil and Kanmani decided to bring Krish and the bank officials to justice.\n\nRating 7: After the revelation, Dark Devil defeats Krish and his team, where he forces him on live to reveal about his financial scam of the ₹25,000 crore, which was invested in the mutual funds, and the atrocities committed against people by the bank officials.\n\nRating 8: Shyam, who was made to wear a bomb vest is sent to Dayalan, where he reveals everything about the heist and Krish's involvement in it, before he is killed by Kanmani's phone call.\n\nRating 3: Dark Devil also brings mutual funds chairman Harsha, who was abducted by Kanmani at gunpoint and Sunil Dutta, who was abducted from Mauritius by Dark Devil's men and was also responsible for stealing data from the NSE backup server of the Indian Stock Exchange.\n\nRating 8: Sunil confesses that he invested in 10 companies belonging to Krish and reveals that the ₹25,000 crore is in the bank's secret chest locker.\n\nRating 10: With the help of a mole in the media, Krish falsely frames Dark Devil and his team as terrorists, and cuts the live telecast.\n\nRating 10: Dayalan learns from Rajesh that everyone in the bank are going to be killed, except Krish, before commandos arrive and take control of the situation, and Dayalan is suspended.\n\nRating 10: In the bank, Dark Devil opens the secret locker with the help of Radha and his men, only to find that the money is counterfeit money.\n\nRating 8: Dark Devil locks Krish, Sunil and Harsha in the secret locker, before Krish reveals that the money is stacked in 25 of the 1500 containers of his ship, which he discreetly records as a video.\n\nRating 10: The commandos open fire, with the bank severely damaged.\n\nRating 8: Krish, Sunil and Harsha are killed in the secret locker by an explosive.\n\nRating 10: Kanmani arrives in a fire truck stuffed with RDX, and threatens to detonate them, unless the hostages are released, forcing the commandos to cease fire.\n\nRating 3: She along with Dark Devil, wearing masks, escape with the help of the public and reach a boat, planning to escape by sea, while Radha and his gang also escape in the ensuing chaos.\n\nRating 3: A chase ensues where Dark Devil, Kanmani, and the rest of their team shoot the commandos and coast guards, using an M2 Browning.\n\nRating 8: However, they get shot and fall into the sea.\n\nRating 8: Later, the media broadcasts the video which Dark Devil discreetly recorded, and Dayalan's suspension is revoked.\n\nRating 6: Meanwhile, Dark Devil and Kanmani fake their deaths and escape using sea scooters and reached their boat, settling in international waters.\n\nRating 3: Dayalan and his team board a helicopter to the ship, where they find the ₹25,000 crore."
},{
    "genre": "Action",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Action & Adventure",
        "Spy Movies"
    ],
    "id": 81633804,
    "tag": "Action Movies",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABSh5OIb9OQUuKM7QDV4oJTAwICHQby-SVebQvnP_WuQj1KrOYTo_JXjzeXWcctCsOjITF0E2w8hRuNMsIVrlgJdW8upxgq-LwxdX958FWfyRmFpVTyrl6oMYGdwtXMBUr5_T.jpg?r=23e",
    "source": "https://www.netflix.com/in/title/81633804",
    "index": 40,
    "name": "Mission Majnu",
    "maturity": "U/A 16+ ",
    "duration": "2h 9m",
    "synopsis": "In the 1970s, an undercover Indian spy takes on a deadly mission to expose a covert nuclear weapons program in the heart of Pakistan.",
    "year": "2023",
    "spoilers": "\n\nRating 8: In 1971, Amandeep \"Aman\" Singh IPS is a deep cover RAW field operative, who is in Pakistan on an undercover assignment under the pseudonym Tariq Hussain.\n\nRating 10: Along the way, Aman falls in love with Nasreen Hussain, a blind girl and the two get married.\n\nRating 10: On May 1974, India conducted its first nuclear test, due to which Pakistan secretly rushed to build their own nuclear weapon with the help of nuclear engineer Abdul Qadeer Khan.\n\nRating 10: During the 1977 Indian general election campaign, Prime Minister Indira Gandhi is appraised of the situation by RAW Chief R. N. Kao, and directs him to find the location of the nuclear facility.\n\nRating 6: Aman is assigned for the mission by Kao.\n\nRating 7: Aman's handler Sharma, inform him of his new mission, named \"Mission Majnu\".\n\nRating 9: Along the way, Aman meet two other RAW agents named Aslam Usmaniya and Raman Singh , who are stationed in Pakistan.\n\nRating 7: Aman manage to gather information that Pakistan are actually indeed making a nuclear weapon.\n\nRating 10: Following a general election in India, a new government is formed and its new leader believes in building relationship through diplomacy and peaceful means, and is against any form of warfare including spying and intelligence gathering.\n\nRating 8: Kao resigns to keep the operation in Pakistan going, and hidden from Morarji Desai.\n\nRating 10: Amandeep's operation takes a hit, but continues the mission.\n\nRating 7: In the meantime relationship bodes between India and Pakistan.\n\nRating 10: Israel is readying an attack on Quetta military facility, wrongly believing it to be a nuclear weapon facility.\n\nRating 10: Aman manage to locate the nuclear facility at Kahuta, but is unable to collect physical evidence.\n\nRating 6: Sharma informs them that Israel is going to attack Quetta in 48 hours.\n\nRating 3: Aman goes back to Kahuta and collects hair of Army personnel working in the nuclear facility, which he surreptitiously sends it to India, where it is tested and found to contain trace amount of radiation, pointing to presence of plutonium in Kahuta, and under Pakistan administration.\n\nRating 3: Israel attack on Quetta is averted.\n\nRating 3: The matter is disclosed to Desai In light of new evidence, where he weighs in on Pakistan counterparts and Pakistan's inability to be trusted.\n\nRating 4: ISI hunts down and kills covert RAW agents operating in Pakistan including Aman's colleagues Aslam and Raman.\n\nRating 6: Aman tries to escape to Dubai with a pregnant Nasreen, who doesn't know that the ISI agents are chasing them.\n\nRating 8: Aman distracts ISI agents long enough to let Nasreen board an aeroplane and leave unhindered, where he is killed in the process.\n\nRating 8: Nasreen lands in Dubai, where she meets Kao at the airport, and reads a letter from Aman revealing his true identity."
},{
    "genre": "Action",
    "related-genre": [
        "Movies Based on Books",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 80230399,
    "tag": "Action Movies",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABcUjzHFgb4aq-ldAOLiJgBTZWSNhomBYYC-tmwn7yrEOO_h42ba43f6K5fYm0Q6cINHObchs3dFQe0tL_DqUsTPUA6KXFCXsm61SRoeEmizLqGlZOFU9GREGBKIf-qq8eh6A.jpg?r=362",
    "source": "https://www.netflix.com/in/title/80230399",
    "index": 41,
    "name": "Extraction",
    "maturity": "A ",
    "duration": "1h 58m",
    "synopsis": "A hardened gun-for-hire's latest mission becomes a soul-searching race to survive when he's sent into Bangladesh to rescue a drug lord's kidnapped son.",
    "year": "2020",
    "spoilers": "\n\nRating 3: Ovi Mahajan – son of incarcerated Indian drug lord Ovi Mahajan.\n\nRating 4: Sr – sneaks out of his house to visit a club with his friend.\n\nRating 6: At the party, Ovi and his friend go to the garage to have a smoke, where they encounter corrupt police officers working for rival Bangladeshi drug lord Amir Asif, who shoot Ovi's friend and kidnaps him.\n\nRating 7: After discovering this, Saju Rav — a former Lieutenant Colonel in the Indian Army Para Special Forces and Ovi's protector — visits Ovi's father in prison.\n\nRating 10: Unwilling to pay the ransom or surrender his territories to Amir as it will hurt his prestige, Ovi's father orders Saju to retrieve his son, threatening to kill Saju's own son if he is unwilling to do so.\n\nRating 3: Tyler Rake, a former Australian Army Special Air Service Regiment  operator turned black-market mercenary, is recruited by his handler Nik Khan to save Ovi from Dhaka, Bangladesh.\n\nRating 3: Tyler and Khan's team prepare to extract Ovi, with his father's men set to pay them once Ovi is recovered.\n\nRating 10: Tyler saves Ovi, kills his captors, and takes him to the extraction point.\n\nRating 8: Learning of Ovi's escape, Asif orders the head of the local police, Colonel Rashid, to initiate an immediate lockdown of Dhaka, securing all bridges and travel points out of the city.\n\nRating 10: Ovi's father's men intentionally fail to transfer the funds as it is revealed that Ovi Sr's bank account has been frozen by the authorities, so he had no means to pay the mercenaries in the first place.\n\nRating 10: Saju kills Tyler's teammates and tries to kill Tyler so he can save Ovi himself and cheat the mercenaries out of their payment.\n\nRating 10: Khan arranges for a helicopter to extract Tyler outside the city and tells him to abandon Ovi since the contract has been nullified.\n\nRating 3: Tyler refuses to leave Ovi behind, haunted by memories of his own son, whom he abandoned after he couldn't stand seeing him suffer from lymphoma any longer.\n\nRating 3: After escaping Saju and the corrupt Dhaka Metropolitan Police tactical units on Asif's payroll, Tyler fights off a gang of boys led by Farhad, a young criminal eager to impress Asif.\n\nRating 10: Tyler calls his friend Gaspar, a retired squad-mate living in Dhaka, and he and Ovi lay low at Gaspar's home for the evening.\n\nRating 3: Gaspar reveals Asif has placed a $10,000,000 bounty on Ovi, which he offers to share if Tyler allows him to kill Ovi.\n\nRating 8: Tyler refuses and fights Gaspar, who gains the upper hand but is foolishly shot by Ovi with Gaspar's own gun.\n\nRating 3: Tyler calls Saju and asks for his help, forcing them to team up to escape Dhaka.\n\nRating 10: Tyler draws attention away from a disguised Saju and Ovi as the two make their way through a bridge checkpoint before following to cover their escape.\n\nRating 7: Khan and her remaining mercenaries approach from the opposite side of the bridge, as Asif watches from afar with binoculars.\n\nRating 3: In the ensuing firefight, Saju is shot by Rashid, who is in turn shot by Khan.\n\nRating 6: Wounded, Tyler instructs Ovi to run to Khan's waiting helicopter.\n\nRating 3: As a badly wounded Tyler follows, he is shot in the neck by Farhad and seeing Ovi is safe, falls into the river.\n\nRating 8: Ovi, Khan, and the extraction team escape to Mumbai and safety.\n\nRating 10: Eight months later, Khan encounters Asif in a restroom and promptly shoots him.\n\nRating 10: Ovi jumps into his school's swimming pool to practice holding his breath, mirroring the scene where Tyler is introduced.\n\nRating 3: He surfaces to see a blurred vision of a man, resembling Tyler, watching him."
},{
    "genre": "Action",
    "related-genre": [
        "Action & Adventure"
    ],
    "id": 81508719,
    "tag": "Action Movies",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABUfBoFJ9GGgUN9j2aXlD5JXGZJlwkl-Kwp3rbRdDPNCdPK8enVYjVyfJFgYVwj70gl6wFTlAOrU8FKV7Gwc04BKQ-0_UFyBoXsY.jpg?r=4b5",
    "source": "https://www.netflix.com/in/title/81508719",
    "index": 42,
    "name": "Raw",
    "maturity": "U/A 16+ ",
    "duration": "2h 36m",
    "synopsis": "A jaded former intelligence agent is pulled back into action when an attack at a mall creates a tense hostage situation.",
    "year": "2022",
    "spoilers": "\n\nRating 3: Lifelong vegetarian Justine begins her first semester at veterinary school, the same one her older sister Alexia is attending and where their parents met.\n\nRating 3: On her first night, she meets her roommate Adrien, and they are forced to partake in a week-long hazing ritual, welcoming the new students.\n\nRating 3: They are brought to a party, where Alexia shows Justine old class photos of students bathed in blood, including one with their parents.\n\nRating 10: The next morning, the new class is splattered with blood and is forced to eat raw rabbit kidneys.\n\nRating 6: Justine refuses because of her vegetarianism, but Alexia forces her to eat one.\n\nRating 10: Justine leaves with Adrien and later discovers an itchy rash all over her body.\n\nRating 8: She goes to the doctor, who diagnoses her with food poisoning and gives her cream for the rash.\n\nRating 8: The next day, Justine begins having cravings for meat, which makes her feel ashamed.\n\nRating 10: She and Adrien take a late-night trip to a gas station so no one will see her eating meat.\n\nRating 10: Unsatisfied, she eats raw chicken in the morning, and later throws up a long bundle of her own hair she had been chewing on.\n\nRating 10: That night, Alexia attempts to give her a bikini wax, but when Alexia tries to cut the wax off with sharp scissors, Justine kicks her away and Alexia accidentally cuts off her own finger.\n\nRating 3: Alexia faints, and Justine picks up the finger, tastes the blood, and starts eating it.\n\nRating 4: Alexia wakes up to find Justine doing this but later tells their parents that her dog, Quicky, ate it.\n\nRating 7: The next morning, Alexia takes Justine to a deserted road, where Alexia jumps in front of a car, causing the two people in it to crash into a tree.\n\nRating 10: Alexia starts eating one of the passengers so that her sister would \"learn\"; instead, Justine is dismayed.\n\nRating 8: Despite this, Justine's craving for human meat grows and she starts lusting after Adrien.\n\nRating 10: That night, she arrives at a party, where paint is thrown at her as part of another hazing ritual and she is forced to make out with someone.\n\nRating 8: While kissing, Justine bites the middle of his bottom lip off, leaving the other party guests shocked and disgusted.\n\nRating 8: Justine goes back to her dorm and takes a shower, where she picks a chunk of his lip out of her teeth and eats it.\n\nRating 6: Justine confides in Adrien and they end up having sex, during which Justine tries to bite Adrien but instead bites her own arm until it bleeds profusely, seeming to orgasm while doing so.\n\nRating 8: At another party, Justine gets extremely intoxicated and Alexia takes her to the morgue.\n\nRating 8: The next day, everyone in school stares at Justine, some avoiding her.\n\nRating 7: Adrien shows her a video where Justine is crawling on all fours, attempting to take a bite out of the arm of a corpse as Alexia eggs her on, to boos and cheers from a crowd of watching party guests.\n\nRating 3: Justine confronts Alexia and fights her, eventually biting each other until they are pulled apart by other students.\n\nRating 10: Justine helps Alexia up, and they walk each other back to their dorms.\n\nRating 8: The next morning, Justine wakes up in bed with Adrien but she notices she is covered in blood.\n\nRating 10: She pulls off the blankets, finding Adrien dead with most of his right leg eaten and a stab wound in his back.\n\nRating 10: Justine then sees a bloody Alexia slumped on the floor.\n\nRating 3: Justine is initially furious that Alexia killed Adrien but then cleans Alexia and herself up in the shower.\n\nRating 3: Alexia is imprisoned for the murder of Adrien, and Justine is sent back home.\n\nRating 8: There, Justine's father tells her that what happened is neither hers nor Alexia's fault.\n\nRating 8: He explains that when he first met their mother, he could not understand why she did not want to be with him.\n\nRating 3: Her father says he finally realized when they kissed the first time, indicating a scar on his lip.\n\nRating 3: He then opens his shirt, revealing scars and missing chunks of his chest, and tells Justine that she will find a solution."
},{
    "genre": "Action",
    "related-genre": [
        "Action & Adventure"
    ],
    "id": 81656709,
    "tag": "Action Movies",
    "image": "https://occ-0-3663-3662.1.nflxso.net/dnm/api/v6/6gmvu2hxdfnQ55LZZjyzYR4kzGk/AAAABRFhZ5DEMlsNrloisG4lNMuiS6-u8eMaOtDLmb7V6_uf94qAF71k46iaX44TBn_SHMiY-kXxMEhBwrHdh2m1TE6qhxHSt5m7CFw.jpg?r=fbd",
    "source": "https://www.netflix.com/in/title/81656709",
    "index": 43,
    "name": "Kantara",
    "maturity": "U/A 16+ ",
    "duration": "2h 27m",
    "synopsis": "A fiery young man clashes with an unflinching forest officer in a south Indian village where spirituality, fate and folklore rule the lands.",
    "year": "2022",
    "spoilers": "\n\nRating 8: In 1847, there lived a king that had a great kingdom as well as a loving wife and child, but could not find peace.\n\nRating 10: He sets out on a journey to discover true happiness and comes upon a stone in a forest occupied by Panjurli Daiva , a deity that protects the villagers that reside in the forest.\n\nRating 6: He donates vast portion of his land to the villagers in exchange for taking the stone with him.\n\nRating 8: Panjurli warns the king that his family and successors should keep their word and not reclaim the land, which will incur the wrath of Panjurli's companion, the ferocious Goblin named Guliga Daiva.\n\nRating 10: In 1970, the King's successor asks a Bhoota Kola performer, who is possessed by Panjurli to make the locals hand over the land to him, which the performer refuses and states he will die vomiting blood if he tries to reclaim it.\n\nRating 10: The successor raises doubt on performer's possession by Panjurli, to which the performer replies he would vanish if he is possessed, after which he runs into the forest and is indeed never seen again.\n\nRating 10: As warned, the king's successor dies mysteriously, vomiting blood a few months later on the steps of the court, where he was going to argue the land case.\n\nRating 10: In 1990, Murali, a forest officer, is tasked with converting the villagers' land into a forest reserve.\n\nRating 3: However, he is challenged by Shiva, a Kambala athlete from the Kaadubettu village and the missing performer's son.\n\nRating 10: Shiva is backed by his patron and the village's landlord, Devendra Suttooru, who is the king's successor in the present.\n\nRating 8: Although Shiva is continually asked to perform the Bhoota Kola, he refuses due to the trauma of his father's disappearance.\n\nRating 6: Instead, his cousin Guruva takes his place.\n\nRating 3: Murali and his staff start erecting a fence along the earmarked forest reserve.\n\nRating 10: Shiva falls in love with his friend Leela and uses his connections with Devendra to appoint her as a forest guard.\n\nRating 10: The villagers try to stop the fencing, but the police and forest guards  brutally suppress them, creating a rift between Leela and Shiva even though she was following orders and could do nothing about the situation.\n\nRating 8: As the feud between Murali and Shiva intensifies, Murali decides to arrest Shiva and his friends and heads to their hideout along with Devendra's henchman Sudhakara.\n\nRating 10: During the search, Murali's jeep accidentally gets crushed by the trunk of a tree, which was cut by Shiva as the latter didn't expect Jeep on the way.\n\nRating 3: While Murali survives with severe injury, Shiva and his companions go undercover to avoid arrest.\n\nRating 8: A few days later, they return to the village to meet their families; Shiva makes up with Leela and tells her that he will surrender.\n\nRating 7: However, they are caught by the police and forest guards the morning after.\n\nRating 8: Guruva asks Devendra to bail Shiva, but during conversation Devendra instead tries to bribe him to act as if Panjurli orders the villagers to give him their land in the next Bhoota Kola, revealing his true intention of acquiring his ancestral land given by his predecessor to villagers.\n\nRating 10: Guruva refuses and Devendra kills him; learning that Murali has figured out his ulterior motive, Devendra decides to set Shiva against him.\n\nRating 8: Having learnt about Guruva's death, Shiva meets Devendra, who lies that Murali is the Guruva's killer.\n\nRating 3: Enraged, Shiva goes to kill Murali, but learns from his blacksmith friend Mahadeva that Devendra himself killed Guruva.\n\nRating 9: Shiva is attacked by Devendra's henchmen, but manages to escape and meet the villagers, whom Murali has told about Devendra's land seizure.\n\nRating 10: After Shiva reveals that Devendra killed Guruva, he and Murali set aside their grudge and unite the village.\n\nRating 8: Devendra and his henchmen attack, leading to an intense battle where several of the villagers are killed.\n\nRating 8: After nearly dying in the fight, Shiva hits his head against Panjurli's stone.\n\nRating 4: Suddenly, he becomes possessed by the Guliga Daiva.\n\nRating 6: Due to that possession, Shiva brutally kills Devendra and his henchmen.\n\nRating 10: A few months after the battle, Shiva performs the Bhoota Kola, and is possessed by Panjurli, where he, Murali and the villagers join hands in a symbolic gesture.\n\nRating 7: Later, Shiva disappears into the forest after meeting what seems to be his father's spirit.\n\nRating 3: In the mid-credits scene, Shiva and Leela's son asks Sundara about his father's disappearance."
},{
    "genre": "Action",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Crime Movies",
        "Dramas",
        "Comedies",
        "Action & Adventure"
    ],
    "id": 81508740,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81508740",
    "index": 44,
    "name": "Kuttey",
    "maturity": "U/A 16+ ",
    "duration": "1h 48m",
    "synopsis": "Crooked cops, an aging crime lord and cutthroat rebels collide when a plan to loot a high-security van transporting cash careens into chaos.",
    "year": "2023",
    "spoilers": "\n\nRating 8: One rainy night in the outskirts of Mumbai, three stray gangs unknowingly cross paths on the hunt for a van carrying crores of cash and it's every man for himself.\n\nRating 10: A complex maze of subplots with greed as the Common motive leads to a tense often hilarious chain of events."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Comedies",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81161626,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81161626",
    "index": 45,
    "name": "Red Notice",
    "maturity": "U/A 13+ ",
    "duration": "1h 58m",
    "synopsis": "An FBI profiler pursuing the world's most wanted art thief becomes his reluctant partner in crime to catch an elusive crook who's always one step ahead.",
    "year": "2021",
    "spoilers": "\n\nRating 10: During the 1st century BC, Roman general Mark Antony gives Egyptian queen Cleopatra three bejeweled eggs as a wedding gift to show his devotion.\n\nRating 10: The eggs are lost in time until two are found by a farmer in 1907, but the last one remains lost.\n\nRating 7: In the present day, John Hartley, an FBI agent, is assigned to assist Interpol agent Urvashi Das in investigating the potential theft of one of the eggs on display at the Museo Nazionale di Castel Sant'Angelo in Rome.\n\nRating 8: The head of security dismisses the concerns, but Hartley reveals the egg is a forgery and the real egg has been stolen.\n\nRating 8: Before the room is sealed shut, international art thief Nolan Booth manages to escape with the egg.\n\nRating 10: Arriving at his home in Bali with the egg, he finds Hartley, along with Das and an Interpol strike team there.\n\nRating 3: They arrest Booth and take the egg into custody.\n\nRating 8: Unbeknownst to everyone, his main competition, Sarah \"The Bishop\" Black, disguised as one of the strike team members, swaps the real egg with another forgery.\n\nRating 7: The next day, Das confronts Hartley and has him incarcerated in a remote Russian prison in the same cell as Booth, believing he's responsible for the theft.\n\nRating 3: Shortly after arrival, Black proposes that Booth work with her to find the third egg as he knows about its whereabouts.\n\nRating 7: He declines her modest offer, so Hartley suggests they work together to defeat her; if Booth helps him imprison her, Booth will be the number one art thief in the world.\n\nRating 3: The pair escapes from prison, heading to Valencia to steal the second egg, in possession of notorious arms dealer Sotto Voce who is having a masquerade ball.\n\nRating 8: They find Black, who is also there to steal it.\n\nRating 3: The three arrive in Voce's vault where Hartley and Booth fight her.\n\nRating 8: Voce arrives with his security detail while Black reveals she is working with Voce.\n\nRating 3: They torture Hartley until Booth reveals the location of the third egg.\n\nRating 4: Black betrays Voce and leaves for Egypt where Booth claims it is.\n\nRating 8: After leaving Valencia, Booth reveals to Hartley that the egg is actually in Argentina, a location only he knows as it was inscribed on his late father's beloved watch which had once belonged to Adolf Hitler's personal art curator Rudolph Zeich.\n\nRating 7: Searching the jungle, they find a secret bunker containing countless Nazi artifacts, including the third egg.\n\nRating 5: Black arrives and steals the egg from them, only to be interrupted by Das and a team of local police.\n\nRating 5: Hartley, Booth and Black escape in an antique 1931 Mercedes-Benz 770, chased by Das in an armored vehicle.\n\nRating 3: Eventually, they exit near the top of a waterfall where they jump.\n\nRating 3: Booth swims to shore with the egg, only to discover that Hartley is actually not an FBI profiler, but a conman like his father, and shares the Bishop mantle with Black; Hartley and Black are romantically involved, work together as a team, and have planned the entire heist from the very beginning, intentionally using Booth to take them to the third egg.\n\nRating 10: Booth surrenders the egg and they leave him handcuffed.\n\nRating 8: In Cairo, Hartley and Black deliver the three eggs to an Egyptian billionaire, in time for his daughter's wedding although she is more excited for the wedding singer Ed Sheeran.\n\nRating 8: The wedding is subsequently interrupted by an Interpol raid by Das, who arrest the billionaire, his daughter, and Sheeran.\n\nRating 8: Six months later, Hartley and Black are met again by Booth in Sardinia, who informs them that he told Das about their Cayman Islands account containing the $300 million payout, which Das freezes leaving them with no money.\n\nRating 3: Booth also reveals that Interpol is on their way to capture them, but offers a chance to escape if they help him with a new heist, which requires three individuals to pull off.\n\nRating 10: They agree and escape, where Das places red notices on all three of them as they begin their heist at the Louvre in Paris."
},{
    "genre": "Sci-Fi",
    "related-genre": [
        "Sci-Fi Movies",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81023636,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81023636",
    "index": 46,
    "name": "Time Trap",
    "maturity": "U/A 13+ ",
    "duration": "1h 27m",
    "synopsis": "To find their missing professor, a group of students ventures into the cave where he disappeared and uncover a bizarre mystery that alters their reality.",
    "year": "2017",
    "spoilers": "\n\nRating 8: Hopper, an archaeology professor, is exploring a remote cave system on the trail of missing hippies from the 1970s.\n\nRating 10: After discovering what appears to be a cowboy paused in place in a tunnel, he returns to town and dismisses his graduate students, Taylor and Jackie, stating that their research is done.\n\nRating 8: Several days later, as Hopper has not returned, Taylor and Jackie go looking for him, with their friend Cara, who brings her sister, Veeves, and her friend Furby.\n\nRating 8: Following Hopper's trail to the campsite by a cave, they find an entrance with climbing ropes leading inside.\n\nRating 8: They decide to follow it, but Furby chooses to stay behind as backup for the base camp.\n\nRating 7: They lower themselves into the cave, hearing strange noises.\n\nRating 10: When Furby does not answer their radio calls, Jackie tries to climb back out, but the rope frays, and she falls, injuring herself and Taylor.\n\nRating 7: Calling for help, they receive a transmission from inside the cave and follow it.\n\nRating 10: At a different junction, they discover another opening to the cave and Furby, dead with a broken neck.\n\nRating 3: Watching his video recordings, they notice several days elapsed from his perspective, while only about an hour had lapsed in the cave.\n\nRating 3: He began researching the hippies' belongings, discovering they were Hopper's parents and that he is searching for his missing sister.\n\nRating 3: His parents were following legends of the Fountain of Youth and speculated that this cave system was the root of the story.\n\nRating 7: Furby found another cave opening.\n\nRating 10: After several days, he went into the cave to retrieve keys for a vehicle but fell when his rope severed.\n\nRating 10: Taylor deduces the cave is inside a time distortion where events move more slowly.\n\nRating 8: With few options, Cara free-climbs out of the cave to get a GPS signal.\n\nRating 10: Outside, the terrain has become barren, and there is no signal.\n\nRating 7: Returning to the cave, comparing video recordings, Cara has experienced 30 minutes on the surface while she had been gone only a few seconds from their viewpoint, confirming Taylor's theory.\n\nRating 8: Reviewing Furby's footage again, they learn he survived the fall but was murdered by a caveman.\n\nRating 8: Cara and Taylor deduce the time difference is much more drastic than they suspected and entire years are passing within seconds, meaning the few hours they have been in the cave is enough to span several hundred or thousand years outside.\n\nRating 7: Hearing more howling, Cara prepares to climb out again for help but is interrupted by a futuristic humanoid spaceman descending via a retractable ladder.\n\nRating 3: A caveman suddenly attacks, but is subdued non-lethally.\n\nRating 8: They flee just to find a whole tribe of cavemen inspecting the dead bodies of the cowboy and Hopper's parents.\n\nRating 8: Discovered, Taylor fights the cavemen and is killed.\n\nRating 10: The spaceman returns, protects the others from the cavemen, and then places Taylor into a healing pool of water.\n\nRating 8: More cavemen attack, and the spaceman is fatally wounded, but uses his dying breaths to show them several media clips about their disappearance and indicating that humans have become space-faring.\n\nRating 10: Taylor finds Hopper injured in front of another time dilation, containing his long-missing sister and a legion of conquistadors in battle with the cavemen over control of a waterfall, the source of the time distortion, at the center of the cave system.\n\nRating 10: Hopper explains the field is strongest here, making rescue of his sister impossible; he tells Taylor to go and save the others, as he is also dying.\n\nRating 10: Preparing to leave the cave with the spaceman's ladder, the students are attacked by cavemen before they can get through; Cara is pulled through the portal by future beings before she can help her friends.\n\nRating 8: From their perspective, she reappears through the portal, differently dressed and with rope-like mechanisms which pull her friends through.\n\nRating 10: A short time later, Furby awakens, along with Hopper and Hopper's family, all having been retrieved and resurrected with the healing waters.\n\nRating 10: The others arrive, happily explaining they are in a space station and have a lot to talk about."
},{
    "genre": "Drama",
    "related-genre": [
        "Hindi-Language Movies",
        "Dramas",
        "Movies Based on Real Life",
        "Action & Adventure"
    ],
    "id": 81242574,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81242574",
    "index": 47,
    "name": "Major",
    "maturity": "U/A 16+ ",
    "duration": "2h 25m",
    "synopsis": "This biopic follows the life of Indian Army officer Major Sandeep Unnikrishnan, from his childhood to his heroic actions during the 2008 Mumbai attacks.",
    "year": "2022",
    "spoilers": "\n\nRating 10: The movie starts with Sandeep Unnikrishnan entering the POK, which the Pakistani Army considers a threat and orders him to retreat.\n\nRating 3: When questioned by the Indian Army Officials on why he did it and that the area belongs to Pakistan, he replies \"It is ours\".\n\nRating 10: Young Sandeep grows up with his sister, Sandhya, and his parents K. Unnikrishnan and Dhanalakshmi, in Yelahanka, Bangalore.\n\nRating 10: As a child, he was very curious about the world around him.\n\nRating 10: When Unnikrishnan took him to see a Navy ceremony with military airplanes flying in the sky Sandeep developed an early fascination with the life of a soldier.\n\nRating 10: In his later years as a secondary school student, Sandeep falls in love with his classmate, Isha.\n\nRating 3: Sandeep applied to join the Indian Navy without telling his parents, much to the fury of Unnikrishnan.\n\nRating 3: However, the Navy rejected Sandeep's application, causing Sandeep to ultimately join the army.\n\nRating 10: As the years progressed, Sandeep rises  ranks to become an NSG training officer.\n\nRating 5: In 2008, Sandeep is well established in his career as a training officer for the 51 Special Action Group of the NSG and is married to Isha, but their marriage is in trouble.\n\nRating 8: Sandeep asks for leave to try and save his marriage.\n\nRating 3: On the same day as Sandeep's leave though, Pakistani terrorists arrive in Mumbai by boat and they proceed to orchestrate deadly attacks in the city.\n\nRating 3: Desperately crowds start heading to the Taj Hotel for safety but the terrorists also enter the hotel and start shooting at staff and guests spontaneously.\n\nRating 10: The local police are called to the scene but they are ill-equipped to deal with the threat.\n\nRating 3: Upon discovering the terrorist attacks in Mumbai, Sandeep requests Commander Shera to allow him to participate in the NSG mission to neutralize the terrorist threat.\n\nRating 8: They leave for Mumbai and commence the military counterterrorism operation: Operation Black Tornado, but the NSG encounters numerous obstacles and problems upon arriving at the scene.\n\nRating 10: They lack surveillance cameras to discover the number of people inside the building.\n\nRating 8: The terrorists have installed deadly booby traps and trip wires with bombs throughout the premises.\n\nRating 8: Several hotel staff and guests end up crowded together in a locked room, all bound and gagged on the floor.\n\nRating 10: To make matters worse there is an intrusive media circus swarming outside the hotel reporting the NSG's known operations and movements, information which the terrorists use.\n\nRating 3: Meanwhile, a guest named Pramoda Reddy, who is trapped on the fifth floor, manages to keep herself hidden from the gunmen.\n\nRating 10: She ultimately takes responsibility to rescue British tourist's young daughter, named Shirley.\n\nRating 8: Sandeep talks to Isha over the phone.\n\nRating 8: She is applying for divorce and scolds Sandeep for not being there with her when she had a miscarriage, but she is horrified when she discovers that Sandeep is at the Taj Hotel.\n\nRating 10: As the NSG rescue more hostages  and starts closing in on the remaining terrorists, Pramoda calls the downstairs lobby using a walkie-talkie from one of the dead security guards.\n\nRating 8: Sandeep ultimately decides to go to the 5th floor to save them, saying that he would never be able to forgive himself if he did not save her.\n\nRating 6: His colleagues subsequently use tear gas and Sandeep races up to the 5th floor.\n\nRating 10: He ultimately rescues Pramoda and Shirley and heroically kills some of the terrorists.\n\nRating 10: However, when his CO asks him whether he needs reinforcement or not, he refuses.\n\nRating 8: His last words are \"Do not come up, I will handle them.\"\n\nRating 6: But as fate would have it, he is killed in action, laying down his life for his country.\n\nRating 3: Major Sandeep's parents watch in horror as the news coverage shows that Sandeep was killed in action.\n\nRating 10: They had thought that since Sandeep was a training officer he was not involved in the rescue mission at the Taj Hotel.\n\nRating 10: After his death, there is a large military funeral and a crowd of well-wishers gather to mourn Sandeep's passing.\n\nRating 10: Isha is devastated at Sandeep's death and discovers that he never signed the divorce papers.\n\nRating 3: Later, a 10-year commemoration ceremony in 2018 honoring the lives taken during the attack is held at the Taj Hotel.\n\nRating 10: During the commemorations, Pramoda is reunited with Shirley whose life she had saved.\n\nRating 7: Mr. Unnikrishnan gives an impassioned speech in which he says that Sandeep should be remembered not for how he died, but for how he lived.\n\nRating 8: As Unnikrishnan recalls during his speech, a flashback shows the continuation of the beginning of the movie.\n\nRating 8: It is shown that Sandeep was playing cricket with the children from Pakistan, and when he was called back, he waves goodbye and promises the children that he would come to play another time."
},{
    "genre": "Comedies",
    "related-genre": [
        "Family Features",
        "Comedies",
        "Action & Adventure",
        "Spy Movies"
    ],
    "id": 70184054,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70184054",
    "index": 48,
    "name": "Johnny English Reborn",
    "maturity": "U/A 13+ ",
    "duration": "1h 41m",
    "synopsis": "Bumbling spy Johnny English sharpens his skills at a Tibetan monastery and returns to service to protect the Chinese premier from an assassin.",
    "year": "2011",
    "spoilers": "\n\nRating 3: Five years after the events of the first film, Johnny English has been training at a monastery in Tibet to recover from the shame of a failed mission to protect the newly elected president in Mozambique, which cost him his knighthood.\n\nRating 3: Called back into service by MI7 under new director Pamela \"Pegasus\" Thornton, English must investigate an assassination plot of the Chinese Premier during talks with the Prime Minister of the United Kingdom.\n\nRating 8: He meets fellow agent Simon Ambrose, MI7's quartermaster Patch Quartermain, and junior agent Colin Tucker, assigned to be his assistant.\n\nRating 3: In Hong Kong, English finds former CIA agent Titus Fisher, a member of Vortex, the group responsible for sabotaging English's Mozambique mission.\n\nRating 4: Vortex holds a secret weapon unlocked by three keys, held by himself and two others.\n\nRating 10: Fisher is killed by an elderly assassin disguised as a cleaner, and an accomplice steals his key.\n\nRating 8: English chases the thief and recovers the key, only for it to be stolen by a fake flight attendant en route to London.\n\nRating 10: He is humiliated in a meeting with the Foreign Secretary and Pegasus when he attempts to present the key and the conspiracy.\n\nRating 10: He compounds his disgrace by mistakenly attacking Pegasus’s mother twice at a children's party after encountering the Killer Cleaner.\n\nRating 5: Kate Sumner, MI7's resident behavioral psychologist, uses hypnosis to help English recall his suppressed memory of the Mozambique incident, revealing that another Vortex operative, former Russian KGB and renegade MI7 associate spy Artem Karlenko, is posing as millionaire Sergei Pudovkin.\n\nRating 10: English and Tucker meet Karlenko at a golf course outside London, but the Killer Cleaner critically injures him during their game.\n\nRating 10: English and Tucker bring Karlenko to a hospital by helicopter, but he dies after revealing the third key is held by a mole in MI7.\n\nRating 8: Over dinner, English confides with Ambrose about the mole, and Ambrose tells him that he suspects Quartermain.\n\nRating 10: In the restaurant's toilets, Tucker confronts Ambrose about him being the traitor, but English naively dismisses Tucker, letting Ambrose go with Karlenko's key.\n\nRating 8: English confronts Quartermain at a church, but realizes that he has been framed as the third Vortex member.\n\nRating 3: Chased by MI7 agents, English manages to escape to Sumner's flat, after stealing Quartermain's heavily modified wheelchair.\n\nRating 10: Reviewing footage of the Mozambique mission, Sumner sees that the assassin was manipulated by a supposedly-destroyed mind control drug, Timoxeline Barbebutenol.\n\nRating 5: Ambrose comes to pick her up, and English realizes that he is the mole and third member of Vortex.\n\nRating 3: Evading the Killer Cleaner by jumping down a rubbish chute, English goes to the flat where Tucker lives with his mother; English apologizes to Tucker and persuades him to join in infiltrating Le Bastion, a nigh-impregnable fortress in the Swiss Alps where the talks are to be held.\n\nRating 8: At the fortress, English accidentally activates a distress beacon, alerting the guards to their presence.\n\nRating 8: He commands Tucker to knock him out and put him inside a body bag, so that they will be taken into the fortress.\n\nRating 3: Inside, English manages to escape the body bag and warns Pegasus of the threat, but accidentally consumes a drink spiked with the drug, and subdues Pegasus on Ambrose's command.\n\nRating 3: Assigning English as the Prime Minister's bodyguard in place of Pegasus, Ambrose orders him to assassinate the Chinese Premier using a pistol disguised as lipstick, initially designed for Pegasus; thanks to his monastic training, English tries to resist the drug.\n\nRating 10: Tucker interrupts Ambrose's communication feed with music before Ambrose resets it, exposing himself as the traitor.\n\nRating 10: English resists again and shoots Ambrose, who escapes, while the drug enters its lethal stage and English loses consciousness.\n\nRating 10: Sumner arrives and revives English with a passionate kiss.\n\nRating 6: English pursues Ambrose down the mountainside, and they engage in a fistfight in a cable car.\n\nRating 8: English overpowers Ambrose, but falls out of the carriage.\n\nRating 10: Ambrose shoots at him, who tries to use his spy umbrella as a bulletproof shield, which is actually a missile launcher when he closes it.\n\nRating 10: The missile destroys the carriage, killing Ambrose.\n\nRating 8: Vortex is shut down and English has his knighthood reinstated by Her Majesty the Queen.\n\nRating 8: During the ceremony, the Killer Cleaner, disguised as the Queen, attacks English with the knighting sword before fleeing, leading English to restrain the real Queen.\n\nRating 8: He only realises his mistake when the assassin is caught by the royal guards and police.\n\nRating 8: During the credits, English prepares dinner for Sumner to the tune of \"In the Hall of the Mountain King\"."
},{
    "genre": "Action",
    "related-genre": [
        "Sci-Fi Movies",
        "Action & Adventure"
    ],
    "id": 70307658,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70307658",
    "index": 49,
    "name": "Lucy",
    "maturity": "A ",
    "duration": "1h 29m",
    "synopsis": "When a young American in Taiwan becomes an unwilling drug mule, the high-tech narcotics get released into her system and activate superhuman powers.",
    "year": "2014",
    "spoilers": "\n\nRating 7: Lucy is an American studying in Taipei, Taiwan.\n\nRating 3: Her new boyfriend Richard tricks her into working as a drug mule for a South Korean kkangpae and drug lord, and she delivers a briefcase containing four packets of the highly valuable synthetic drug CPH4 to Mr. Jang.\n\nRating 10: After witnessing Richard being shot and killed, she is captured and a bag of the drug is forcibly sewn into her abdomen in order to transport the drug to Europe.\n\nRating 8: While in captivity, she is kicked in the stomach, breaking the bag and releasing a large quantity of the drug into her system.\n\nRating 10: She acquires increasingly enhanced physical and mental capabilities, such as telepathy, telekinesis, mental time travel, and the ability to feel no pain.\n\nRating 8: She also becomes both ruthless and emotionless.\n\nRating 8: Using her new abilities, she kills her captors and escapes.\n\nRating 7: Lucy travels to the nearby Tri-Service General Hospital to get the bag of drugs removed from her abdomen.\n\nRating 8: She is told by the operating doctor that natural CPH4 is produced in tiny quantities by pregnant women during their sixth week of pregnancy to provide fetuses with the energy to develop.\n\nRating 8: Growing heightened physical and mental abilities, Lucy returns to Mr. Jang's hotel, kills his bodyguards, assaults him, and telepathically extracts the locations of the three remaining drug mules from his brain.\n\nRating 10: Lucy begins researching her condition and contacts scientist Samuel Norman whose research may be the key to saving her.\n\nRating 3: After Lucy speaks with Norman  she flies to Paris and contacts local police captain Pierre Del Rio to help her find the remaining three packets of the drug.\n\nRating 10: During the flight, she starts to disintegrate as her cells destabilize from consuming a sip of champagne.\n\nRating 10: To stave off her disintegration Lucy ingests more of the drug.\n\nRating 10: With the help of Del Rio, Lucy is able to recover the rest of the drugs.\n\nRating 10: Meeting Norman and his colleagues, she agrees to share with them everything she knows.\n\nRating 4: In the professor's lab, Lucy discusses the nature of time and life and how people's humanity distorts their perceptions.\n\nRating 6: At her urging, she is intravenously injected with the contents of all three remaining bags of CPH4.\n\nRating 6: Her body changes into a black substance that begins spreading over computers and other electronic objects in the lab, transforming them all into one next-generation supercomputer.\n\nRating 9: She mentally begins a spacetime journey into the past, eventually reaching the oldest discovered ancestor of mankind, Lucy.\n\nRating 10: She shares a quiet moment with australopithecus Lucy and the two touch fingertips, she then goes all the way to the beginning of time and witnesses the Big Bang.\n\nRating 4: Meanwhile, Jang enters the lab and points a gun at Lucy's head.\n\nRating 9: He shoots, but by that point Lucy has reached 100% of her brain capacity and promptly disappears, moving into the spacetime continuum.\n\nRating 10: Only her clothes and the black supercomputer are left behind.\n\nRating 7: Del Rio enters and fatally shoots Jang.\n\nRating 10: Norman takes a black flash drive offered by the supercomputer, after which it too disintegrates.\n\nRating 5: Del Rio asks Norman where Lucy is, immediately after which Del Rio's cell phone sounds\n\nRating 8: and he sees a text message: \"I am everywhere.\"\n\nRating 3: Lucy's voice is heard stating \"Life was given to us a billion years ago.\n\nRating 10: Now you know what to do with it."
},{
    "genre": "Action",
    "related-genre": [
        "Movies Based on Books",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81160697,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81160697",
    "index": 50,
    "name": "The Gray Man",
    "maturity": "U/A 16+ ",
    "duration": "2h 9m",
    "synopsis": "When a shadowy CIA agent uncovers damning agency secrets, he’s hunted across the globe by a sociopathic rogue operative who’s put a bounty on his head.",
    "year": "2022",
    "spoilers": "\n\nRating 3: In 2003, senior CIA official Donald Fitzroy visits a prisoner named Courtland Gentry in Florida.\n\nRating 3: Eight years earlier, Gentry was a minor convicted of killing his abusive father to protect his brother.\n\nRating 8: Fitzroy offers him his freedom in exchange for working as an assassin in the CIA's Sierra program.\n\nRating 3: In 2021, Gentry, now known as Sierra Six, is working with fellow CIA agent Dani Miranda to assassinate a target suspected of selling off national security secrets in Bangkok during the national Songkran festival.\n\nRating 8: He is unable to do so stealthily without harming civilians and attacks the target directly, mortally wounding him.\n\nRating 3: Before dying, the target reveals that he worked in the Sierra program as Sierra Four, and hands Six an encrypted drive detailing the corruption of CIA official Denny Carmichael, who is the lead agent on the assassination mission.\n\nRating 3: Carmichael is elusive about the true purpose of the mission and the contents of the drive when confronted by Six, and Six refuses evacuation from Bangkok with Carmichael's men.\n\nRating 8: He sends the drive to former Sierra Program handler Margaret Cahill in Prague, and calls a now-retired Fitzroy to request extraction.\n\nRating 3: Carmichael hires mercenary Lloyd Hansen, an ex-CIA agent kicked out of the agency for his sociopathic tendencies, to track down Six and retrieve the drive.\n\nRating 8: Hansen does so by kidnapping Fitzroy's niece Claire, forcing Fitzroy to authorize Six's murder by the extraction team.\n\nRating 3: However, Six kills them and escapes.\n\nRating 8: Frustrated, Carmichael sends his subordinate Suzanne Brewer to oversee Hansen and keep him in line.\n\nRating 3: Hansen keeps Claire hostage in a mansion in Croatia, where he has based his operations.\n\nRating 6: Hansen also puts a bounty on Six's head to attract mercenaries and assassins to hunt him down.\n\nRating 8: Six heads to Vienna to find Claire's pacemaker's serial number from Laszlo Sosa, but Sosa betrays him for the bounty.\n\nRating 10: Six escapes just as Hansen arrives with his team, and is rescued by Miranda.\n\nRating 8: Miranda's reputation is in tatters following the Bangkok mission and she initially plans to bring him in to salvage her career at the CIA.\n\nRating 8: Six convinces her to drive him to Cahill's apartment in Prague, where she decrypts the drive, which reveals the extent of Carmichael's corruption on behalf of a mysterious benefactor working for a shadow government.\n\nRating 10: Hansen sends several teams of assassins to Cahill's home, and the terminally ill Cahill blows up her home to give Six and Miranda a chance to escape.\n\nRating 8: Six is arrested and handcuffed in the square.\n\nRating 8: A shootout in the streets of Prague follows killing all the police present and Six escapes on a tram.\n\nRating 8: A long chase and gun battle ensues, and Six is saved by Miranda, in Cahill's bulletproof car.\n\nRating 6: The two infiltrate a hospital to track down Claire through the wireless signal broadcast from her pacemaker.\n\nRating 8: The mercenary \"Lone Wolf\" steals the drive from them, knocking them out, and brings the drive to Hansen.\n\nRating 8: Miranda follow the pacemaker to Hansen's base.\n\nRating 8: Miranda creates a distraction while Six infiltrates the mansion and rescues Fitzroy and Claire.\n\nRating 10: Fitzroy is mortally wounded as they flee and sacrifices himself in a failed attempt to kill Hansen.\n\nRating 3: Miranda knocks out Hansen's men, but Lone Wolf narrowly escapes.\n\nRating 8: He defeats Miranda in a fight but gives her the drive, having become disgusted with Hansen's willingness to kill children and his lack of morals.\n\nRating 5: Hansen manages to take Claire hostage and drags her into a hedge maze.\n\nRating 3: After a standoff, Hansen lets go of Claire and fights with Six.\n\nRating 6: Before Six can kill him, Hansen is shot and killed by Brewer, who tells Six that she plans to pin Carmichael's actions on Hansen in order to gain leverage over him.\n\nRating 3: Furthermore, Brewer pledges Claire's safety but only if Six continues to work for the CIA.\n\nRating 10: Six and Miranda are forced to co-operate in the cover-up, where ultimately no action is taken against Carmichael.\n\nRating 8: After the debriefing at the CIA headquarters, Miranda threatens to kill Carmichael if any harm comes to Claire.\n\nRating 8: Six escapes custody and frees Claire, who is being held at a secret location."
},{
    "genre": "Action",
    "related-genre": [
        "Sci-Fi Movies",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81183713,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81183713",
    "index": 51,
    "name": "Godzilla vs. Kong",
    "maturity": "U/A 13+ ",
    "duration": "1h 53m",
    "synopsis": "An ancient rivalry pits two legends against each other while a mission into uncharted terrain unearths clues to the Titans' very origins.",
    "year": "2021",
    "spoilers": "\n\nRating 3: Five years after the dragon-like extraterrestrial King Ghidorah awakened giant monsters, known as \"Titans\", around the world and was defeated by Godzilla, Kong is monitored by Monarch within a giant dome on Skull Island, which has been taken over by the storm that previously kept it hidden from the rest of the world.\n\nRating 8: Kong is visited by Jia, the last Iwi native and adopted daughter of Kong expert Ilene Andrews, who is deaf and communicates with Kong via sign language.\n\nRating 6: Bernie Hayes, an employee of Apex Cybernetics and host of a Titan conspiracy podcast, extracts data suggesting sinister activities at Apex's Pensacola facility.\n\nRating 10: However, Godzilla suddenly attacks the facility; Bernie stumbles on a massive device during the rampage.\n\nRating 3: Madison Russell, a listener of Bernie's podcast, enlists her friend Josh Valentine to investigate Godzilla's attacks.\n\nRating 4: Apex CEO Walter Simmons recruits Nathan Lind, a former Monarch scientist and Hollow Earth theorist, to guide a search for a power source into the Hollow Earth, the homeworld of the Titans.\n\nRating 7: Lind is initially hesitant as his brother died in an expedition to the Hollow Earth due to a strong reverse-gravitational effect, but he agrees after Walter reveals that Apex has developed HEAVs, specialized crafts able to withstand the pressure exerted by the gravity field.\n\nRating 8: Lind convinces Andrews to let Kong guide them through the Hollow Earth via an outpost in Antarctica.\n\nRating 5: Nathan, Ilene, and an Apex team led by Simmons' daughter Maia board a modified barge escorted by the U.S. Navy that carries a sedated and restrained Kong.\n\nRating 10: Godzilla attacks the convoy and defeats Kong but retreats after the ships disable their power and trick him into thinking they are destroyed.\n\nRating 3: To avoid alerting Godzilla, Kong is airlifted to the Hollow Earth entrance, and Jia convinces him to enter the tunnel while the team follows him in the HEAVs.\n\nRating 8: Madison and Josh find Bernie, who joins their investigation.\n\nRating 10: They sneak into the wrecked Apex base, discover a secret facility underground, and are inadvertently locked into an underground hyperloop-type transport to Apex headquarters in Hong Kong, where they unwittingly stumble on a test of Mechagodzilla.\n\nRating 10: It is telepathically controlled by Ren Serizawa, the son of the late Ishirō Serizawa, through the neural networks from the skull of a severed Ghidorah head, but is hobbled by its power supply's limitations.\n\nRating 8: Walter intends to harness the Hollow Earth's energy to overcome Mechagodzilla's limitations.\n\nRating 3: Inside the Hollow Earth, Kong and the team find an ecosystem similar to Skull Island.\n\nRating 3: They discover his species' ancestral throne room, where they find remains of an ancient war with Godzilla's kind and a glowing axe made from another Godzilla's dorsal plates.\n\nRating 8: As they identify the power source, the Apex team sends its signature back to their Hong Kong base despite Andrews' protests.\n\nRating 10: Attracted by Mechagodzilla's activation, Godzilla arrives in Hong Kong.\n\nRating 10: Sensing Kong and the hollow earth's energy, Godzilla directly drills a shaft to the throne room with his atomic breath.\n\nRating 10: Maia and the Apex team attempt to escape in the ensuing mayhem, but their HEAV is crushed by Kong.\n\nRating 10: Kong, Andrews, Jia, and Lind ascend to Hong Kong, where Kong engages Godzilla in a final battle.\n\nRating 8: Kong initially gains the upper hand; however, Godzilla emerges victorious after incapacitating Kong.\n\nMadison, Josh, and Bernie are caught by security and taken to Simmons.\n\nRating 8: Despite Ren's concerns over the power source's volatility, Simmons orders him to activate Mechagodzilla.\n\nRating 6: Now possessed by Ghidorah's consciousness, Mechagodzilla kills Simmons, electrocutes Ren, engages Godzilla in battle and quickly overwhelms him.\n\nRating 10: Lind revives Kong by destroying the HEAV on his chest, and Jia convinces him to help Godzilla.\n\nRating 10: As Mechagodzilla overpowers both Titans, Josh short-circuits Mechagodzilla's controls with Bernie's flask of liquor on its control panel, momentarily interrupting the mech.\n\nRating 3: Godzilla charges Kong's axe with his atomic breath, allowing Kong to destroy Mechagodzilla.\n\nRating 8: Madison, Bernie, and Josh reunite with Madison's father Mark, while Godzilla and Kong agree to a truce and go their separate ways.\n\nRating 3: Sometime later, Monarch has established an observation post in the Hollow Earth, where Kong now rules."
},{
    "genre": "Action",
    "related-genre": [
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81001887,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81001887",
    "index": 52,
    "name": "6 Underground",
    "maturity": "A ",
    "duration": "2h 8m",
    "synopsis": "After faking his death, a tech billionaire recruits a team of international operatives for a bold and bloody mission to take down a brutal dictator.",
    "year": "2019",
    "spoilers": "\n\nRating 3: Four years after witnessing the horrors of a brutal regime in the fictional Central Asian nation of Turgistan, American billionaire and philanthropist Magnet S. Johnson, who made his fortunes from inventing neodymium magnets, fakes his own death to form an anonymous vigilante squad to take down criminals and terrorists which the world as a whole either cannot or will not pursue.\n\nRating 3: Known as One, he recruits five others to abandon their pasts and join his cause, each given a numbered nickname similar to his own: Two, a spy; Three, a hitman; Four, a parkour runner and thief; Five, a doctor; and Six, a driver.\n\nRating 3: They refer to themselves collectively as ghosts.\n\nRating 6: On their first mission in Florence, Italy, the team interrogates the lawyer of Turgistan's four highest-ranking generals for information on those generals before driving across the city in a dayglow green Alfa Romeo Giulia Quadrifoglio while chased by the Mafia and the Italian police.\n\nRating 9: Six is killed just as they get away.\n\nRating 7: Days later, One recruits Blaine, a former sniper from Delta Force suffering from survivor guilt as he was ordered not to save his team in Afghanistan.\n\nRating 10: He is convinced to fake his suicide and is renamed Seven.\n\nRating 7: One plans to stage a coup d'état to topple the government of Turgistan dictator Rovach Alimov and install Alimov's imprisoned brother, Murat—a staunch supporter of democracy—as the country's new leader.\n\nRating 3: It is revealed that in the past, then–CIA spy Two had reluctantly captured Murat and handed him back to Rovach.\n\nRating 10: The ghosts assassinate Rovach's generals in Las Vegas, learn of Murat's location, and successfully extract Murat from his penthouse imprisonment in Hong Kong.\n\nRating 8: During the extraction, Four is caught by one of Rovach's men, who begins severely beating him.\n\nRating 5: Seven is unwilling to subscribe to One's philosophy that \"the mission always comes first,\" instead following his personal philosophy to never leave a teammate behind.\n\nRating 8: Ignoring One's protests, Seven manages to save Four.\n\nRating 10: Afterward, Seven convinces all but One to reveal their real names.\n\nRating 8: In Turgistan, One sets his plan in motion by hacking the state-run television station during Rovach's public address to the nation and giving Murat the platform he needs to spread his message of democracy.\n\nRating 8: Murat's impromptu speech inspires a citizen revolt, and strategic explosions in the city force Rovach to evacuate to his private yacht.\n\nRating 6: The ghosts storm the yacht and One activates a magnetic pulse invention to incapacitate the guards.\n\nRating 7: When the yacht is immobilized in the middle of the ocean and Four is once again in mortal danger, One chooses to save Four instead of capturing Rovach.\n\nRating 10: Rovach flees by helicopter only to discover it to be commandeered by Murat and the ghosts, who drop him helpless in a refugee camp where he is beaten to death by an angry mob.\n\nRating 3: In the aftermath of the revolution, Murat becomes Turgistan's new president and the ghosts part ways until their next mission is determined.\n\nRating 10: Two and Three begin a relationship.\n\nRating 8: Four and Five go climbing together.\n\nRating 10: One and Seven travel to New York City.\n\nRating 7: Seven tosses his gun into a nearby river, but keeps the last remaining bullet, and One watches from a distance as the woman he loved before his faked death plays with her young son, who is implied to be One's son as well."
},{
    "genre": "Action",
    "related-genre": [
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81199140,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81199140",
    "index": 53,
    "name": "Uncharted",
    "maturity": "U/A 16+ ",
    "duration": "1h 56m",
    "synopsis": "Street-smart treasure hunter Nathan Drake and his renegade mentor Sully set out on a dangerous adventure across the globe to find Magellan's lost gold.",
    "year": "2022",
    "spoilers": "\n\nRating 8: Orphaned brothers Sam and Nathan \"Nate\" Drake are caught trying to steal a map made after the Magellan expedition from a Boston museum.\n\nRating 3: Before the orphanage can expel Sam, he sneaks out to be on his own, but promises Nate that he will return, leaving him a ring belonging to their ancestor Sir Francis Drake .\n\nRating 3: Fifteen years later,  Nate works as a bartender in New York City and pickpockets wealthy patrons.\n\nRating 3: Victor \"Sully\" Sullivan, a fortune hunter who worked with Sam tracking treasure hidden by the Magellan crew, explains to Nate that Sam vanished after helping him steal Juan Sebastian Elcano's diary.\n\nRating 7: Nate, having stopped receiving postcards from Sam, agrees to help Sully find him.\n\nRating 7: Sully and Nate go to an auction to steal a golden cross linked to the Magellan crew, where they meet Santiago Moncada, the last descendant of the Moncada family, who had financed Magellan‘s expedition, and Jo Braddock, leader of Moncada's mercenaries.\n\nRating 3: Nate is ambushed by Braddock's men, and the ensuing fight creates a distraction for Sully to steal the cross.\n\nRating 8: The duo travels to Barcelona, where the treasure is supposedly hidden, and rendezvous with Sully's contact Chloe Frazer, who has another cross.\n\nRating 3: Nate, Chloe, and Sully follow clues in Elcano's diary to Santa Maria del Pi, finding a secret crypt behind the altar.\n\nRating 3: Nate and Chloe enter, finding a trap door, but as they open it, the crypt floods with water.\n\nRating 8: Sully helps them escape after subduing an ambush by Braddock.\n\nRating 3: Using the two crosses to unlock a secret passage, Nate and Chloe find a map indicating the treasure is in the Philippines.\n\nRating 3: Chloe betrays Nate and leaves to take the map to Moncada, hinting Sully is keeping a secret about Sam.\n\nRating 3: Sully recovers Nate and reveals that Sam was shot and apparently killed by Braddock three years prior and that he left him for dead, straining their partnership.\n\nRating 3: Moncada, Chloe, and Braddock's team depart in a cargo plane to find the treasure, where Braddock kills Moncada, gaining control of the operation.\n\nRating 4: After Nate and Sully board the plane, Nate confronts Braddock.\n\nRating 8: A battle ensues; Sully parachutes out with the map, while Nate and Chloe are ejected from the plane landing in the Philippines, where they realize the map does not pinpoint the treasure.\n\nRating 10: Nate discovers the treasure's true location through hints left by Sam's postcards, but leaves fake coordinates for Chloe after correctly doubting her loyalties.\n\nRating 10: Nate discovers the Magellan ships and reunites with Sully.\n\nRating 3: Braddock follows them, forcing Nate and Sully to hide as her crew airlifts the ships.\n\nRating 3: In their escape, Sully commandeers one of the helicopters, and Braddock orders another helicopter to approach for a boarding action.\n\nRating 3: Nate defends himself from her mercenaries and shoots down the other helicopter with one of the ship's cannons.\n\nRating 3: When Braddock corners Nate, Sully throws a bag of collected treasure at her, casting her into the sea, where she is killed when the ship falls on her.\n\nRating 10: As Filipino naval units arrive, Nate and Sully get away with a few pieces of pickpocketed treasure while an arriving Chloe is left empty handed.\n\nRating 8: Meanwhile, an imprisoned Sam, revealed to be alive and having somehow survived being shot by Braddock, writes another postcard to Nate asking him to watch his back.\n\nRating 3: In a mid-credits scene, Nate meets with a man working for Roman, offering his ring for a \"Nazi map\" he has.\n\nRating 9: He tries to betray Nate, but Sully saves him.\n\nRating 3: They escape, but are cornered by an unseen figure."
},{
    "genre": "Action",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Crime Movies",
        "Action & Adventure"
    ],
    "id": 81144150,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81144150",
    "index": 54,
    "name": "Sooryavanshi",
    "maturity": "U/A 16+ ",
    "duration": "2h 23m",
    "synopsis": "A fearless, faithful (and only slightly forgetful) Mumbai cop pulls out all the stops — and stunts — to thwart a major conspiracy to attack his city.",
    "year": "2021",
    "spoilers": "\n\nRating 10: During the 1993 Mumbai blasts, Veer \"Surya\" Sooryavanshi loses his parents where he becomes motivated to become an ATS officer.\n\nRating 9: Years later, Bilal Ahmed, the blasts' mastermind seeks refuge with dreaded terrorist Omar Hafeez at POK, as they begin planning more such attacks.\n\nRating 6: Omar's son Riyaaz has formed a sleeper cell network consisting of 40 terrorists who pose as Indians, aiming to conduct more bombings after the 26/11 attacks.\n\nRating 3: Surya is now the DCP and ATS chief plans an operation in Jaisalmer, where he and his team kidnap Riyaaz who was hiding his identity.\n\nRating 8: Joint CP and Surya's senior officer Kabir Shroff, who was the only person able to fully solve the case, reveals that about a full ton of RDX was brought to India, of which 400 kgs were used during the 1993 bombings and the remnant 600 kgs are still buried somewhere in the country.\n\nRating 8: Surya plans to catch the sleeper cell's remaining members.\n\nRating 10: He also tries to reconcile with his estranged wife Dr. Ria Gupta, with whom he parted ways due to a misunderstanding, but to no avail.\n\nRating 3: Surya comes across Islamic priest Kader Usmani, in fact a terrorist and Bilal's aide.\n\nRating 8: Usmani meets Bilal, whose residence in Sawantwadi houses the wanted 600 kgs of RDX.\n\nRating 8: They remove the buried RDX and prepare for the next bombings.\n\nRating 8: Bilal reaches Mumbai with the help of taxi driver John Mascarenhas who left for Bangkok.\n\nRating 3: Surya catches Bilal, who confesses that he undertook the bombings as an act of vengeance for his family being killed in communal riots and shoots himself to death.\n\nRating 3: Later, John is apprehended in Bangkok post a long chase between him and Surya, who learns that the bombs were being made by another member of the sleeper cell.\n\nRating 8: Usmani and John are arrested; Surya plans to pretend to torture Usmani's daughters to make him confess.\n\nRating 10: Usmani finally reveals that Riyaaz will meet him at his aide Rafique's residence.\n\nRating 8: A suicidal bomb planted there kills Usmani, whose elder daughter helps in identifying the bombmaker Mukhtar Ansari, who is hiding in Shivgarh.\n\nRating 3: Surya sends Inspector Sangram \"Simmba\" Bhalerao to arrest him.\n\nRating 5: Simmba tells Surya that 7 bombs are to be planted at 7 locations in Mumbai.\n\nRating 3: Riyaaz escapes, and it is revealed that the ATS's headquarters would also be bombed.\n\nRating 10: Surya and his team enlist NSG's help to safely extradite the bombs via helicopters and the bombings get botched.\n\nRating 8: However, Riyaaz and his team use Ria as a suicide bomber to attack the ATS headquarters keeping Surya, Simmba and the other cops as hostages.\n\nRating 8: Surya's friend DCP Bajirao Singham arrives and they defuse the bomb wrapped around Ria while killing all the terrorists.\n\nRating 8: They capture Mukhtar, Riyaaz and his younger brother Raza who taunt Singham, Simmba, and Surya that they have been in India as sleeper cells for many years, carrying several attacks in Mumbai, and that the police cannot harm them.\n\nRating 10: An enraged Singham, Simmba, and Surya shoot them to death, thus bringing peace in Mumbai."
},{
    "genre": "Sci-Fi",
    "related-genre": [
        "Sci-Fi Movies",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 70267241,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70267241",
    "index": 55,
    "name": "Pacific Rim",
    "maturity": "U/A 16+ ",
    "duration": "2h 11m",
    "synopsis": "When the world's defenses fail against the threat of alien sea creatures, the task of saving the planet falls to a former pilot and a raw trainee.",
    "year": "2013",
    "spoilers": "\n\nRating 7: In 2013, massive alien monsters called Kaiju begin emerging from an interdimensional portal, \"the Breach\" at the bottom of the Pacific Ocean and attacking coastal cities.\n\nRating 8: In response, humanity builds massive robots called Jaegers, each co-piloted by two or more people who share a mental link by a process called \"Drifting\" to share the mental stress of piloting the machine.\n\nRating 5: In 2020, brothers Yancy and Raleigh Becket pilot the American Jaeger, Gipsy Danger, to defend Anchorage from a Category-3 Kaiju codenamed Knifehead, who severely damages Gipsy, killing Yancy.\n\nRating 8: Raleigh kills Knifehead and pilots Gipsy solo to shore before collapsing.\n\nRating 10: Traumatized by the loss of his brother and the stress of piloting alone, Raleigh quits the Jaeger program.\n\nRating 10: Five years later, world leaders decide to cease funding for the Jaeger program and replace it with coastal defense walls, since Kaiju attack frequency is increasing and Jaegers are being destroyed quicker than they are built.\n\nRating 10: The walls are quickly proven to be ineffective.\n\nRating 4: The remaining Jaegers are relocated to Hong Kong under the command of Marshal Stacker Pentecost, who plans to try to destroy the Breach using a tactical nuclear weapon, despite unsuccessful previous attempts.\n\nRating 5: Raleigh, now working in wall construction, is recruited by Pentecost for the mission.\n\nRating 10: At the Hong Kong base, the Shatterdome, Raleigh is introduced to Mako Mori, the director of the Jaeger restoration program and Pentecost's adoptive daughter.\n\nRating 8: Four Jaegers remain operational – the refurbished Gipsy Danger, the Russian Cherno Alpha, the Chinese Crimson Typhoon, and the Australian Striker Eureka, piloted by father-and-son team, Herc and Chuck Hansen.\n\nRating 4: To find a new co-pilot, Raleigh participates in tryouts, deciding that Mako is \"drift-compatible\".\n\nRating 10: During their first test, Raleigh falls out of alignment after reliving Yancy's death, causing Mako to become lost in the memory of a Kaiju attack on Tokyo, nearly firing Gipsy's energy cannon.\n\nRating 8: As a result, Pentecost grounds Mako.\n\nRating 8: Pentecost consults Kaiju experts Newton Geiszler and Hermann Gottlieb.\n\nRating 10: Hermann claims the Breach will stabilize and the Kaiju will increase in number, but it will allow the assault to succeed.\n\nRating 3: Against Pentecost's recommendation, Newton drifts with a Kaiju's brain to learn more about them, discovering that Kaiju are bioweapons grown by aliens so they can colonize Earth.\n\nRating 7: Pentecost instructs Newton to find black market dealer Hannibal Chau to obtain another Kaiju brain to drift with.\n\nRating 8: Newton realizes the Kaiju hive mind gained access to his brain, since drifting is a two-way link, and the two newest Kaiju to emerge, Leatherback and Otachi, are sent simultaneously to find him in Hong Kong.\n\nRating 3: All Jaegers except Gipsy Danger are dispatched to intervene.\n\nRating 3: The Kaijus destroy Crimson Typhoon and Cherno Alpha, while Leatherback disables Striker Eureka with an EMP blast, also injuring Herc.\n\nRating 3: As the only non-digital Jaeger, the nuclear-powered Gipsy Danger is sent by Pentecost to help.\n\nRating 10: Gipsy manages to defeat Leatherback and Otachi.\n\nRating 10: Newton and Hannibal go to harvest Otachi's secondary brain but discover she is pregnant.\n\nRating 8: The infant Kaiju bursts out and devours Hannibal before choking on its own umbilical cord.\n\nRating 8: Newton and Hermann drift with the infant's brain, discovering that the Breach only opens in the presence of a Kaiju's DNA.\n\nRating 10: Pentecost reveals to Raleigh he is dying of radiation poisoning due to piloting a first-generation Jaeger alone to save a young Mako, and has been unable to pilot a Jaeger since then.\n\nRating 3: When two new Kaiju are detected guarding the Breach, Gipsy and the repaired Striker, piloted by Pentecost and Chuck, begin their assault.\n\nRating 10: Approaching the Breach, the Jaegers are attacked by the Kaiju alongside a new Category-5 Kaiju, Slattern, leading to Striker being crippled.\n\nRating 6: Pentecost and Chuck sacrifice themselves and Striker while Gipsy slaughters Slattern, riding its corpse into the Breach.\n\nRating 6: Raleigh ejects Mako from Gipsy, manually triggers Gipsy's nuclear reactor core's self-destruct, and ejects himself before it explodes and seals the Breach.\n\nRating 10: Raleigh and Mako's escape pods surface in the Pacific Ocean; they embrace as rescue helicopters arrive."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Dramas",
        "Action & Adventure"
    ],
    "id": 81648072,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81648072",
    "index": 56,
    "name": "GodFather",
    "maturity": "U/A 13+ ",
    "duration": "2h 36m",
    "synopsis": "A political leader’s death leads to a power struggle. Amid corruption, greed and deceit, an unlikely opponent steps up.",
    "year": "2022",
    "spoilers": "\n\nRating 8: At Interpol's office in France, an officer is handing over his case about Abraham Qureshi, who is a mysterious smuggler kingpin and godfather to his junior, stating that it was his only unsolvable case.\n\nRating 10: Meanwhile, in Andhra Pradesh, CM Padmakant Reddy alias \"PKR\", the leader of the ruling party Jan Jagruti Party , dies in the hospital while getting treated.\n\nRating 8: Taking advantage of the situation and believing that it would benefit the upcoming election, acting CM Narayana Varma sends party workers to riot outside the hospital.\n\nRating 8: Govardhan, a truth-seeker, records a YouTube live stream and condemns those who praise PKR, claiming that he was a puppet, during his final years in the hands of a financial syndicate, which controls the entire Indian political system.\n\nRating 8: He claims that the JJP party has twice the amount of money than the entire state's treasury, and the person who replaces PKR is crucial.\n\nRating 3: He lists four possible candidates during the live stream: Sathyapriya, Jaidev Das, Varma, and Brahma Teja.\n\nRating 7: Sathya is PKR's daughter married to Jaidev, a notorious and discreet drug dealer, who mainly deals with real estate and Hawala scams.\n\nRating 3: He is also in contact with drug lords in Mumbai, all unknown to Sathya.\n\nRating 10: Varma declares himself as the most likely successor to PKR due to his seniority in the party and particularly for his lobbying skills.\n\nRating 3: Brahma, meanwhile, is PKR's first child but was kept a secret from the world, as PKR did not want the public to know that he had a son with his first wife.\n\nRating 3: Govardhan describes him as the \"most dangerous\" person from the list and addresses him as Godfather.\n\nRating 3: Brahma's past is unknown but is now known for his contract work for corporations in Chennai, all known from Govardhan's research.\n\nRating 3: Meanwhile, in Mumbai, Jaidev and Varma meet the former's partner, Abdul, and tell him that PKR had given him an ultimatum, a month ago, to stop his immoral activities.\n\nRating 8: With PKR's demise, Jaidev plans to fund the JJP with drug money, by offering money to the present financier.\n\nRating 8: With the help of Abdul, Jaidev cuts a deal with Lukas, who agrees to transfer ₹750 crore , every month, in exchange for importing unchecked drug contraband into Hyderabad, once the JJP wins the election.\n\nRating 10: For the deal to proceed, Jaidev has to first set up a discreet drug factory.\n\nRating 10: Abdul insists that the factory should be on a government-sealed roadside.\n\nRating 8: At the same time, PKR's last rites are carried out in Hyderabad, where Sathya asks Varma to forbid Brahma from taking part in the ceremony.\n\nRating 10: On Varma's orders, Indrajeet attempts to hinder his way but fails.\n\nRating 8: That same night, Jaidev arrives home, where he gives some malana cream to Sathya's sister Jhanvi and convenes a meeting with the JJP ministers, informing his decision to fund the party and dissolve the current ministry, which will ensure the preponement of the elections.\n\nRating 10: This will allow them to take advantage on the present sympathy wave and nominate himself as the party's next CM candidate.\n\nRating 9: Since the present financier is Brahma himself, Varma advises Jaidev to negotiate with Brahma, but Brahma objects to funding the party with drug money and threatens Jaidev.\n\nRating 10: Enraged, Jaidev assigns Varma to bribe 140 MLAs from the party to nominate him as the CM's candidate.\n\nRating 3: Jaidev sends men to set up the drug factory.\n\nRating 10: Upon knowing this, Brahma goes to the factory and kills all of them.\n\nRating 10: Brahma's aide and Jaidev's mole, Koti, witnesses this and reports it to the both of them.\n\nRating 10: Indrajeet is sent to detect evidence from the factory but finds nothing.\n\nRating 3: From Sathya's diary, Jaidev finds out that she resents Brahma because her father gave more care for him, who was brought to their home as a child, and was the cause of a rift between her parents.\n\nRating 3: Koti persuades his lover Renuka to slander Brahma.\n\nRating 8: On public news, she accuses Brahma of abusing her.\n\nRating 7: This creates public outrage against Brahma, who is arrested and imprisoned.\n\nRating 8: In prison, Brahma gets a phone call from his next contractor and Masoom Bhai, his most trusted aide.\n\nRating 10: Jaidev arranges a hit on Brahma, by sending goons into the prison, but the attempt fails.\n\nRating 10: While transferring the money to bribe the other party members in the JJP, Lukas's containers are sabotaged by Masoom Bhai.\n\nRating 10: Brahma meets Govardhan, where he provides pieces of evidence of the party workers' corruption to Govardhan and also reveals the reasons for him indulging in drug trade, in Chennai.\n\nRating 7: Meanwhile, Koti, who realizes his mistake, along with Renuka, admit that they lied about Brahma, on national news.\n\nRating 4: Brahma is later released from prison.\n\nRating 8: Meanwhile, Jhanvi is hospitalized after a drug overdose.\n\nRating 3: From Jhanvi, Sathya learns of Jaidev's predatory behavior towards her.\n\nRating 6: When confronted by Sathya, Jaidev admits everything and threatens to expose Jhanvi's contacts with drug peddlers.\n\nRating 8: He also threatens to kill her and Jhanvi, like PKR.\n\nRating 3: A changed Sathya, with no other choice, seeks the help of Brahma.\n\nRating 10: Brahma, who reveals his origin to Sathya, vows to protect them.\n\nRating 10: Sathya breaks down after coming to know the true face of her brother's.\n\nRating 8: Indrajeet blackmails Sathya in exchange for not filing a case against Jhanvi.\n\nRating 3: Brahma kills Indrajeet, with his men, following which, Brahma meets the owners of the NNTV news channel.\n\nRating 10: Brahma clears the channel's debts of ₹45 crore  and gives total control and autonomy of the channel to Sathya.\n\nRating 8: Brahma and Masoom Bhai also blackmail Varma and the other MLAs to ally with him in exchange for their drug habits not getting into the hands of the media.\n\nRating 8: Jaidev kidnaps Jhanvi and blackmails Sathya, from Mumbai, to announce him as the next CM.\n\nRating 8: With the help of Masoom Bhai, Brahma kills Jaidev's associates.\n\nRating 8: They confront Jaidev, where upon seeing Brahma, Lukas reveals that Brahma is in fact, Abram Qureshi aka \"Godfather\".\n\nRating 3: Though taken aback, Jaidev attempts to have Sathya killed in a car accident, but Brahma's men save her.\n\nRating 10: Defeated, Jaidev kills himself.\n\nRating 7: Sathya is elected as the new president of JJP party and CM, while Brahma heads to Paris with Masoom Bhai.\n\nRating 8: After gathering all the major drug lords in the world, Brahma and Masoom Bhai kill all of them."
},{
    "genre": "Action",
    "related-genre": [
        "Action & Adventure"
    ],
    "id": 81245455,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81245455",
    "index": 57,
    "name": "Troll",
    "maturity": "U/A 13+ ",
    "duration": "1h 43m",
    "synopsis": "When an explosion in the Norwegian mountains awakens an ancient troll, officials appoint a fearless paleontologist to stop it from wreaking deadly havoc.",
    "year": "2022",
    "spoilers": "\n\nRating 10: As a young girl, Nora Tidemann’s father, Tobias, teaches her the mythology of Trolls and the origin of their local mountains.\n\nRating 8: During one story, Nora almost “sees” the faces of trolls turned to stone in the rock face.\n\nRating 10: Years later, a drilling operation tunneling through the mountains of Dovre results in an eruption and the deaths of several workers and protestors.\n\nRating 10: Desperate for answers, the Norwegian government recruits a diverse array of scientists, including Nora, who is now a paleontologist on her first major find.\n\nRating 3: While the collected scientists initially believe that the eruption was caused by the miners hitting a pocket of Methane, only Nora and the prime minister’s advisor, Andreas Isaksan, point out that the region is surrounded by large impressions that appear to be footprints.\n\nRating 8: The prime minister permits them to investigate the possibility further with Norwegian military soldier, Captain Kris Holm, when a second incident miles away tears apart the home of an elderly couple near Lesja.\n\nRating 10: Nora begins to believe that a Troll may be responsible and the three seek assistance from Tobias, who has since lost his professorship for his belief in the existence of a real basis for mythical creatures.\n\nRating 8: After a quick search of the mountains, Tobias identifies a topographical anomaly and the four accidentally awaken the slumbering 45 m  Troll, having camouflaged itself on the mountainside.\n\nRating 10: They escape, capturing the first tangible video proof of Nora’s theory.\n\nRating 10: The prime minister arranges a military operation led by Kris; however, conventional weapons only annoy the troll.\n\nRating 10: Tobias tries communicating with the troll but is killed when the creature is startled by more gunfire.\n\nRating 3: Researching the mythology, Nora recommends a sonic attack using church bells, but it enrages instead of incapacitates the creature, causing immense collateral damage.\n\nRating 9: Following the rampage, international news outlets pick up the story and broadcast it globally.\n\nRating 8: As the troll heads to Norway's capital Oslo, the prime minister orders a complete evacuation of the city.\n\nRating 10: After learning of the government's plan to destroy the troll with a nuclear bomb on Oslo, Nora and Andreas object, but are dismissed from the task force.\n\nRating 3: Nora makes a last attempt to find out the truth about the creature.\n\nRating 10: Tobias' notes lead them to the Royal Palace, where they meet Chief of Court Rikard Sinding, who reveals the truth about trolls in Norway.\n\nRating 5: Tobias had been right all along; Trolls had been living in Norway until they were wiped out by Christian settlers and the truth buried in folklore.\n\nRating 10: When Nora's father got too close to the truth, Sinding had him discredited and committed to a mental health hospital.\n\nRating 9: The Royal palace was built on top of the Troll King's palace after the Christians massacred his family and left him for dead inside a cavern in the Dovre mountains.\n\nRating 8: Nora concludes that the creature is heading for Oslo in an attempt to return home.\n\nRating 3: Discovering that trolls are vulnerable to direct sunlight, Nora and Kris plan to expose the troll to UV light from a number of tanning beds.\n\nRating 8: While Kris calls on fellow soldiers to make the troll trap, Andreas asks his friend Sigrid at the secret government facility to delay the bombing of Oslo.\n\nRating 10: Sigrid hacks into the military's system to halt the nuclear strike.\n\nRating 8: Nora and Andreas place the skull of one of the troll's babies in the back of the Queen's truck and lure him to the UV light trap.\n\nRating 3: Nora has a last-minute change of heart, turns off the lights, and tries to save the creature's life.\n\nRating 3: However, the sun then rises into a clear sky and kills the troll.\n\nRating 8: While everyone else rejoices, Andreas and Nora wonder if more trolls are still alive deep inside Norway's mountains.\n\nRating 10: In the aftermath, something seems to emerge with a roar from the rubble inside the Dovre mountain cave."
},{
    "genre": "Action",
    "related-genre": [
        "Action & Adventure"
    ],
    "id": 81551307,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81551307",
    "index": 58,
    "name": "Waltair Veerayya",
    "maturity": "A ",
    "duration": "2h 37m",
    "synopsis": "Desperate to nab a wanted criminal on the run, a cop turns to the formidable Waltair Veerayya, a fisherman with a notorious streak, for help.",
    "year": "2023",
    "spoilers": "\n\nRating 10: Waltair Veerayya, a notorious fisherman-cum-smuggler from Vizag, needs money to fight a court case.\n\nRating 8: He is approached by CI Seethapathi, who tells him about Solomon Caesar, a notorious drug lord who escaped from RAW's custody after killing multiple police officers.\n\nRating 10: Seethapathi, who was responsible for Caesor's custody, gets suspended from service.\n\nRating 7: He asks Veerayya to extradite Caesar from Malaysia to India, in exchange for providing money.\n\nRating 10: Veerayya accepts the deal and travels to Malaysia with his friends and Seethapathi's brother-in-law.\n\nRating 3: They check in at a hotel owned by Caesar and devise a plot to kidnap him.\n\nRating 10: However, Veerayya misses the opportunity as he gets stunned by seeing Dr Nithya and her daughter, Vaishnavi, where Nithya angrily takes the kid away from Veerayya.\n\nRating 8: Seethapathi's brother-in-law gets impatient and prompts Seethapathi to follow Caesar on their own without Veerayya's knowledge, only to get caught by Caesar.\n\nRating 10: Veerayya arrives at the place and tricks Caesar into believing that they want to cut a drug deal with him, therefore saving the day.\n\nRating 3: Later, Veerayya gets invited by Caesar to his private party where a group of masked assassins attempt to nab Caesar, but their plans are foiled by Veerayya, who later realises that they are the hotel staff.\n\nRating 8: They reveal themselves as RAW agents, led by Athidhi.\n\nRating 6: Caesar expresses his admiration for Veerayya and offers to ask him anything in return for saving his life.\n\nRating 8: Veerayya asks him to come back to India and Caesar agrees, but soon finds out about their ploy and they get busted.\n\nRating 3: As Caesar assaults Athithi for information with his elder brother Michael Solomon on video conference, Veerayya retaliates and reveals that Michael was his ultimate target.\n\nRating 3: Veerayya kills Caeser at the public fair in the Batu Caves, where a helpless Michael witnesses everything.\n\nRating 3: Past: Four years ago, Michael, in disguise as a fisherman named Kaala, acts as Veerayya's friend and confidant.\n\nRating 10: Without Veerayya's knowledge, Michael supplies drugs from the former's ice factory.\n\nRating 6: The newly appointed ACP Vikram Sagar, who is also Veerayya's half-brother, arrives in Vizag and begins a crackdown on the drug syndicate.\n\nRating 5: During their childhood, Veerayya, who suffered from vertigo, accidentally let Sagar fall from a tree.\n\nRating 10: Ever since, the brothers grew up separately.\n\nRating 10: Though Sagar developed hatred towards Veerayya, Veerayya always loved him.\n\nRating 10: Sagar is also happily married to Dr. Nithya and they bear a daughter Vaishnavi.\n\nRating 8: Sagar tracks down the origin of drugs in Veerayya's locality, but Michael manages to keep his cover.\n\nRating 10: One day, the ice factory accidentally supplies cocaine, wrapped in ice to a school, which resulted in the deaths of 25 children.\n\nRating 8: Michael subsequently frames Veerayya and plans to escape to Malaysia.\n\nRating 7: Veerayya gets arrested by the police, who decides to kill him in an encounter to calm the public rage.\n\nRating 3: Sagar, who believes that Veerayya is innocent, loots the seized drugs to lure Michael.\n\nRating 3: He secretly arrives at the planned encounter shooting, in place of Veerayya to nab Michael.\n\nRating 8: However, the JCP, who is also Sagar's senior officer, is in cahoots with Michael, where he fatally stabs him, along with Michael's men.\n\nRating 10: Michael manages to escape as Veerayya arrives, not before he shows his true face to him.\n\nRating 7: Veerayya tries to take a heavily injured Sagar to the hospital, but he succumbed to his injuries on the way, revealing that he always had affection for him, but could not express it publicly due to his crackdown on the drug syndicate.\n\nRating 8: Veerayya is stopped by the police and taken away.\n\nRating 10: Sagar is deprived of state honours and labelled as a traitor by the police.\n\nRating 8: Heartbroken, Veerayya decides on extraditing Michael to India for his testimony in court, before Seethapati shows him the way.\n\nRating 8: Present: Veerayya sets up Michael against his drug partner by blowing up his base of operations.\n\nRating 5: The rival gang attempts to kill Michael, where he agrees to come to India with Veerayya and testify in court, in exchange for his life.\n\nRating 10: With the help of Athithi, Veerayya brings Michael back to India.\n\nRating 10: Following Michael's testimony, the court recognises Sagar's valour and grants him state honours, whilst also acquitting Veerayya of his charges.\n\nRating 10: To fulfil Sagar's last wish of avenging the children's deaths, Veerayya severs Michael's head in the courtroom and is sentenced to prison."
},{
    "genre": "Action",
    "related-genre": [
        "Family Features",
        "Sci-Fi Movies",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81465707,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81465707",
    "index": 59,
    "name": "Spider-Man: No Way Home",
    "maturity": "U/A 13+ ",
    "duration": "2h 28m",
    "synopsis": "When his loved ones are put at risk, Peter Parker asks Doctor Strange to restore his secret — and accidentally sets off a disaster of epic proportions.",
    "year": "2021",
    "spoilers": "\n\nRating 3: After Quentin Beck frames Peter Parker for his murder and reveals Parker's identity as Spider-Man, Parker, his girlfriend Michelle \"MJ\" Jones-Watson, best friend Ned Leeds, and aunt May are interrogated by the Department of Damage Control.\n\nRating 9: Lawyer Matt Murdock gets Parker's charges dropped, but the group grapples with negative publicity.\n\nRating 7: After Parker, MJ, and Ned's MIT applications are rejected, Parker goes to the New York Sanctum to ask Stephen Strange for help.\n\nRating 10: Strange starts casting a spell that would make everyone forget Parker is Spider-Man, but it is corrupted when Parker repeatedly requests alterations to let his loved ones retain their memories, ultimately causing Strange to contain the spell to stop it.\n\nRating 10: At Strange's suggestion, Parker tries to convince an MIT administrator to reconsider the applications of MJ and Ned, but is attacked by Otto Octavius.\n\nRating 3: Octavius rips nanotechnology from Parker's Iron Spider suit, which bonds with his mechanical tentacles\n\nRating 10: and allows Parker to control them.\n\nRating 8: As Norman Osborn arrives and attacks, Strange teleports Parker back to the Sanctum and locks Octavius in a cell next to Curt Connors.\n\nRating 4: Strange explains that the corrupted spell summoned people from other universes within the multiverse who know Spider-Man's identity.\n\nRating 9: He orders Parker, MJ, and Ned to find and capture them; they locate and retrieve Max Dillon and Flint Marko at a military research facility.\n\nRating 10: Osborn reclaims control of himself from his split Green Goblin personality and destroys the Goblin mask.\n\nRating 3: He goes to a F.E.A.S.T. building, where May comforts him before Parker retrieves him.\n\nRating 7: While discussing their battles with Spider-Man, Osborn, Octavius, and Dillon realize they were pulled from their universes just before their deaths.\n\nRating 10: Strange prepares to reverse the contained spell and send the villains back to their respective universes, but Parker argues that they should first cure the villains of the insanity that would lead to their deaths, to possibly change their fates upon their return.\n\nRating 8: When Strange refuses, Parker steals the spell, traps Strange in the Mirror Dimension, and, with May, takes the villains to Happy Hogan's apartment, where he uses Stark Industries technology to cure Octavius.\n\nRating 10: Before Parker can cure anyone else, his spider-sense goes off.\n\nRating 8: He then realizes that the Goblin persona has retaken control of Osborn, who convinces the uncured villains to betray Parker.\n\nRating 8: As Dillon, Marko, and Connors escape, the Goblin fatally injures May.\n\nRating 10: Before she dies, May tells Parker that \"with great power, there must also come great responsibility\".\n\nRating 3: Ned discovers that he can create portals using Strange's sling ring, which he and MJ use to try to locate Parker.\n\nRating 9: They instead find alternate versions of Parker from the villains' universes who were also summoned by Strange's spell and who are nicknamed \"Peter-Two\" and \"Peter-Three\".\n\nRating 3: The group finds this universe's Parker, nicknamed \"Peter-One\", who is ready to give up and send the villains home to die.\n\nRating 10: The alternate Parkers share stories of losing loved ones and encourage Peter-One to fight in May's honor, and the three Parkers develop cures for the villains.\n\nRating 10: The group lure Dillon, Marko, and Connors to the Statue of Liberty.\n\nRating 8: Peter-One and Peter-Two cure Connors and Marko, while Octavius arrives to help cure Dillon, and Ned frees Strange from the Mirror Dimension.\n\nRating 10: The Goblin appears and unleashes the contained spell, which breaks apart the barriers between universes, pulling in countless others who know Parker's identity.\n\nRating 8: Strange attempts to hold them off while an enraged Peter-One tries to kill the Goblin.\n\nRating 8: Peter-Two stops him, but gets stabbed by the Goblin.\n\nRating 10: Peter-Three helps Peter-One inject the Goblin with his cure, restoring Osborn's sanity.\n\nRating 10: Peter-One realizes that the only way to protect the multiverse is to erase himself from everyone's memory and requests Strange to do so, while promising MJ and Ned that he will find them again.\n\nRating 8: Strange reluctantly casts the spell, and everyone returns to their respective universes—including Eddie Brock, who unknowingly leaves behind a piece of the Venom symbiote.\n\nRating 10: Two weeks later, Parker visits MJ to reintroduce himself, but he decides against it.\n\nRating 10: While mourning at May's grave, he has a conversation with Hogan and is inspired to carry on, making a new suit and resuming his vigilantism."
},{
    "genre": "Action",
    "related-genre": [
        "Comedies",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81002747,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81002747",
    "index": 60,
    "name": "Spider-Man: Into the Spider-Verse",
    "maturity": "U/A 13+ ",
    "duration": "1h 56m",
    "synopsis": "After being bitten by a radioactive spider, Brooklyn teen Miles Morales gets a crash course in web-slinging from his alternate-dimension counterparts.",
    "year": "2018",
    "spoilers": "\n\nRating 7: New York City teenager Miles Morales struggles to live up to the expectations of his father, police officer Jefferson Davis, who sees Spider-Man as a menace.\n\nRating 8: Miles adjusts to prep school, and visits his uncle Aaron Davis, who takes him to an abandoned subway station to paint graffiti.\n\nRating 10: Miles is bitten by a radioactive spider and gains spider-like abilities similar to Spider-Man.\n\nRating 3: Returning to the station, Miles discovers a collider built by Wilson Fisk, who hopes to access parallel universes to bring back his late wife and son, whose deaths he blames on Spider-Man.\n\nRating 8: Miles watches as Spider-Man attempts to disable the collider while fighting Wilson's henchmen, Green Goblin and the Prowler.\n\nRating 7: Spider-Man saves Miles, but Green Goblin shoves Spider-Man into the collider, causing an explosion that kills Goblin and severely wounds Spider-Man.\n\nRating 8: Spider-Man gives Miles a USB flash drive designed to disable the collider, warning that the machine could destroy the city if reactivated.\n\nRating 3: After watching in horror as Wilson kills Spider-Man, Miles flees with Prowler in pursuit, eventually getting away from him.\n\nRating 3: As the city mourns Spider-Man's death, Miles tries to honor his legacy and become the new Spider-Man.\n\nRating 10: While trying out his newfound abilities, he inadvertently damages the drive.\n\nRating 3: At Spider-Man's grave, Miles meets Peter B. Parker, an older and worn-down version of Spider-Man from another dimension.\n\nRating 8: Upon meeting him, Miles discovers his ability to emit bio-electric bursts called \"venom-blasts\".\n\nRating 7: Peter reluctantly agrees to train Miles in exchange for help stealing data to create a new drive.\n\nRating 5: They infiltrate Wilson's research facility, and Miles discovers he has the power to turn invisible.\n\nRating 3: They are confronted by mad scientist Olivia Octavius, who discovers that Peter will die from cellular decay if he remains in their dimension.\n\nRating 10: Chased through the laboratory and surrounding forest by Octavius, Miles and Peter are saved by Gwen Stacy, a Spider-Woman from another dimension.\n\nRating 3: They then visit the deceased Spider-Man's aunt, May Parker, who is sheltering more Spider-people from other dimensions—Spider-Man Noir, Peni Parker, and Spider-Ham—who are also deteriorating.\n\nRating 10: Miles offers to disable the collider so the others can return home, but after questioning and testing him, they tell him that he lacks experience.\n\nRating 8: Distraught, Miles retreats to Aaron's home, where he discovers Aaron is the Prowler.\n\nRating 8: Miles returns to May's house, where Peni has completed the new drive; he is followed by Wilson, Prowler, Octavius, Scorpion, and Tombstone.\n\nRating 3: In the ensuing brawl, Miles reveals his identity to Aaron just as Aaron corners him.\n\nRating 8: Unwilling to kill his own nephew, Aaron spares Miles, but is fatally shot by Wilson.\n\nRating 3: Miles flees with Aaron, who tells him to keep going before dying.\n\nRating 3: Jefferson arrives on the scene and Miles escapes, leading Jefferson to mistake Spider-Man as Aaron's murderer.\n\nRating 4: The heroes regroup with a distraught Miles at his dorm room.\n\nRating 8: Peter restrains Miles to ensure his safety and leaves with the others, choosing to sacrifice himself by staying behind and deactivating the collider.\n\nRating 10: Jefferson arrives outside Miles' door and, assuming Miles does not want to speak to him, apologizes for his mistakes and inspires Miles.\n\nRating 10: Miles then manages to control his powers, escapes his restraints, and creates his own Spider-Man suit with May's help.\n\nRating 10: He joins the heroes, defeating Wilson's enforcers and using the new drive to send them home.\n\nRating 8: Wilson fights Miles, attracting the attention of Jefferson, who realizes that Spider-Man isn't the menace he saw him as.\n\nRating 3: Jefferson encourages Miles, who subdues Wilson with his venom-blast and throws him at the kill switch, destroying the collider.\n\nRating 9: Wilson and his henchmen are arrested for their crimes and Jefferson recognizes the new Spider-Man as a hero while receiving evidence of Wilson's murders of Peter and Aaron.\n\nRating 10: Miles embraces the responsibilities of his new life, while the heroes return to their lives in their own dimensions.\n\nRating 6: Later, Gwen finds a way to contact Miles from her own dimension.\n\nRating 3: In another dimension, Miguel O'Hara travels to the universe of the 1967 Spider-Man animated series and argues with its Spider-Man over who points first."
},{
    "genre": "Action",
    "related-genre": [
        "Dramas",
        "Action & Adventure"
    ],
    "id": 81476453,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81476453",
    "index": 61,
    "name": "RRR",
    "maturity": "A ",
    "duration": "3h 5m",
    "synopsis": "A fearless warrior on a perilous mission comes face to face with a steely cop serving British forces in this epic saga set in pre-independent India.",
    "year": "2022",
    "spoilers": "\n\nRating 3: In 1920, during the British Raj, Governor Scott Buxton and his wife Catherine visit a forest in Adilabad and there abduct Malli, a young girl with a talent for artistry, from the Gond tribe.\n\nRating 3: Enraged by this, the tribe's guardian Komaram Bheem embarks for Delhi to rescue her, disguising himself as a Muslim man named Akhtar.\n\nRating 6: Elsewhere, the Nizamate of Hyderabad, sympathetic to the Raj, warns Scott's office of the impending danger.\n\nRating 3: Undeterred, Catherine enlists A. Rama Raju, an ambitious officer in the Indian Imperial Police, to quell the threat.\n\nRating 3: Seeking clues to Malli's whereabouts, Raju and his uncle, Venkateswarulu, attend several pro-independence gatherings where he feigns to support independence.\n\nRating 9: Months later, Lachhu, Bheem's gullible aide, is taken in by Raju's ruse and attempts to recruit him into Bheem's plot, but then discovers his true identity and flees.\n\nRating 3: A short while later, Bheem and Raju encounter one other, unaware of their opposing allegiances.\n\nRating 10: In the course of working in concert to save a boy from a train wreck, they form a friendship and over time grow close.\n\nRating 3: Raju then assists Bheem in courting Jenny, Scott's niece, unaware that Bheem plans to infiltrate Scott's residence.\n\nRating 10: When Jenny takes Bheem to her residence, Bheem locates the room where Malli is being held captive; he meets Malli and promises he will free her.\n\nRating 8: Meanwhile, Raju deduces Lachhu's true identity and apprehends him.\n\nRating 7: While being interrogated, Lachhu goads a banded krait into attacking Raju, then warns him of his imminent fate and that the antidote is only known to the Gonds.\n\nRating 3: Dazed, Raju approaches Bheem, who immediately tends to him.\n\nRating 3: Noticing similar religious features between Lachhu and Bheem, Raju deduces his true intentions.\n\nRating 8: Nevertheless, Bheem divulges his tribal identity and his mission, still unaware of Raju's true identity.\n\nRating 3: At an event held in Scott's honor, Bheem's men barge into his residence with a lorry filled with wild animals, which creates havoc among the assembled guests.\n\nRating 5: The animals maul Scott's guards, allowing Bheem to briefly fight; however, Raju arrives and tells him Scott intends to kill Malli; he surrenders out of obligation.\n\nRating 7: In the aftermath of the incident, Raju is promoted for thwarting Bheem, yet he is absorbed with guilt over his own actions, recalling his own pro-nationalistic background and his actual alter-ego as a mole within the police; he was seeking a promotion in order to gain access to shipments of guns to smuggle to his village.\n\nRating 10: At Bheem's public flogging, Raju attempts to persuade him to recant his actions; Bheem chooses to be flogged instead.\n\nRating 8: Bheem sings in defiance of his injuries, which incites the assembled crowd into rebellion.\n\nRating 10: The riot further enlightens Raju, who finally realizes the recklessness of his actions.\n\nRating 8: Determined to save his friend, he persuades Scott to execute Bheem in secret while preparing an ambush to rescue him.\n\nRating 10: Scott figures out this scheme.\n\nRating 10: While managing to rescue Malli from Scott's men, Raju is grievously injured.\n\nRating 10: Bheem, who had also managed to free himself, mistakenly interprets Raju's actions as an attempt to kill Malli; he bludgeons him and escapes with her.\n\nRating 8: Months later, Bheem, who is hiding out with his group and Malli in Hathras, is cornered by the colonial authorities.\n\nRating 8: He narrowly avoids being exposed when Sita, Raju's fiancée, repels them by claiming a smallpox epidemic as a pretext.\n\nRating 3: Unaware of Bheem's identity, she reveals Raju's actual, anti-colonial objectives and of his impending execution.\n\nRating 8: Crestfallen upon realizing his own folly, Bheem vows to save him.\n\nRating 10: With the assistance of a sympathetic Jenny, Bheem infiltrates the barracks where Raju is detained and frees him, defeating the many soldiers he aroused in the process.\n\nRating 8: The pair retreat to a nearby forest, where they decimate more soldiers with the use of a longbow taken from a Rama shrine.\n\nRating 8: Taking the fight to Scott, they hurl a flaming motorcycle into the barracks' magazines, setting it afire.\n\nRating 8: The subsequent explosion kills many within Scott's company, including Catherine.\n\nRating 8: Having finally cornered a wounded Scott, Raju has Bheem execute him with a British rifle, fulfilling their respective objectives.\n\nRating 10: They steal a cache of Scott's weaponry and reunite with Sita and Jenny.\n\nRating 10: To mark the completion of their missions, Raju asks Bheem to make a wish he can grant; Bheem asks Raju to provide education for him and his community."
},{
    "genre": "Action",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Crime Movies",
        "Action & Adventure"
    ],
    "id": 70224999,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70224999",
    "index": 62,
    "name": "Don 2",
    "maturity": "U/A 13+ ",
    "duration": "2h 27m",
    "synopsis": "With Asia under his complete control, criminal mastermind Don turns to Europe, battling the mob bosses of each nation along the way.",
    "year": "2011",
    "spoilers": "\n\nRating 3: Five years after the events of Don, the European drug cartel bosses meet in the French Riviera on a yacht to discuss a new threat emerging from Asia: Don is jeopardizing their business by undercutting their prices and they decree that he must die.\n\nRating 8: Living in Thailand for the last five years, Don goes to a remote settlement to pick up a shipment of cocaine.\n\nRating 8: He gets cornered by his own allies who reveal to him that once he is killed, the cocaine from Asia will be open for sale in Europe and they will usurp all the profits.\n\nRating 8: Don makes his way out by killing all his allies and destroying the entire settlement.\n\nRating 3: Later, Don returns to Malaysia, surrendering to Roma, who has joined Interpol, and Inspector Malik.\n\nRating 3: He is sentenced to death and sent to prison, where he meets old rival Vardhaan.\n\nRating 3: Initially, Vardhaan tries to exact revenge on Don for having him imprisoned five years back, he patches up with Don when the latter offers him an opportunity to escape with him.\n\nRating 10: Don and Vardhaan eventually break out by poisoning the other inmates.\n\nRating 3: In Zurich, Don meets trusted companion Ayesha, and they retrieve a tape from a secret locker whose key was under Vardhaan's possession.\n\nRating 3: It shows J.K. Diwan, vice-president of the Euro-printing DZB  bribing Singhania to kill James Werden, the original choice for the President of the DZB so that Diwan's superior, Fabian Kohl would become the new president.\n\nRating 8: Singhania was killed by Vardhaan five years earlier.\n\nRating 8: Don blackmails Diwan into giving him the bank's blueprints so he can steal the printing plates.\n\nRating 8: Diwan gives him fake blueprints and hires Abdul Jabbar, a deadly assassin.\n\nRating 3: However, Don escapes, and with no other choice, Diwan gives him the original blueprints.\n\nRating 8: Roma and Malik arrive in Berlin and unsuccessfully interrogate Diwan, after having found evidence of him being involved with Don in some illegal activity, while Don and his team execute a bank robbery.\n\nRating 3: After stealing the printing plates, Don is betrayed by Vardhaan and Jabbar but escapes.\n\nRating 8: Another team member, Sameer, calls the police on Don and he is arrested.\n\nRating 8: Don blackmails Diwan into giving him German immunity in exchange for erasing the evidence of him being involved in the murder of James Warden.\n\nRating 3: He then negotiates with the German police and Interpol over surrendering the plates and a disc containing details of the European underworld in exchange for the safety of the hostages and defusing the bombs in the bank.\n\nRating 3: Don and Roma reach Vardhan after bloody combat with his thugs and find themselves in a standoff.\n\nRating 8: Though ordered by Vardhaan and Jabbar - and even Don himself - Roma is unable to kill Don and is shot by Jabbar in response; she still has feelings for him, even though he killed her brother and his fiancée five years earlier, and also does not want to do it illegally.\n\nRating 3: Don manages to subdue Vardhaan and kills Jabbar.\n\nRating 8: He obtains his immunity papers and surrenders the plates and the disc, as per the bargain.\n\nRating 9: Don brings Roma to an ambulance and they exchange glances before the doors close.\n\nRating 8: When the police later investigates the evidence, they are shocked to discover Diwan and Kohl were behind Werden's murder.\n\nRating 10: Don later detonates a bomb planted earlier in Diwan's car, killing Diwan and seemingly destroying the plates which he had taken.\n\nRating 8: In a final scene, it is revealed Don still has the currency plates, the ones which the police believe was destroyed in the explosion were fake.\n\nRating 3: Sameer was actually loyal to Don; informing the police was part of the plan.\n\nRating 10: The disc Don turned over actually contains the names of the European drug cartel.\n\nRating 8: Having been exposed, Kohl is shortly arrested too, and the DZB is forced to replace him.\n\nRating 3: After they are arrested, Don becomes king of the European underworld and tells Ayesha and Sameer they have no idea how rich they will become."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Action & Adventure"
    ],
    "id": 81644302,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81644302",
    "index": 63,
    "name": "Thunivu",
    "maturity": "U/A 16+ ",
    "duration": "2h 22m",
    "synopsis": "A major bank heist takes an unnerving turn when a mysterious interloper known only as Dark Devil begins to hijack the operation.",
    "year": "2023",
    "spoilers": "\n\nRating 8: Radha, a dreaded gangster, and his men plan a heist at \"Your Bank\", one of the biggest privately-owned bank in Chennai, with the support of ACP Ramachandran.\n\nRating 8: They plan to rob ₹500 crore on 21 May, coinciding with the Governor's party event at his residence.\n\nRating 10: On the day of the heist, Radha and his men hijack the bank, only to discover that the bank is already hijacked by a mysterious man nicknamed Michael Jackson and his accomplice, Kanmani.\n\nRating 10: The commandos arrive inside the bank, but get defeated.\n\nRating 6: Jackson later makes a deal with Radha to help him rob ₹5000 crores, in exchange for a share of the money, for which Radha and his men reluctantly agree.\n\nRating 10: When Radha finds that the bank locker contains only ₹1,510 crores, they decide to kill Jackson, only to be defeated.\n\nRating 8: Jackson insists that Antony alias Anto, a police constable to be the negotiator, much to Ramachandran's ire.\n\nRating 8: He uses a voice changer of Michael Jackson, tricking the people and the media into referring him as Michael Jackson.\n\nRating 10: Ramachandran tries to kill Jackson with a sniper, only for him to make an explosion in a car parked nearby the bank using a bomb.\n\nRating 3: With the events being leaked to the media, city commissioner Dayalan is called in to handle the situation.\n\nRating 8: While inspecting the bank, Jackson finds explosives, disguised as fire extinguishers, and deduces that a third team has also entered the bank, without him knowing.\n\nRating 7: The police tracks a van where Kanmani is guiding Jackson, but Kanmani destroys the van, and escapes.\n\nRating 3: Ramachandran sends his men to trace Kanmani, but she kills them and exposes Ramachandran's involvement in the heist to Dayalan, who interrogates him, and he confesses that he along with his childhood friend Shyam, the Tamil Nadu Branch Head of Your Bank, planned the heist.\n\nRating 8: Ramachandran tried hiring Jackson, who goes by the name \"Dark Devil\", for the job, but he refused.\n\nRating 8: Ramachandran later hired Radha's gang for the job, without revealing that they will be killed after the heist.\n\nRating 3: Radha and his gang join and assist Dark Devil after hearing Ramachandran's confession through bugs planted on Dayalan's base.\n\nRating 3: Shyam flees from police after they learnt about his involvement, but is captured by Kanmani.\n\nRating 3: Meanwhile, Dayalan finds that Valavan was the one who wired and planted explosives in the drainage, and begins to search for him.\n\nRating 3: He also learns that Dark Devil and his team actually died a few months ago.\n\nRating 10: Ramachandran tries to prove that Dark Devil is alive by detonating a dummy bomb only to get killed when the bomb turns out to be a real one and explodes after the wire in it gets detached.\n\nRating 3: Dark Devil learns from Kanmani that there are ₹25,000 crores available in the bank.\n\nRating 4: Dark Devil tells Dayalan to arrange a meeting between him and chairman of Your Bank, Krish.\n\nRating 6: As Dark Devil deduced, the third team, revealed to be some of the bank's staff, attack Radha and his team in the locker, before assaulting Dark Devil and hold him captive.\n\nRating 5: Krish arrives and reveals that the third team were hired by him and tells them to destroy the bank's chest with explosives with hostage inside.\n\nRating 10: Krish also forces Dark Devil to reveal himself, where Dark Devil reveals that he and his teammates lived happily together like a family.\n\nRating 3: After having committed a heist in Bangkok, Dark Devil's members, Jijo and Achara planned to get married.\n\nRating 9: They all travelled to Araku Valley, Andhra Pradesh to arrange their marriage and celebrate, but they were ambushed by assailants sent by Krish and Shyam, who feared that they would reveal their heist plan to others.\n\nRating 8: Jijo and Achara got killed, but Dark Devil and Kanmani managed to escape and the killers faked their deaths for the rest of their deal money.\n\nRating 7: The duo reached the house of an old couple, who tends their wounds and revealed about his son Kavin, an honest bank official, who wanted to return the money to the people who invested in mutual funds.\n\nRating 10: However, Kavin was killed by Krish, and made it look like a mob did this during a strike.\n\nRating 10: Having learnt about this, Dark Devil and Kanmani decided to bring Krish and the bank officials to justice.\n\nRating 7: After the revelation, Dark Devil defeats Krish and his team, where he forces him on live to reveal about his financial scam of the ₹25,000 crore, which was invested in the mutual funds, and the atrocities committed against people by the bank officials.\n\nRating 8: Shyam, who was made to wear a bomb vest is sent to Dayalan, where he reveals everything about the heist and Krish's involvement in it, before he is killed by Kanmani's phone call.\n\nRating 3: Dark Devil also brings mutual funds chairman Harsha, who was abducted by Kanmani at gunpoint and Sunil Dutta, who was abducted from Mauritius by Dark Devil's men and was also responsible for stealing data from the NSE backup server of the Indian Stock Exchange.\n\nRating 8: Sunil confesses that he invested in 10 companies belonging to Krish and reveals that the ₹25,000 crore is in the bank's secret chest locker.\n\nRating 10: With the help of a mole in the media, Krish falsely frames Dark Devil and his team as terrorists, and cuts the live telecast.\n\nRating 10: Dayalan learns from Rajesh that everyone in the bank are going to be killed, except Krish, before commandos arrive and take control of the situation, and Dayalan is suspended.\n\nRating 10: In the bank, Dark Devil opens the secret locker with the help of Radha and his men, only to find that the money is counterfeit money.\n\nRating 8: Dark Devil locks Krish, Sunil and Harsha in the secret locker, before Krish reveals that the money is stacked in 25 of the 1500 containers of his ship, which he discreetly records as a video.\n\nRating 10: The commandos open fire, with the bank severely damaged.\n\nRating 8: Krish, Sunil and Harsha are killed in the secret locker by an explosive.\n\nRating 10: Kanmani arrives in a fire truck stuffed with RDX, and threatens to detonate them, unless the hostages are released, forcing the commandos to cease fire.\n\nRating 3: She along with Dark Devil, wearing masks, escape with the help of the public and reach a boat, planning to escape by sea, while Radha and his gang also escape in the ensuing chaos.\n\nRating 3: A chase ensues where Dark Devil, Kanmani, and the rest of their team shoot the commandos and coast guards, using an M2 Browning.\n\nRating 8: However, they get shot and fall into the sea.\n\nRating 8: Later, the media broadcasts the video which Dark Devil discreetly recorded, and Dayalan's suspension is revoked.\n\nRating 6: Meanwhile, Dark Devil and Kanmani fake their deaths and escape using sea scooters and reached their boat, settling in international waters.\n\nRating 3: Dayalan and his team board a helicopter to the ship, where they find the ₹25,000 crore."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Romantic Movies",
        "Mysteries",
        "Action & Adventure",
        "Spy Movies",
        "US Movies"
    ],
    "id": 70142888,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70142888",
    "index": 64,
    "name": "The Tourist",
    "maturity": "U/A 13+ ",
    "duration": "1h 43m",
    "synopsis": "An American tourist seeking solace for his shattered heart instead finds it in danger again after encountering a beautiful Interpol agent.",
    "year": "2010",
    "spoilers": "\n\nRating 3: A British woman, Elise Clifton-Ward , is being followed through downtown Paris by French police who are working with Scotland Yard under the direction of Inspector John Acheson .\n\nRating 8: Acheson has spent years hunting Alexander Pearce, Elise's lover, who owes £744 million in back taxes, and is believed to have received plastic surgery to alter his appearance.\n\nRating 8: He is also being hunted by Reginald Shaw , a mobster from whom Pearce stole $2.3 billion.\n\nRating 3: At a Parisian cafe, Elise receives written instructions from Pearce: board the train to Venice, Italy; pick out a man; and let the police believe that he is Pearce.\n\nRating 3: Elise burns the note, evades the police, and boards the train.\n\nRating 8: On the train, Elise selects Frank Tupelo , a mathematics teacher from a community college in Wisconsin.\n\nRating 4: Acheson salvages information about the plan from the remains of the burned note.\n\nRating 3: Aware of her location, but not of the ruse, a policeman on Shaw's payroll alerts Shaw that Pearce is on the train to Venice with Elise.\n\nRating 10: Shaw immediately proceeds to Venice.\n\nRating 10: In Venice, Elise invites Frank to stay with her at the Hotel Danieli, where she receives instructions from Pearce to attend a ball.\n\nRating 7: She abandons Frank, who is then chased by Shaw's men.\n\nRating 10: While trying to escape, he is detained by the Italian police, and a corrupt inspector attempts to turn him over to Shaw's men for a bounty.\n\nRating 3: Elise rescues Frank just before he is handed over, leading Shaw's men on an extended boat chase before finally escaping.\n\nRating 7: She leaves Frank at the airport with his passport and money, urging him to go home for his own safety.\n\nRating 8: Elise goes to see Acheson, who has come to Venice, and is revealed to be an undercover Scotland Yard agent who was under suspension for her suspected sympathies with Pearce.\n\nRating 8: She agrees to participate in a sting operation to bring Pearce to justice.\n\nRating 10: As she tries to find Pearce at the ball, a man places an envelope on her table and disappears into the crowd.\n\nRating 3: She tries to follow him, but is stopped by Frank, who claims to be in love with her and invites her to dance.\n\nRating 4: The police arrive and take Frank into protective custody.\n\nRating 8: Elise reads the note and leaves in her boat, tailed by Shaw and the police.\n\nRating 10: When Elise gets to the house to which Pearce's note directed her, Shaw takes her hostage, threatening to harm her unless she reveals the location of a hidden safe where Pearce is keeping the stolen money.\n\nRating 10: The police monitor the situation from outside, and Acheson repeatedly refuses to allow Italian police snipers to intervene to rescue Elise.\n\nRating 7: While the police are distracted monitoring the situation, Frank escapes and confronts Shaw, claiming to be Pearce and offering to open the safe if Elise is allowed to leave.\n\nRating 8: Shaw tells Frank to open the safe or he will have Elise tortured.\n\nRating 3: Chief Inspector Jones arrives at the police stake-out, overrides Acheson, and orders the snipers to fire, killing Shaw and his men.\n\nRating 10: Then, to Elise's obvious pleasure, Jones lifts her suspension and fires her.\n\nRating 8: Acheson receives a message that Pearce has been found nearby, but, on arrival, he learns the police have detained an Englishman who says he is only a tourist being paid to follow instructions and is not Pearce.\n\nRating 10: Elise tells Frank that she loves him, but she also loves Pearce.\n\nRating 3: Frank opens the safe by entering the correct code, revealing that he was Alexander Pearce all along.\n\nRating 9: When the police come back and open the safe with explosives, they find a check for £744 million.\n\nRating 10: Acheson wants to keep pursuing Pearce, but, since the taxes are now paid, Jones closes the case.\n\nRating 3: Pearce and Elise sail away together."
},{
    "genre": "Action",
    "related-genre": [
        "Hindi-Language Movies",
        "Dramas",
        "Action & Adventure"
    ],
    "id": 80204117,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80204117",
    "index": 65,
    "name": "Baahubali: The Beginning",
    "maturity": "U/A 13+ ",
    "duration": "2h 38m",
    "synopsis": "Villagers in the kingdom of Mahismati rescue a baby who is destined to embark on a heroic quest in this Hindi version of S.S. Rajamouli's epic.",
    "year": "2015",
    "spoilers": "\n\nRating 3: Near the ancient Indian kingdom of Mahishmati, an injured woman named Sivagami exits a cave underneath a mountain waterfall, carrying an infant.\n\nRating 10: She kills two soldiers pursuing her and attempts to cross a raging river, but slips and is washed away in the current.\n\nRating 3: Before drowning, she holds the baby aloft and prays to Lord Shiva, explaining that she doesn't care about her life and wishes that the baby, Mahendra Baahubali must live.\n\nRating 10: The child is saved by the people of the local Amburi tribe, who reside near the river and worship Lord Shiva.\n\nRating 8: The wife of the tribe's chieftain, Sanga, decides to adopt the boy and names him Sivudu.\n\nRating 10: Sivudu grows up to be an ambitious and mischievous child, obsessed with ascending the mountain.\n\nRating 8: Despite Sanga's pleas, he tries many times to scale the cliffs but always fails.\n\nRating 10: As a young man, he is shown to possess superhuman strength when he lifts a Lingam of Lord Siva and places it at the foot of the mountain.\n\nRating 8: A mask then falls from the cliffs, and realizing it possesses feminine features, Sivudu finally succeeds in scaling the mountain in order to find the woman the mask belongs.\n\nRating 10: Upon reaching the top, he sees a beautiful woman named Avantika fighting Mahishmati soldiers.\n\nRating 4: He discovers that she is a member of a local resistance group dedicated to overthrowing the tyrannical king of Mahishmati, Lord Bhallaladeva, and rescuing royal captive Princess Devasena.\n\nRating 8: Sivudu is immediately smitten with Avantika and secretly follows her, even managing to draw a tattoo on her hand while she sleeps.\n\nRating 6: When she discovers Sivudu she attacks him, but he outmaneuvers her and returns her mask.\n\nRating 10: Realizing he scaled the entire mountain to find her, she reciprocates his feelings and later they have sex.\n\nRating 8: After she quietly faints Sivudu and leaves, she gets attacked by more soldiers.\n\nRating 3: After Sivudu joins in, the pair are later attacked by more soldiers, and after defeating them, Sivudu pledges to rescue Devasena himself and departs for Mahishmati.\n\nRating 8: He secretly enters the city on Bhallaladeva’s birthday and assists in erecting a gigantic statue of the king.\n\nRating 8: In the process, he is recognized by a worker, who then leads the other workers in chanting 'Baahubali,' to Sivudu's confusion and Bhallaladeva's displeasure.\n\nRating 3: Sivudu later infiltrates the royal palace disguised as a soldier and distracts Bhallaladeva and his guards long enough for him to rescue Devasena.\n\nRating 8: Bhallaladeva sends his son, Bhadra, and the royal family's loyal slave Kattappa to recapture Devasena.\n\nRating 7: In the ensuing fight, Sivudu beheads Bhadra as both the Amburi tribe and resistance warriors arrive.\n\nRating 7: Kattappa lunges at Sivudu, but stops short of attacking him upon seeing his face.\n\nRating 6: He falls into submission at Sivudu's feet, proclaiming him to be \"Baahubali\".\n\nRating 9: The next morning, Kattappa reveals to Sivudu that Sivudu is actually Mahendra Baahubali, the son of Amarendra Baahubali, a famous warrior prince from Mahishmati.\n\nRating 3: Amarendra Baahubali was born an orphan; his father, King Vikramadeva, died before he was born and his mother died giving birth to him.\n\nRating 6: Lord Bijjaladeva, Vikramadeva's brother and the next in line for the throne, is denied the position due to his scheming nature, and as such Bijjaladeva's wife, Lady Sivagami, assumes power with the intention of raising both her son Bhallaladeva and the orphaned Baahubali in an equal manner to select the next heir to the throne.\n\nRating 10: While the two are raised as brothers and trained rigorously in numerous subjects, Bhallaladeva retains the power-hungry nature of his father while the affable Baahubali becomes beloved by the kingdom.\n\nRating 6: A traitor named Saketudu turns out to be a spy for the savage Kaalakeya tribe, known as destroyers of kingdoms.\n\nRating 6: Their chief Inkoshi declares war on Mahishmati, and Sivagami decides that whoever kills Inkoshi will be crowned king.\n\nRating 10: Bijjaladeva secretly supplies Bhallaladeva with more weapons and men, but Baahubali still defeats more raiders than Bhallaladeva by using innovative tactics and by inspiring his soldiers.\n\nRating 10: While Bhallaaladeva kills Inkoshi, Baahubali's valour and concern for the people of his kingdom convinces Sivagami to make Baahubali heir apparent.\n\nRating 10: In the present day, Sivudu's adoptive parents, impressed by Kattappa's story, wish to meet Baahubali.\n\nRating 3: A dejected Kattappa explains that Amarendra Baahubali is dead, and upon being questioned by Sivudu, he reveals that the traitor who murdered Baahubali was none other than him, setting a path for a sequel.\n\nRating 9: Kattapa is revealed to be the side companion of Mahendra's father."
},{
    "genre": "Action",
    "related-genre": [
        "Sci-Fi Movies",
        "Action & Adventure"
    ],
    "id": 80025919,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80025919",
    "index": 66,
    "name": "Mad Max: Fury Road",
    "maturity": "U/A 16+ ",
    "duration": "2h",
    "synopsis": "In a post-apocalyptic wasteland, Max helps a rebellious woman and a band of female prisoners flee from tyranny, fend off threats and seek their homeland.",
    "year": "2015",
    "spoilers": "\n\nRating 3: With the world a desert wasteland following societal collapse and warfare over resources, a survivor named Max Rockatansky, who is haunted by memories of all the people he has failed to protect, is captured and taken to warlord Immortan Joe's Citadel, where he is imprisoned and used as a \"blood bag\" for Nux, a sick War Boy.\n\nRating 8: Meanwhile, Imperator Furiosa, one of Joe's lieutenants, is sent in the armoured \"War Rig\" to trade produce for petrol and ammunition with two of Joe's allies.\n\nRating 3: When Joe realises his five wives are fleeing in the Rig, he leads his army in pursuit of Furiosa, calling on the aid of Gas Town and the Bullet Farm.\n\nRating 7: Nux joins the pursuit with Max strapped to his car, and a battle ensues.\n\nRating 10: Furiosa drives into a sand storm and loses all of her pursuers, except Nux, who attempts to sacrifice himself to blow up the Rig.\n\nRating 10: Max frees himself and restrains Nux, and Furiosa destroys their car.\n\nRating 5: After the storm, Max finds Furiosa repairing the Rig, accompanied by Joe's wives: Toast, Capable, the Dag, Cheedo, and Angharad, the last of whom is heavily pregnant with Joe's child.\n\nRating 10: Max tries to steal the Rig, but he does not know the code to bypass the kill switches, so he begrudgingly joins up with Furiosa and the wives.\n\nRating 8: Nux boards the Rig as it leaves and attempts to kill Furiosa.\n\nRating 8: He is overcome and thrown out, and Joe's army picks him up when they pass by.\n\nRating 3: Furiosa drives through a canyon controlled by a biker gang, having arranged to trade fuel for her safe passage, but the gang turns on her when they spot an army approaching, forcing her to flee.\n\nRating 8: The bikers detonate the canyon walls to block Joe and then pursue the Rig, only stopping when the fuel pod explodes.\n\nRating 8: Joe drives over the blockade in a monster truck and catches up with the Rig, allowing Nux to board and attack Furiosa again, but he trips before reaching the cab.\n\nRating 10: While helping Max, Angharad falls off the Rig and is fatally run over by Joe, who temporarily halts his pursuit.\n\nRating 3: Capable finds Nux hiding in the Rig and consoles him as he laments his failure.\n\nRating 8: After dark, Furiosa and Max slow Joe's forces with mines set in swampland, but Joe's ally, the Bullet Farmer, continues to pursue.\n\nRating 3: The Rig gets stuck, and Nux emerges from hiding to help free it, joining the crew.\n\nRating 3: Furiosa blinds the approaching Bullet Farmer, and Max confronts him and returns with guns and ammunition.\n\nRating 10: In the morning, Furiosa explains to Max that the \"Green Place\" to which they are escaping is an idyllic land she remembers from her childhood.\n\nRating 10: She recognises a familiar landmark and shouts out her history and clan affiliation to a woman on top.\n\nRating 8: The woman summons her all-female clan, the Vuvalini, who recognise Furiosa as one of their own who was kidnapped as a child.\n\nRating 10: Furiosa is devastated to learn that the swampland from the previous night was the Green Place, which is now uninhabitable, and there are only seven Vuvalini left.\n\nRating 3: The group, less Max, begins to ride across an immense salt flat, hoping to find a new home.\n\nRating 10: After seeing a vision of a child he failed to save, Max catches up and convinces the others to return the way they came and take the undefended Citadel, which has ample water and crops.\n\nRating 10: They meet Joe's forces and engage in battle.\n\nRating 7: Five Vuvalini and many members of Joe's forces are killed, and Toast is captured.\n\nRating 10: As they approach the canyon, Joe gets in front of the Rig to slow it.\n\nRating 3: While Max fights Joe's large adult son, Rictus Erectus, Furiosa, though seriously wounded, goes to save Toast and kills Joe.\n\nRating 10: The surviving brides and Vuvalini cross over to Joe's vehicle, and Nux sacrifices himself by wrecking the Rig to block the canyon, killing Rictus.\n\nRating 10: Max transfuses his blood to Furiosa, saving her life.\n\nRating 3: Back at the Citadel, the people rejoice upon learning of Joe's death and tear his corpse to pieces.\n\nRating 3: As Max's companions are lifted in triumph to Joe's cliffside fortress, Max exchanges a glance with Furiosa and disappears into the crowd."
},{
    "genre": "Action",
    "related-genre": [
        "Sci-Fi Movies",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 80081793,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80081793",
    "index": 67,
    "name": "Batman v Superman: Dawn of Justice",
    "maturity": "U/A 16+ ",
    "duration": "2h 31m",
    "synopsis": "It's the Man of Steel vs. the Caped Crusader when Batman becomes suspicious of Superman's increasing power, and Lex Luthor's happy to take advantage.",
    "year": "2016",
    "spoilers": "\n\nRating 3: In a flashback to his childhood, Bruce Wayne runs from his parents' funeral.\n\nRating 10: He falls into a cave, where a circling vortex of bats elevates him back to the surface.\n\nRating 10: Back in the present, eighteen months after the battle between Superman and General Zod in Metropolis, Superman has become a controversial figure.\n\nRating 10: Bruce is now a billionaire who has operated in Gotham City as the vigilante Batman for twenty years.\n\nRating 3: Having witnessed the chaos of the battle in person, he sees Superman as an existential threat to humanity.\n\nRating 6: After learning of Batman's form of justice, Clark Kent  seeks to expose him via Daily Planet articles.\n\nRating 6: Bruce learns that Russian weapon trafficker Anatoli Knyazev has been contacting LexCorp mogul Lex Luthor.\n\nRating 10: Meanwhile, Luthor attempts to persuade Senator June Finch to allow him to import kryptonite discovered after Zod's terraforming attempt, so that it can be used as a deterrent against future Kryptonian and metahuman threats.\n\nRating 8: She declines, but Luthor makes alternative plans with Finch's subordinate, granting him access to Zod's body and the Kryptonian scout ship.\n\nRating 8: Bruce attends a gala at LexCorp to steal encrypted data from the company's mainframe, but antiquities dealer Diana Prince takes it from him; she returns it after failing to access the information.\n\nRating 3: While decrypting the drive, Bruce dreams of a postapocalyptic world where he leads rebels against an evil Superman.\n\nRating 3: He is awakened by an unidentified person, appearing through a portal, who tells him that Lois Lane \"is the key\" and urges him to find \"the others\" before vanishing.\n\nRating 8: The decrypted drive reveals Luthor's files on several metahumans across the globe.\n\nRating 4: One is Diana, who appears in a photo from World War I. Wayne tells Alfred Pennyworth that he plans to steal and weaponize the kryptonite to go to war with Superman.\n\nRating 3: A widely publicized congressional hearing, led by Finch, is held to question Superman's actions against Zod.\n\nRating 3: A bomb smuggled in by Luthor detonates, killing everyone present except Superman.\n\nRating 10: Superman blames himself for not detecting it in time and self-imposes exile.\n\nRating 3: Elsewhere, Batman breaks into LexCorp and steals the kryptonite.\n\nRating 3: He builds a powered exoskeleton, a kryptonite grenade launcher, and a kryptonite-tipped spear.\n\nRating 10: Meanwhile, Luthor enters the Kryptonian ship and accesses its vast database of technology.\n\nRating 8: Luthor lures Superman out of exile by kidnapping Martha Kent, Clark's adoptive mother, and Lois, who he pushes off the LexCorp building.\n\nRating 8: Superman saves Lois and confronts Luthor, who reveals he manipulated him and Batman by fueling their distrust.\n\nRating 3: Luthor demands he kill Batman in exchange for Martha's life.\n\nRating 3: Superman tries to explain this to Batman, who instead attacks him and eventually subdues him using a kryptonite gas.\n\nRating 3: As Batman prepares to move in for the kill using the spear, Superman pleads with him to \"save Martha\" – the same name as Batman's mother.\n\nRating 8: Batman hesitates in confusion long enough for Lois to arrive and explain what Superman meant.\n\nRating 10: Coming to his senses about how far he has fallen from grace, he promises to rescue Martha.\n\nRating 8: Superman regains his strength and confronts Luthor on the scout ship.\n\nRating 8: Luthor executes his backup plan, unleashing a monster genetically engineered from DNA from both Zod's body and his own.\n\nRating 10: Diana arrives, joining Batman and Superman in their fight against the creature.\n\nRating 8: Superman realizes its vulnerability to kryptonite and retrieves the spear, fatally impaling the creature with it.\n\nRating 7: In its dying moments, the creature stabs Superman, who was weakened by kryptonite exposure, killing him.\n\nRating 10: Following Luthor's arrest, Batman confronts him in prison, warning him that he will always be watching.\n\nRating 5: Luthor gloats that Superman's death has made the world vulnerable to powerful alien threats.\n\nRating 10: A memorial is held for Superman in Metropolis.\n\nRating 3: Clark is also declared dead, and Bruce and Diana both attend his funeral in Smallville.\n\nRating 3: Martha gives Lois an envelope containing an engagement ring from Clark.\n\nRating 9: Bruce tells Diana that he regrets having failed Superman in life.\n\nRating 8: He asks her help to form a team of metahumans, starting with those named in Luthor's files, to protect the world in Superman's absence.\n\nRating 8: As they depart, the dirt atop Clark's coffin levitates."
},{
    "genre": "Drama",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Dramas",
        "Action & Adventure"
    ],
    "id": 81292944,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81292944",
    "index": 68,
    "name": "Gunjan Saxena: The Kargil Girl",
    "maturity": "U/A 13+ ",
    "duration": "1h 52m",
    "synopsis": "Flight Lieutenant Gunjan Saxena makes history in her journey from aspiring aviator to India’s first female combat pilot in the Kargil War.",
    "year": "2020",
    "spoilers": "\n\nRating 10: Beginning in Lucknow, 1984, the story begins with young Gunjan Saxena in a flight along with her older brother, Anshuman.\n\nRating 8: Gunjan wants to look out of the airplane window, but Anshuman doesn't let her.\n\nRating 10: A kind air hostess tends to the problem and takes Gunjan to the cockpit.\n\nRating 10: Looking at the cockpit immediately sparks a desire in her mind to become a pilot as she feels enthusiastic about the plane's features.\n\nRating 10: A few years later, Gunjan is congratulated for her academic excellence with her proud parents, Anup and Kirti, planning to send her to high school.\n\nRating 8: Gunjan, however, wants to drop out of high school to become a pilot.\n\nRating 3: Anshuman feels that women should not be in the cockpit, but in kitchen making food for the family, but Anup strongly disagrees.\n\nRating 10: A firm believer of gender equality, he allows Gunjan to experiment with her desire to become a pilot.\n\nRating 10: Gunjan makes multiple attempts, but these are thwarted by concerns regarding her educational qualifications and high costs, causing her to return home dejected \n\neach time.\n\nRating 10: While her parents differ in their outlook towards her dream, with Kirti hoping her daughter would soon be wary and Anup insistent on allowing his daughter to pursue her dreams relentlessly, an advertisement in a newspaper for acceptance into the Indian Air Force provides Gunjan just the right opportunity for making an effort to enter the air force.\n\nRating 10: Anshuman, who is himself serving in the army, completely disapproves and tells Gunjan that the Air Force isn't a place for women.\n\nRating 3: She, however, ignores him, and goes ahead with the formalities, later finding out on the day of the results that she is the only female who got accepted.\n\nRating 10: During her medical tests, Gunjan learns that she is one centimeter too short and seven kilograms too much for the Air Force requirements.\n\nRating 6: She is devastated by this, but learns that she can take a retest in two weeks, and discusses it with Anup, who asks her not to give up, and together they come up with a workout regime to lose weight.\n\nRating 8: Across the retest, she still falls short on the height criterion, but the officers conclude that the length of her hands and legs would compensate for it, and accept her into the force.\n\nRating 8: However, while Anup and Kirti are unable to contain their pride, Anshuman still remains in denial of his sister's dedication, but Gunjan decides to ignore his reservations and commences training.\n\nRating 8: During her training, she finds herself subjected to several harsh realities and inconveniences due to the male-dominated order of the air force, and contemplates leaving the camp, when a crisis situation causes her to reconsider when, in 1999, the Kargil war begins, and all Air Force pilots are needed.\n\nRating 8: Gunjan is determined to take part in the war, and despite Anshuman meeting her and dissuading her from participation, disregards his reservations yet again.\n\nRating 10: She finds herself badly needed in a mission and proceeds with it, but is then ordered to abort because the mission is too difficult for her.\n\nRating 3: She reluctantly resigns to the camp.\n\nRating 10: Suddenly, news of army soldiers being heavily wounded in the battle arrives, and it is up to her to save them.\n\nRating 6: Gunjan and another pilot take separate helicopters and go over to aid the injured soldiers.\n\nRating 3: Back at the camp, army soldiers ask her to abort the mission but regardless of their opinion, she proceeds.\n\nRating 10: Suddenly, as the other helicopter gets shot down from an RPG attack, Gunjan rescues the other pilot and the wounded soldiers and successfully completes a risky maneuver, despite being exposed to bullets herself.\n\nRating 10: After the mission and the war, she is rewarded for her courage and bravery, with Anup feeling proud of her."
},{
    "genre": "Action",
    "related-genre": [
        "Action & Adventure",
        "US Movies"
    ],
    "id": 80084088,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80084088",
    "index": 69,
    "name": "Gods of Egypt",
    "maturity": "U/A 13+ ",
    "duration": "2h 6m",
    "synopsis": "After losing control of Egypt to dark god Set, who brings chaos to the land, god Horus teams up with a mortal thief to save humankind.",
    "year": "2016",
    "spoilers": "\n\nRating 8: In an alternative ancient Egypt where the gods live among the mortals, King Osiris is killed by his jealous brother Set during the coronation of Osiris's son Horus.\n\nRating 10: Set then defeats Horus and takes his eyes, proclaiming himself the new king and commanding mankind to pay riches to pass into the afterlife.\n\nRating 8: One year later, with most of Egypt enslaved by Set, Zaya, a slave to Set's chief architect Urshu, gives plans for Set's pyramid to her lover, Bek.\n\nRating 3: Using them, Bek infiltrates Set's treasure vault and steals one of Horus's eyes, but he and Zaya are caught by Urshu, who kills Zaya as she and Bek escape.\n\nRating 3: Bek takes her body to the exiled Horus along with the eye, promising to help find the other if he brings Zaya back from the dead.\n\nRating 7: They visit the divine vessel of Horus's grandfather Ra.\n\nRating 8: Neutral about the conflict with Set, and at war with the shadow beast Apophis that threatens to devour the world, Ra does not restore Horus's power, but allows him to take a vial of divine waters to weaken Set.\n\nRating 10: Ra explains that Horus's loss of his powers is the result of not fulfilling his destiny, which Horus believes means avenging his parents' deaths.\n\nRating 4: Set asks Hathor to take him to the underworld, but she refuses and joins up with Bek and Horus.\n\nRating 7: They hatch a plan to infiltrate Set's pyramid, recruiting Thoth to solve the riddle of the guardian sphinx.\n\nRating 10: Overcoming the pyramid's entryway and the sphinx's riddle, they reach the source of Set's power.\n\nRating 3: Before they can use the divine water, they are ambushed by Set, who destroys the divine water and takes Thoth's brain, but Horus saves Hathor and Bek.\n\nRating 3: Hathor calls on Anubis to take Bek to the underworld and offers her bracelet as Zaya's payment for passage to the afterlife, sacrificing herself as doing so exiles her to the underworld.\n\nRating 10: Absorbing Thoth's brain, Osiris's heart, Horus's eye and wings from Nephthys, Set confronts Ra aboard his solar barge.\n\nRating 7: Ra explains Set's mistreatment were tests to prepare him to take Ra's place as defender of the world against Apophis.\n\nRating 3: Dismayed, Set decides to destroy the afterlife to become immortal, using his new powers to overpower Ra.\n\nRating 10: Taking Ra's spear and casting him off the barge, Set frees Apophis to consume the mortal and underworld realms.\n\nRating 8: As Apophis attacks the gates to the afterlife are closed.\n\nRating 8: Zaya, having refused Hathor's gift for not wanting an afterlife without Bek, encourages Bek to return to the mortal world and help Horus stop Set.\n\nRating 8: As Horus battles Set atop an obelisk, Bek defeats and kills Urshu, before removing Horus's other eye from Set's armor, mortally wounding himself in the process and falling from the great height.\n\nRating 10: Regaining his power to transform, Horus saves Bek from falling over retrieving his eye and flies him to safety, realizing that his true destiny was to protect his people.\n\nRating 10: With renewed strength, Horus outmaneuvers and kills Set.\n\nRating 10: Finding Ra wounded in the aether, Horus returns his spear, allowing Ra to repel Apophis and Anubis to reopen the gates.\n\nRating 3: A child returns Horus's other eye and the god lays a dying Bek in Osiris's tomb beside Zaya.\n\nRating 3: For his deeds, Ra offers to bestow Horus with any power, Horus asks that Bek and Zaya be brought back to life.\n\nRating 10: Ra grants his wish and the other gods are restored, except Horus's parents, who had already passed into the afterlife.\n\nRating 10: Horus is crowned king and declares access to the afterlife will be paid with good deeds in life.\n\nRating 3: Bek is made chief advisor and gives Horus Hathor's bracelet; Horus leaves to rescue her from the underworld."
},{
    "genre": "Sci-Fi",
    "related-genre": [
        "Family Features",
        "Sci-Fi Movies",
        "Comedies",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81309354,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81309354",
    "index": 70,
    "name": "The Adam Project",
    "maturity": "U/A 13+ ",
    "duration": "1h 46m",
    "synopsis": "After accidentally crash-landing in 2022, time-traveling fighter pilot Adam Reed teams up with his 12-year-old self on a mission to save the future.",
    "year": "2022",
    "spoilers": "\n\nRating 3: In a dystopian 2050, fighter pilot Adam Reed steals a time jet to escape to 2018 to save his wife, Laura.\n\nRating 3: In the process, he gets injured and crash-lands in 2022.\n\nRating 3: The story then shifts to 12-year-old Adam in 2022, whose father Louis died a year previously.\n\nRating 10: He is bullied at school, gets suspended for fighting in school, and is distant from his mother Ellie.\n\nRating 3: When he is home alone one night, he finds the injured future Adam.\n\nRating 10: The younger Adam refuses to trust the stranger, but future Adam inadvertently mentions the names of both the younger Adam and his dog, Hawking.\n\nRating 8: The younger Adam soon realizes that the stranger in front of him is his future self.\n\nRating 8: Due to a safety feature preventing him from flying because of his injuries, Adam must bring along the younger Adam and use his DNA to enter his jet.\n\nRating 3: They both are soon attacked by Maya Sorian, the leader of the dystopian world, and her assistant Christos, but are saved by Laura, who had faked her death and stayed off-grid in an unknown location.\n\nRating 3: After surviving the attack and comparing notes, Laura and the Adams realize that after the invention of time travel by Louis Reed and his subsequent death, Sorian had monopolized the discovery.\n\nRating 8: During her visit to 2018, Laura learned Sorian frequently came and advised her past self in order to secure her future wealth and power.\n\nRating 8: To protect her secret, Sorian ordered Laura's death.\n\nRating 10: Although Laura survived the assassination attempt, destruction of her time jet left her stranded in the past.\n\nRating 3: The sudden arrival of Sorian's goons interrupts the reunion, and Laura fights off the attack long enough for the two Adams to escape to 2018.\n\nRating 10: In 2018, the Adams meet Louis Reed in an attempt to enlist his help, but their father refuses any assistance out of concern for the effect on the time stream.\n\nRating 3: That night, Sorian meets and warns her past self about Adam.\n\nRating 8: Meanwhile, the Adams share their common feelings about their father in a motel.\n\nRating 10: The next day, they both set off to destroy the time travel machine.\n\nRating 10: On arrival at Sorian Technologies, they are attacked by Sorian's soldiers, but are unexpectedly saved by Louis, who has changed his mind and agrees to guide them.\n\nRating 8: Louis reveals that destroying the machine will not destroy time travel as long as Sorian has his algorithm with all the math and constraints to control the process.\n\nRating 10: Meanwhile, 2050 Sorian captures the younger Adam.\n\nRating 8: Although Louis and 2050 Adam remove a memory unit with the algorithm, both Sorians arrive and threaten 2022 Adam as leverage to coerce Louis into surrendering the algorithm.\n\nRating 10: 2050\n\nRating 10: Adam stalls and allows 2022 Adam to escape from Sorian by pushing her gun away, but an errant bullet damages the seal restraining the electromagnetic field, causing it to grow to limitless values.\n\nRating 10: The Reeds try as much as they can to stop them, but the older Sorian threatens to kill Louis.\n\nRating 8: Adam warns that her bullets are armor-piercing, but Louis remains adamant.\n\nRating 8: Seeing no other way, Sorian shoots at Louis, but the path of the bullet is altered by the electromagnetic field and hits 2018 Sorian instead, killing her and wiping both Sorians out of existence.\n\nRating 3: The Reeds barely manage to escape the facility's implosion and reach home, where they reconcile by playing a game of catch before the Adams return to their respective times.\n\nRating 10: In 2022, the younger Adam lives in a new timeline where he never got suspended, has let go of his anger, and gives his mother a hug via an \"echo\".\n\nRating 8: Sometime in the future, an older and much happier Adam meets Laura during a flight training lecture where she realizes, to Adam's amusement, she has entered the wrong building on the campus.\n\nRating 5: Adam offers to walk her to her building, stating that he has got time, and they depart together."
},{
    "genre": "Action",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Crime Movies",
        "Dramas",
        "Action & Adventure"
    ],
    "id": 80164778,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80164778",
    "index": 71,
    "name": "Raees",
    "maturity": "A ",
    "duration": "2h 23m",
    "synopsis": "After street smart kid Raees rises to become Gujarat's bootlegging king in the 1980s, he tries to balance his life of crime with helping his people.",
    "year": "2017",
    "spoilers": "\n\nRating 8: The film begins in the 1960s .\n\nRating 8: Raees, a sharp-minded boy, lives in Fatehpur, Gujarat, a dry state and gets involved in the illegal liquor trade from a young age.\n\nRating 4: He uses his mother's philosophy: no occupation is low and no religion greater than any occupation as a mechanism of self-deception.\n\nRating 3: Along with his best friend, Sadiq, he starts working for a local gangster, Jairaj — who prefers Raees as he comes up with novel ideas for smuggling.\n\nRating 8: As his power and influence grow, he decides to part ways with Jairaj and takes the help of a crime boss, Musabhai to start his own business.\n\nRating 10: He gains immense popularity in his community: he provides them liquor, employs them for receiving and delivering orders and thus enjoys political support from both the Chief Minister and Pashabhai, the leader of the opposition.\n\nRating 8: Meanwhile, an honest and powerful police officer, ACP J. A. Majmudar is transferred to Fatehpur and starts a major crackdown on alcohol dealers, focusing on Raees.\n\nRating 8: This affects most of the dealers except him as he manages to smuggle past Majmudar — leading to hostile relations and a failed assassination attempt by Jairaj.\n\nRating 10: Raees subsequently kills him in retaliation.\n\nRating 10: In the meantime, Raees marries his neighbour Aasiya and has a son with her.\n\nRating 3: At the baby shower, he convinces the CM to transfer Majmudar to the Police Control Room and takes on a new real-estate project offered to him.\n\nRating 10: With Majmudar gone and construction in full swing, all seems to be going well for him.\n\nRating 8: Majmudar, however, is still keeping track of his activities through phone taps and moles he planted earlier.\n\nRating 10: Raees publicly assaults Pashabhai over a disagreement and the CM sends him to jail temporarily as a PR stunt.\n\nRating 3: With Raees locked up, the CM and Pasha ally the upcoming local elections.\n\nRating 10: Realizing he has been betrayed, Raees decides to stand in the elections, uses his popularity and wins.\n\nRating 9: Seeing him as an imminent threat, the CM recalls Majmudar back to Fatehpur and declares his real-estate project's plot as protected land — rendering the construction illegal.\n\nRating 5: Raees incurs huge debt to his community, whom he had convinced to invest in the project.\n\nRating 10: To worsen the situation, communal rioting in the state leads to the imposition of a curfew jeopardizing his liquor business.\n\nRating 3: Completely broke, a desperate Raees reaches out to Musabhai for help, who offers him money for smuggling in gold by sea.\n\nRating 6: Soon, serial bombings occur across India.\n\nRating 8: Raees becomes aware that Musa used the gold as a cover to smuggle RDX.\n\nRating 9: The police lead a massive cross-country crackdown; all of Raees's associates are either caught or killed.\n\nRating 8: Heartbroken and grieving, Raees kills Musabhai and his men for using him to kill innocents.\n\nRating 7: Subsequently, he surrenders to Majmudar, well aware that he will kill him.\n\nRating 10: Majmudar and Raees deliberate over their time together, following which Majmudar shoots Raees.\n\nRating 10: As he falls, he recalls memories from his life and his mother's teachings.\n\nRating 10: Majmudar drives away, musing about Raees's last words."
},{
    "genre": "Comedies",
    "related-genre": [
        "Hindi-Language Movies",
        "Bollywood Movies",
        "Comedies",
        "Action & Adventure"
    ],
    "id": 81514149,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81514149",
    "index": 72,
    "name": "An Action Hero",
    "maturity": "U/A 16+ ",
    "duration": "2h 8m",
    "synopsis": "A murder accusation turns a movie star's own life into an eccentric action thriller as he flees the country, with a vengeful politician hot on his heels.",
    "year": "2022",
    "spoilers": "\n\nRating 10: Maanav is a popular actor, known as a leading man in action films.\n\nRating 3: For his upcoming film shoot, he heads to Mandothi in Haryana.\n\nRating 8: Vicky Solanki, an aspiring strongman politician currently contesting the local elections, wants to meet Maanav to gain publicity.\n\nRating 10: Due to busy shooting schedule Maanav does not pay heed.\n\nRating 8: Just when he is about to meet Vicky, he is distracted by the delivery of his new Ford Mustang and goes for a long drive.\n\nRating 7: However, an enraged Vicky follows and manhandles him.\n\nRating 10: Maanav enraged by Vicky's actions pushes him away.\n\nRating 10: Vicky dies from blunt force trauma, on the spot after landing head first on a rock.\n\nRating 8: Frightened, Maanav flees to his house in Portsmouth, UK.\n\nRating 3: Unbeknownst to him Vicky's brother, Bhoora Singh Solanki, a municipal councilor of Mandothi, is on his tail to hunt him down.\n\nRating 6: The Haryana police conclude role of Maanav in Vicky's murder citing the side mirror of Maanav's new Mustang.\n\nRating 10: Maanav's reputation is degraded and his films are boycotted.\n\nRating 5: The news reaches UK, as well, and Maanav is forced to hide himself from the UK police, and later witnesses Bhoora killing two British officers at his home.\n\nRating 10: Maanav manages to escape the scene and tries to seek help from his UK lawyer, who does not respond.\n\nRating 8: During his attempt to escape Maanav's car runs out of gas and Bhoora confronts him.\n\nRating 8: He tries to prove his innocence, but Bhoora does not listen and tries to kill him.\n\nRating 10: Maanav manages overpower and lock Bhoora in the car's trunk.\n\nRating 8: Upon pressuring his manager, Roshan, for help, Maanav finally gets to meet another lawyer and fixer, Sai, for capturing potential footage of Bhoora killing the two cops.\n\nRating 8: Sai tells Maanav to meet his contact in London, for collecting the footage.\n\nRating 8: Meanwhile, Bhoora escapes by calling a towing company and follows and kills Sai.\n\nRating 8: When Bhoora was about to kill Maanav, he is intercepted by Kaadir, Sai's friend.\n\nRating 7: Maanav and Bhoora together overpower Kaadir, but Maanav gets in the car and flees again leaving Bhoora behind.\n\nRating 8: Bhoora manages to learn of Maanav's whereabouts from Kaadir as a hostage.\n\nRating 8: Meanwhile, Maanav gets fed up of hiding, and surrenders himself to the police with the footage that Sai's contact procured from the dashcams of the cars nearby Maanav's house in Portsmouth.\n\nRating 8: Masood Abraham Katkar, a feared terrorist from the D-Company, who was taunted by Maanav as irrelevant, abducts him through his men.\n\nRating 8: He is taken to a rooftop, where Katkar is awaiting him.\n\nRating 7: Katkar takes a photograph with Maanav, seemingly planning on sending it to the media, to paint a picture that Maanav has contacts in the underworld.\n\nRating 8: Katkar tells Maanav to perform at his granddaughter's wedding, in exchange for his freedom.\n\nRating 8: Bhoora arrives and disrupts Maanav's dance number, only to be held at gunpoint, by Katkar's men.\n\nRating 3: After an interrogation, Katkar advises Bhoora to kill Maanav.\n\nRating 8: His image with Katkar becomes viral on social media and the news, just as Bhoora is about to shoot, Maanav deflects him and Katkar was shot dead in the skirmish.\n\nRating 3: Katkar's men are alerted and arrive to kill them both.\n\nRating 10: Maanav and Bhoora manage to defeat Katkar's men, before turning on each other.\n\nRating 3: With his newfound inner strength, Maanav defeats and wounds Bhoora.\n\nRating 7: Later, Maanav formulates a plan to make a deal with the Indian Embassy to project a story that the government used Maanav's situation and assigned him for the mission to track and kill Katkar, thus saving him from imprisonment.\n\nRating 10: Bhoora refuses to spare him, out of ego, despite fully being aware of his innocence from the beginning.\n\nRating 10: With no choice left, Maanav kills Bhoora and his plan succeeds and returns to India to find himself surrounded by greetings from his fans and the public outside the Mumbai airport."
},{
    "genre": "Drama",
    "related-genre": [
        "Family Features",
        "Dramas",
        "Movies Based on Books",
        "Action & Adventure"
    ],
    "id": 80993105,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/80993105",
    "index": 73,
    "name": "Mowgli: Legend of the Jungle",
    "maturity": "U/A 13+ ",
    "duration": "1h 44m",
    "synopsis": "An orphaned boy raised by animals in the jungle seizes his destiny while confronting a dangerous enemy -- and his own human origins.",
    "year": "2018",
    "spoilers": "\n\nRating 7: In the jungles of India, the gigantic Indian python seer Kaa watches as Shere Khan, a sadistic Bengal tiger, breaks \"jungle law\" by killing a family of humans.\n\nRating 3: The panther Bagheera finds a surviving infant boy and takes him to Nisha and Vihaan's family of Indian wolves, but the child is spotted by Tabaqui, Shere Khan's hyena lackey.\n\nRating 3: The \"man-cub\" is brought before the wolf council, where Bagheera strong-arms Baloo, a Himalayan brown bear, into serving as his fellow guardian.\n\nRating 3: Shere Khan arrives to kill the child, but Akela, leader of the wolves, declares that the boy is under the pack's protection.\n\nRating 8: Shere Khan warns that when Akela misses his prey, he will return to kill the boy.\n\nRating 3: The child, now known as Mowgli, is adopted by Nisha and raised with the wolves.\n\nRating 5: Years pass, and Mowgli encounters Shere Khan, who has antagonized the nearby \"man-village\" by killing their cattle.\n\nRating 8: Mowgli falls into a tiger trap set by the villagers, but is saved by Hathi, an Indian elephant missing half a tusk.\n\nRating 7: Bagheera reveals to Mowgli that he is human, but Mowgli is determined to complete \"the Running\", the trial to earn full membership in the pack.\n\nRating 8: Bagheera urges Mowgli to leave the jungle for the village, where he will be safe from Shere Khan; watching the village from afar, Mowgli learns of the existence of fire.\n\nRating 10: During the Running, as Bagheera chases the young wolves to prove their skill, Mowgli uses his ability to climb and run upright to gain the lead.\n\nRating 3: Desperate to keep him safe, Bagheera unfairly foils Mowgli and is confronted by Baloo.\n\nRating 4: Mowgli is kidnapped by the Bandar-log tribe of monkeys and brought to Shere Khan, but Baloo and Bagheera arrive to save him.\n\nRating 10: They are overwhelmed by the monkeys, and Mowgli is rescued by Kaa.\n\nRating 7: Having failed the Running, an angry Mowgli rejects the friendship of Bhoot, the albino runt of the wolf cubs, and visits Kaa, who believes he can restore harmony to the jungle.\n\nRating 9: While hunting, the aging Akela fails to bring down his prey, leading Shere Khan to remind the pack they must now challenge Akela for the role of leader.\n\nRating 10: As the wolves fight, Mowgli steals a burning branch from the village and repels Shere Khan and the challengers, but shames Akela and is exiled from the pack.\n\nRating 3: A feral Mowgli is captured by the villagers and John Lockwood, a British hunter.\n\nRating 5: Bagheera tells Mowgli that he must stay with the villagers and gain their trust, as Bagheera did to escape captivity himself.\n\nRating 10: Mowgli comes to enjoy life in the village, cared for by the kindly Messua and learning hunting skills from Lockwood, who is tracking Shere Khan.\n\nRating 8: Mowgli's wolf-sibling Gray Brother informs him that Shere Khan has driven away the wolves loyal to Akela and continues to kill cattle, endangering all the jungle's animals, but Mowgli refuses to help.\n\nRating 3: While the villagers celebrate Holi, Mowgli learns that it was Lockwood who shot off Hathi's tusk and discovers his hunting trophies, including the head of Bhoot.\n\nRating 8: Returning the tusk to Hathi, Mowgli offers him the hunter in exchange for ridding the jungle of Shere Khan.\n\nRating 8: Mowgli meets with Baloo, Bagheera, and the wolf pack, who refuse to go against jungle law to help him defeat Shere Khan.\n\nRating 8: Undeterred, Mowgli lures Shere Khan to the edge of the village, where the tiger is surrounded by Hathi's elephant herd.\n\nRating 8: Lockwood shoots at Shere Khan but wounds Mowgli instead, and Akela sacrifices himself to save the boy, while Lockwood is killed by Hathi.\n\nRating 6: The other animals come to Mowgli's aid, forcing Shere Khan to retreat, and the dying Akela names Mowgli as his successor.\n\nRating 3: With Messua and the village watching, Mowgli returns to the jungle and slays the mortally wounded Shere Khan.\n\nRating 10: Kaa explains that with Shere Khan and Lockwood gone, Mowgli gave the animals a voice and brought peace to the jungle."
},{
    "genre": "Action",
    "related-genre": [
        "Crime Movies",
        "Comedies",
        "Movies Based on Books",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 81511779,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81511779",
    "index": 74,
    "name": "Bullet Train",
    "maturity": "A ",
    "duration": "2h 6m",
    "synopsis": "Five assassins board a Japanese bullet train bound for Kyoto and come to discover that their seemingly separate missions are mysteriously linked.",
    "year": "2022",
    "spoilers": "\n\nRating 3: Yuichi Kimura \"The Father\" boards a bullet train in Tokyo in search of the one who pushed his son Wataru off of a roof .\n\nRating 7: Meanwhile, guided by his handler Maria Beetle, operative \"Ladybug\" is assigned to retrieve a briefcase full of cash from the same train, replacing a sick colleague, Carver.\n\nRating 10: Ladybug is reluctant, as his recent string of bad luck during his jobs resulted in accidental deaths.\n\nRating 3: Also on the train are two English assassin brothers \"The Twins\", codenamed \"Lemon\" and \"Tangerine\", who just rescued a man  from kidnappers and are taking him and the briefcase to his father, a Russian-born Yakuza boss called \"The White Death\".\n\nRating 10: During the trip, The Son is killed by poisoning.\n\nRating 8: Ladybug discreetly steals the briefcase, but on his way off the train, is attacked by another assassin, codenamed \"The Wolf\", who recognizes Ladybug from his wedding, where his wife was killed.\n\nRating 10: The Wolf mistakenly believes Ladybug to be one of her killers.\n\nRating 10: Ladybug confusedly fights The Wolf, who accidentally kills himself with a deflected knife throw.\n\nRating 10: Yuichi finds the person who pushed Wataru, a young woman codenamed \"The Prince\" , but she overpowers him.\n\nRating 8: She explains that she pushed Wataru off a roof to lure Yuichi to the train as part of a plan to have him kill his boss: the White Death.\n\nRating 4: To ensure his cooperation, she has a henchman holding Wataru hostage in the hospital.\n\nRating 3: Ladybug, recognizing Lemon from a job in Johannesburg gone wrong, offers to return the case in exchange for being allowed to leave.\n\nRating 9: Lemon suspects that Ladybug killed The Son, leading to a fight.\n\nRating 7: Lemon is knocked unconscious during the fight, and privately discusses Ladybug's innocence to Tangerine , before both split off to find Ladybug and frame him for the Son's murder.\n\nRating 5: The Prince finds the briefcase, booby-traps it with explosives, and rigs Yuichi's gun to explode if fired.\n\nRating 3: Ladybug encounters Tangerine, and after avoiding the White Death's men, kicks Tangerine off the train as the train departs, who manages to climb back aboard from outside.\n\nRating 10: Suspicious of the two, Lemon shoots Yuichi but collapses after drinking from a water bottle Ladybug had previously spiked with sleeping powder.\n\nRating 3: The Prince shoots Lemon and conceals him and Yuichi in a bathroom.\n\nRating 6: Ladybug encounters yet another assassin, \"The Hornet\", who poisoned both the Wolf's wedding party and the Son with the venom of a boomslang snake.\n\nRating 8: After a struggle, both are exposed to the venom, but only Ladybug receives an anti-venom that saves him.\n\nRating 3: Tangerine runs into the Prince and notices one of Lemon's train stickers on her, realizing that she shot Lemon.\n\nRating 9: Ladybug interrupts them, and Tangerine is killed before he can shoot the Prince.\n\nRating 10: At the next stop, Yuichi's father, \"The Elder\", boards the train.\n\nRating 10: He recognizes the Prince's voice and informs her that Wataru is safe, as her henchman has been killed by his guard.\n\nRating 8: After she flees, the Elder tells Ladybug he will remain to confront the White Death, who killed his wife while taking over the Yakuza.\n\nRating 8: Finding Yuichi and Lemon still alive, the four work together to make preparations to face the White Death.\n\nRating 3: At Kyoto, Ladybug gives the White Death the briefcase.\n\nRating 10: The Prince, revealed to be the White Death's daughter, fails to goad him into shooting her with the rigged gun.\n\nRating 10: The White Death explains that everyone on the train was linked to the death of his wife.\n\nRating 10: He hired them hoping they would kill each other, not knowing Carver  was replaced by Ladybug.\n\nRating 8: The White Death's henchmen open the briefcase, which explodes, knocking Ladybug and the White Death back onto the train.\n\nRating 8: The White Death's remaining henchmen board and battle the assassins, while the Elder duels the White Death.\n\nRating 3: The train crashes into downtown Kyoto.\n\nRating 10: Emerging from the wreck, impaled with the Elder's katana, the White Death tries to kill Ladybug, but the Prince's rigged gun explodes in his face.\n\nRating 10: The Prince threatens Ladybug, Yuichi, and the Elder with a machine gun but is run over by a fruit truck driven by Lemon, who fell off the train earlier.\n\nRating 3: Maria arrives to retrieve Ladybug, while Japanese authorities begin to clean up the damage caused by the train crash."
},{
    "genre": "Drama",
    "related-genre": [
        "Dramas",
        "Movies Based on Real Life",
        "Action & Adventure"
    ],
    "id": 81242575,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/81242575",
    "index": 75,
    "name": "Major",
    "maturity": "U/A 16+ ",
    "duration": "2h 25m",
    "synopsis": "This biopic follows the life of Indian Army officer Major Sandeep Unnikrishnan, from his childhood to his heroic actions during the 2008 Mumbai attacks.",
    "year": "2022",
    "spoilers": "\n\nRating 10: The movie starts with Sandeep Unnikrishnan entering the POK, which the Pakistani Army considers a threat and orders him to retreat.\n\nRating 3: When questioned by the Indian Army Officials on why he did it and that the area belongs to Pakistan, he replies \"It is ours\".\n\nRating 10: Young Sandeep grows up with his sister, Sandhya, and his parents K. Unnikrishnan and Dhanalakshmi, in Yelahanka, Bangalore.\n\nRating 10: As a child, he was very curious about the world around him.\n\nRating 10: When Unnikrishnan took him to see a Navy ceremony with military airplanes flying in the sky Sandeep developed an early fascination with the life of a soldier.\n\nRating 10: In his later years as a secondary school student, Sandeep falls in love with his classmate, Isha.\n\nRating 3: Sandeep applied to join the Indian Navy without telling his parents, much to the fury of Unnikrishnan.\n\nRating 3: However, the Navy rejected Sandeep's application, causing Sandeep to ultimately join the army.\n\nRating 10: As the years progressed, Sandeep rises  ranks to become an NSG training officer.\n\nRating 5: In 2008, Sandeep is well established in his career as a training officer for the 51 Special Action Group of the NSG and is married to Isha, but their marriage is in trouble.\n\nRating 8: Sandeep asks for leave to try and save his marriage.\n\nRating 3: On the same day as Sandeep's leave though, Pakistani terrorists arrive in Mumbai by boat and they proceed to orchestrate deadly attacks in the city.\n\nRating 3: Desperately crowds start heading to the Taj Hotel for safety but the terrorists also enter the hotel and start shooting at staff and guests spontaneously.\n\nRating 10: The local police are called to the scene but they are ill-equipped to deal with the threat.\n\nRating 3: Upon discovering the terrorist attacks in Mumbai, Sandeep requests Commander Shera to allow him to participate in the NSG mission to neutralize the terrorist threat.\n\nRating 8: They leave for Mumbai and commence the military counterterrorism operation: Operation Black Tornado, but the NSG encounters numerous obstacles and problems upon arriving at the scene.\n\nRating 10: They lack surveillance cameras to discover the number of people inside the building.\n\nRating 8: The terrorists have installed deadly booby traps and trip wires with bombs throughout the premises.\n\nRating 8: Several hotel staff and guests end up crowded together in a locked room, all bound and gagged on the floor.\n\nRating 10: To make matters worse there is an intrusive media circus swarming outside the hotel reporting the NSG's known operations and movements, information which the terrorists use.\n\nRating 3: Meanwhile, a guest named Pramoda Reddy, who is trapped on the fifth floor, manages to keep herself hidden from the gunmen.\n\nRating 10: She ultimately takes responsibility to rescue British tourist's young daughter, named Shirley.\n\nRating 8: Sandeep talks to Isha over the phone.\n\nRating 8: She is applying for divorce and scolds Sandeep for not being there with her when she had a miscarriage, but she is horrified when she discovers that Sandeep is at the Taj Hotel.\n\nRating 10: As the NSG rescue more hostages  and starts closing in on the remaining terrorists, Pramoda calls the downstairs lobby using a walkie-talkie from one of the dead security guards.\n\nRating 8: Sandeep ultimately decides to go to the 5th floor to save them, saying that he would never be able to forgive himself if he did not save her.\n\nRating 6: His colleagues subsequently use tear gas and Sandeep races up to the 5th floor.\n\nRating 10: He ultimately rescues Pramoda and Shirley and heroically kills some of the terrorists.\n\nRating 10: However, when his CO asks him whether he needs reinforcement or not, he refuses.\n\nRating 8: His last words are \"Do not come up, I will handle them.\"\n\nRating 6: But as fate would have it, he is killed in action, laying down his life for his country.\n\nRating 3: Major Sandeep's parents watch in horror as the news coverage shows that Sandeep was killed in action.\n\nRating 10: They had thought that since Sandeep was a training officer he was not involved in the rescue mission at the Taj Hotel.\n\nRating 10: After his death, there is a large military funeral and a crowd of well-wishers gather to mourn Sandeep's passing.\n\nRating 10: Isha is devastated at Sandeep's death and discovers that he never signed the divorce papers.\n\nRating 3: Later, a 10-year commemoration ceremony in 2018 honoring the lives taken during the attack is held at the Taj Hotel.\n\nRating 10: During the commemorations, Pramoda is reunited with Shirley whose life she had saved.\n\nRating 7: Mr. Unnikrishnan gives an impassioned speech in which he says that Sandeep should be remembered not for how he died, but for how he lived.\n\nRating 8: As Unnikrishnan recalls during his speech, a flashback shows the continuation of the beginning of the movie.\n\nRating 8: It is shown that Sandeep was playing cricket with the children from Pakistan, and when he was called back, he waves goodbye and promises the children that he would come to play another time."
},{
    "genre": "Action",
    "related-genre": [
        "Action & Adventure",
        "US Movies"
    ],
    "id": 70079583,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70079583",
    "index": 76,
    "name": "The Dark Knight",
    "maturity": "U/A 16+ ",
    "duration": "2h 32m",
    "synopsis": "Batman, Lieutenant Gordon and District Attorney Harvey Dent go up against the Joker, a criminal mastermind in ghoulish makeup terrorizing Gotham City.",
    "year": "2008",
    "spoilers": "\n\nRating 3: A gang of masked criminals robs a mafia-owned bank in Gotham City, each betraying and killing each other until the sole survivor, the Joker, reveals himself as the mastermind and escapes with the money.\n\nRating 8: The vigilante Batman, district attorney Harvey Dent, and police lieutenant Jim Gordon ally to eliminate Gotham's organized crime.\n\nRating 10: As Batman's alter-ego, the billionaire Bruce Wayne, publicly supports Dent as Gotham's legitimate protector, believing his success will allow Batman to retire so Wayne can romantically pursue his childhood friend Rachel Dawes, despite her relationship with Dent.\n\nRating 10: Gotham's mafia bosses gather to discuss protecting their organizations from the Joker, the police, and Batman.\n\nRating 8: The Joker interrupts the meeting and offers to kill Batman for half of the fortune their accountant, Lau, concealed before fleeing to Hong Kong to avoid extradition.\n\nRating 10: With the help of Wayne Enterprises CEO Lucius Fox, Batman finds Lau in Hong Kong and returns him to the custody of Gotham police.\n\nRating 10: His testimony enables Dent to apprehend the crime families.\n\nRating 3: The bosses accept the Joker's offer, and he kills high-profile targets involved in the trial, including the judge and police commissioner.\n\nRating 6: Although Gordon saves the mayor, the Joker threatens that his attacks will continue until Batman reveals his identity.\n\nRating 9: He targets Dent at a fundraising dinner and throws Rachel out of a window, but Batman rescues her.\n\nRating 7: Wayne struggles to understand the Joker's motives, but his butler Alfred Pennyworth says some simply relish destruction.\n\nRating 3: Dent claims he is Batman to lure out the Joker, who attacks the police convoy transporting him.\n\nRating 10: Batman and Gordon apprehend the Joker, and Gordon is promoted to commissioner.\n\nRating 8: At the police station, Batman interrogates the Joker, who says he finds Batman entertaining and has no intention of killing him.\n\nRating 3: Having deduced Batman's feelings for Rachel, the Joker reveals she and Dent are being held separately in buildings rigged to explode.\n\nRating 6: Batman races to save Rachel while Gordon and the other officers go after Dent, but they discover the Joker has switched their positions.\n\nRating 10: Rachel is killed in the explosion, while Dent's face is severely burned on one side.\n\nRating 8: The Joker escapes custody, extracts the fortune's location from Lau, and burns all of it, killing Lau in the process.\n\nRating 10: Wayne Enterprises accountant Coleman Reese deduces Batman's identity and attempts to expose it, but the Joker threatens to blow up a hospital unless Reese is killed.\n\nRating 6: While the police evacuate hospitals and Gordon struggles to keep Reese alive, the Joker meets with a disillusioned Dent, persuading him to take the law into his own hands and avenge Rachel.\n\nRating 8: Dent defers his decision-making to his half-scarred, two-headed coin, killing the corrupt officers and the mafia involved in Rachel's death.\n\nRating 10: As panic grips the city, the Joker reveals two evacuation ferries, one carrying civilians and the other prisoners, are rigged to explode at midnight unless one group sacrifices the other.\n\nRating 8: To the Joker's disbelief, the passengers refuse to kill one another.\n\nRating 8: Batman subdues the Joker but refuses to kill him.\n\nRating 10: Before the police arrest the Joker, he says although Batman proved incorruptible, his plan to corrupt Dent has succeeded.\n\nRating 5: Dent takes Gordon's family hostage, blaming his negligence for Rachel's death.\n\nRating 8: He flips his coin to decide their fates, but Batman tackles him to save Gordon's son, and Dent falls to his death.\n\nRating 8: Believing Dent is the hero the city needs and the truth of his corruption will harm Gotham, Batman takes the blame for his death and actions and persuades Gordon to conceal the truth.\n\nRating 9: Pennyworth burns an undelivered message to Wayne from Rachel, who said she chose Dent, and Fox destroys the invasive surveillance network that helped Batman find the Joker.\n\nRating 3: The city mourns Dent as a hero, and the police launch a manhunt for Batman."
},{
    "genre": "Fantasy",
    "related-genre": [
        "Family Features",
        "Movies Based on Books",
        "Action & Adventure",
        "US Movies"
    ],
    "id": 70178621,
    "tag": "Action Movies",
    "image": "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==",
    "source": "https://www.netflix.com/in/title/70178621",
    "index": 77,
    "name": "Journey 2: The Mysterious Island",
    "maturity": "U/A 13+ ",
    "duration": "1h 34m",
    "synopsis": "When a distress signal pinpoints his grandfather's location on an uncharted island, teen Sean Anderson teams with an unlikely ally: his stepfather.",
    "year": "2012",
    "spoilers": "\n\nRating 10: Four years after his adventure in the center of the earth, 17-year-old Sean Anderson is arrested by the police for breaking into a satellite control center in hopes of enhancing a coded signal that could have been sent by his long-missing grandfather, Alexander Anderson.\n\nRating 10: Wanting to bond with Sean, his new stepfather Hank Parsons helps decipher the code, which leads to three books: Treasure Island, Gulliver's Travels, and Jules Verne's Mysterious Island.\n\nRating 3: Using the books' individual maps, Hank uses a backlight to make them a single island, complete with the coordinates to its location.\n\nRating 8: Hoping to prove to Sean that there is no mysterious island there, Hank agrees to take him to where the coordinates point to.\n\nRating 8: In Palau, Hank reluctantly hires helicopter tourism guide Gabato Laguatan and his daughter Kailani  to fly to the coordinates, as they are the only ones willing to take them.\n\nRating 7: The helicopter gets caught in a cyclone and they crash into the Pacific, waking up on the island.\n\nRating 10: Moving inland, they are shocked to discover miniature elephants  and giant butterflies.\n\nRating 3: After coming across an egg clutch, Gabato accidentally wakes up a giant frilled lizard, which chases them throughout the jungle.\n\nRating 8: They nearly get eaten, but are saved by Alexander.\n\nRating 8: He takes them to a hut he built from the wreckage of the ship that brought him to the island.\n\nRating 10: He has a working radio, but due to the positioning of the satellite, it will be two weeks before they can call out.\n\nRating 10: The next morning, Alexander leads the group to the lost city of Atlantis, which rises every 70 years and sinks again after a couple of days.\n\nRating 10: Their only means of salvation seems to be the legendary Nautilus, Captain Nemo's submarine.\n\nRating 3: Kailani enters Nemo's crypt and finds his journal, which shows that Nautilus is in a cave at Poseidon's Cliffs.\n\nRating 10: To go there, they mount giant bees and fly over a high ridge.\n\nRating 3: When giant bee-eater birds try to devour them, Sean saves Kailani's life, but dislocates his ankle.\n\nRating 10: Hank and Alexander reset Sean's ankle, then the group has a bonding moment when Hank sings his rendition of \"What a Wonderful World\" to ease Sean's pain.\n\nRating 7: The next morning, the water rises greatly and Hank deduces that the island will sink in a matter of hours.\n\nRating 10: Gabato is missing, having gone toward the island's volcano in search of gold.\n\nRating 3: While Alexander and Kailani go after him, Sean and Hank head for Poseidon's Cliffs.\n\nRating 8: To reach Nautilus' underwater cave, Sean and Hank create makeshift oxygen tanks and dive down fifty feet, but are nearly killed by a giant electric moray eel.\n\nRating 10: The 140-year-old batteries have run down, so they engineer a way to start the submarine with the eel's electricity.\n\nRating 10: Kailani and Alexander find Gabato and convince him to escape with them instead of trying for the volcano.\n\nRating 3: As they near Poseidon's Cliffs, the volcano erupts.\n\nRating 6: Sean and Hank arrive in Nautilus just in time to rescue the others from the water.\n\nRating 3: Gabato pilots the submarine out of harm's way while Hank and Sean fire torpedoes into the path of falling debris.\n\nRating 10: As they clear the dangers, Kailani kisses Sean for his bravery.\n\nRating 10: Six months later, Kailani and Gabato are well off, as he runs the most popular tourist attraction on Palau – tours aboard the Nautilus.\n\nRating 10: Kailani visits Sean on his birthday.\n\nRating 10: While the family celebrates, Alexander arrives with a book for Sean's birthday present – Jules Verne's From the Earth to the Moon, Alexander's suggestion for the next new adventure with the family.\n\nRating 7: The film ends with the camera panning to the moon."
}]